[
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "Preamble – Preamble",
        "chunk_id": 1,
        "content": "﻿THE FATAL ACCIDENTS ACT An Act of Parliament for compensating the families of persons killed in accidents."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "1 – Short title",
        "chunk_id": 1,
        "content": "This Act may be cited as the Fatal Accidents Act."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "2 – Interpretation",
        "chunk_id": 1,
        "content": "In this Act, except where the context otherwise requires— \"child\" means a son, daughter, grandson, granddaughter, stepson or stepdaughter; \"parent\" means a father, mother, grandfather, grandmother, stepfather or stepmother. For the purposes of this section a person shall be deemed to be the child or parent of the deceased person notwithstanding that he was only related to him illegitimately or in consequence of adoption; and accordingly in deducing any relationship which under the provisions of this section is included within the meaning of the expressions \"child\" and \"parent\", any illegitimate person and any adopted person shall be treated as being, or as having been, the legitimate offspring of his mother and reputed father or, as the case may be, of his adopters."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "2 – Interpretation",
        "chunk_id": 2,
        "content": "In this section \"adopted person\" means a person who has been adopted under the provisions of any law for the time being in force in the country in which the adoption took place."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "3 – Action maintainable against person causing death through wrongful act",
        "chunk_id": 1,
        "content": "Whenever the death of a person is caused by a wrongful act, neglect or default, and the act, neglect or default is such as would (if death had not ensued) have entitled the person injured to maintain an action and recover damages in respect thereof, the person who would have been liable if death had not ensued shall be liable to an action for damages notwithstanding the death of the person injured and although the death was caused under such circumstances as amount in law to felony."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "4 – Action to be for benefit of family of deceased",
        "chunk_id": 1,
        "content": "(1) Every action brought by virtue of the provisions of this Act shall be for the benefit of the wife, husband, parent and child of the person whose death was so caused, and shall, subject to the provisions of section 7, be brought by and in the name of the executor or administrator of the deceased person. In every such action, the court may award such damages as it may think proportioned to the injury resulting from the death to the persons respectively for whom and for whose benefit the action is brought; and the amount so recovered, after deducting the costs not recovered from the defendant, shall be divided amongst those persons in such shares as the court by its judgment shall find and direct."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "4 – Action to be for benefit of family of deceased",
        "chunk_id": 2,
        "content": "Provided that not more than one action shall lie in respect of the same subject matter of complaint, and that every such action shall be commenced within three years after the death of the deceased person. (2) In assessing damages under the provisions of subsection (1), the court shall not take into account— (a) any sum paid or payable on the death of the deceased under any contract of assurance or insurance, whether made before or after the passing of this Act; (b) any widow's or orphan's pension or allowance payable, or any sum payable under any contributory pension or other scheme declared by the Minister, by notice published in the Gazette, to be a scheme for the purpose of this paragraph."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "5 – Payment into court",
        "chunk_id": 1,
        "content": "Notwithstanding the provisions of section 4, it shall be sufficient, when the defendant pays money into court, that he pays it as compensation in one sum to all persons entitled under that section to damages for his wrongful act, neglect or default, without specifying the shares into which it is to be divided by the court; and if that sum is not accepted, and an issue is taken by the plaintiff as to its sufficiency, and the court thinks it sufficient, the defendant shall be entitled to judgment on that issue."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "6 – Funeral expenses may be awarded",
        "chunk_id": 1,
        "content": "In an action brought by virtue of the provisions of this Act the court may award, in addition to any damages awarded under subsection (1) of section 4, damages in respect of the funeral expenses of the deceased person, if those expenses have been incurred by the parties for whom and for whose benefit the action is brought."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "7 – Action by persons beneficially interested",
        "chunk_id": 1,
        "content": "If at any time, in any case intended and provided for by this Act, there is no executor or administrator of the person deceased, or if no action is brought by the executor or administrator within six months after the death of the deceased person, then and in every such case an action may be brought by and in the name or names of all or any of the persons for whose benefit the action would have been brought if it had been brought by and in the name of the executor or administrator, and every action so brought shall be for the benefit of the same person or persons as if it were brought by and in the name of the executor or administrator."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "8 – Plaintiff to deliver full particulars of persons for whom damages claimed",
        "chunk_id": 1,
        "content": "In every action brought by virtue of the provisions of this Act, the plaintiff on the record shall be required, together with the statement of claim, to deliver to the defendant, or his advocate, full particulars of the person or persons for whom, and on whose behalf, the action is brought, and of the nature of the claim in respect of which damages are sought to be recovered."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "9 – In the event of death, action maintainable against estate",
        "chunk_id": 1,
        "content": "(1) Upon the death of any person against whom, were it not for his death, an action would be maintainable by virtue of the provisions of this Act, the action shall be maintainable against his estate. (2) No proceedings shall be maintainable in respect of a cause of action which by virtue of the provisions of this section has survived against the estate of a deceased person, unless either— (a) proceedings against him in respect of that cause of action were pending at the date of his death; or (b) proceedings are taken in respect thereof not later than six months after his personal representative took out representation."
    },
    {
        "act": "Fatal Accidents Act",
        "part": "General",
        "section": "9 – In the event of death, action maintainable against estate",
        "chunk_id": 2,
        "content": "(3) Where, by virtue of the provisions of this Act, a cause of action would have subsisted against any person if that person had not died before or at the same time as the damage was suffered, there shall be deemed, for the purposes of this Act, to have been against him before his death such cause of action as would have subsisted if he had died after the damage was suffered. (4) Notwithstanding the provisions of any other law, in the event of the insolvency of an estate against which proceedings are maintainable by virtue of the provisions of this section, any liability in respect of the cause of action by reason of which the proceedings are maintainable shall be deemed to be a debt provable in the administration of the estate."
    }
]