[
    {
        "act": "Small Claims Court Act",
        "part": "General",
        "section": "Preamble – Preamble",
        "chunk_id": 1,
        "content": "﻿SMALL CLAIMS COURT ACT CAP. 10A An Act of Parliament to establish Small Claims Court; to provide for the jurisdiction and procedures of the Court and for connected purposes"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part I – PRELIMINARY",
        "section": "1 – Short title",
        "chunk_id": 1,
        "content": "This Act may be cited as the Small Claims Court Act."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part I – PRELIMINARY",
        "section": "2 – Interpretation",
        "chunk_id": 1,
        "content": ""
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part I – PRELIMINARY",
        "section": "2 – Interpretation",
        "chunk_id": 2,
        "content": "In this Act, unless the context otherwise requires— \"Adjudicator\" means an Adjudicator appointed under section 5; \"Chief Justice\" means the Chief Justice appointed under Article 166 of the Constitution; \"Chief Registrar\" means the Chief Registrar of the Judiciary referred to in Article 161(2)(c) of the Constitution; \"claim\" means a claim lodged with the Small Claims Court in accordance with section 23; \"claimant\" means a person who lodges a claim with a Small Claims Court and includes any person who becomes a party to the proceedings on any claim in the capacity of a claimant; \"Court\" means a Small Claims Court established under section 4 of this Act; “duly authorized representative” means the next of kin or a close relative of a party to the proceedings appointed in writing and approved by the Adjudicator to represent that party in court proceedings; \"electronic means\" includes electrical, digital, magnetic, optical, biometric, electrochemical, wireless or electromagnetic technology; \"electronic system\" means any electronic device or a group of interconnected or related devices, one or more of which, pursuant to a program, performs automatic processing of data and includes a permanent, removable or any other electronic storage medium; \"Gazette\" has the meaning assigned to it under Article 260 of the Constitution; \"judicial officer\" has the meaning assigned to it by section 2 of the Judicial Service Act (Cap."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part I – PRELIMINARY",
        "section": "2 – Interpretation",
        "chunk_id": 3,
        "content": "8A); \"Judicial Service Commission\" means Judicial Service Commission established under Article 171 of the Constitution; \"party\" means a claimant or respondent and any other person joined as a third party in proceedings under this Act; \"prescribed limit\" means one million shillings or such other sum as the Chief Justice may determine by notice in the Gazette; \"respondent\" means any person against whom a claim is made and any person who becomes a party to the proceedings on any claim in the capacity of a respondent in any proceedings under this Act; and \"Rules\" means the Rules made under section 50 of this Act. [Act No. 5 of 2020, s. 2.]"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part I – PRELIMINARY",
        "section": "3 – Guiding principles",
        "chunk_id": 1,
        "content": "(1) In exercise of its jurisdiction under this Act, the Court shall be guided by the principles of judicial authority prescribed under Article 159(2) of the Constitution. (2) The parties and their duly authorized representatives, as the case may be, shall assist the Court to facilitate the observance of the guiding principles set out in this section, to that effect, to participate in the proceedings of the Court and to comply with directions and orders of that Court. (3) Without prejudice to the generality of subsection (1) the Court shall adopt such procedures as the Court deems appropriate to ensure— (a) the timely disposal of all proceedings before the Court using the least expensive method; (b) equal opportunity to access judicial services under this Act; (c) fairness of process; and (d) simplicity of procedure."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "4 – Establishment of the Court",
        "chunk_id": 1,
        "content": "(1) There is established a court to be known as the Small Claims Court which shall be a subordinate Court pursuant to Article 169(1)(d) of the Constitution. (2) Pursuant to Article 6(3) of the Constitution, the Chief Justice shall, by notice in the Gazette, designate any Court station as a Small Claims Court with such geographical jurisdiction as may be specified in the notice. (3) Notwithstanding subsection (2), the geographical jurisdiction may be in relation to a sub-county or other units of decentralization in compliance with Article 6(3) of the Constitution."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "5 – Appointment of an Adjudicator",
        "chunk_id": 1,
        "content": "(1) The Court shall be presided over by an Adjudicator. (2) A person shall be qualified for appointment as an Adjudicator if that person— (a) is an advocate of the High Court of Kenya; and (b) has at least three years' experience in the legal field."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "6 – Officers of the Court",
        "chunk_id": 1,
        "content": "(1) The Judicial Service Commission shall, pursuant to Article 172(1) of the Constitution, appoint such number of Adjudicators, registrars and other officers of Small Claims Courts as may be necessary for the effective discharge of the functions of the Court. (2) Without prejudice to subsection (1), the Chief Justice may designate any judicial officer to act as an Adjudicator in any proceedings under this Act. (3) Any Adjudicator or officer appointed under this section shall serve on such terms as may be specified in the instrument of appointment. (4) An Adjudicator may serve on full time or part time basis."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "7 – Oath or affirmation of an Adjudicator",
        "chunk_id": 1,
        "content": "An Adjudicator shall, on first appointment, take an oath or affirmation in the prescribed form in accordance with section 40 of the Judicial Service Act (Cap. 8A)."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "8 – Qualifications for appointment of Registrar of the Court",
        "chunk_id": 1,
        "content": "A person shall be qualified to be appointed as a Registrar under this Act if that person— (a) is an advocate of the High Court of Kenya and has attained at least three years legal experience; or (b) is trained as a paralegal at the Kenya School of Law."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "9 – Functions of Registrar",
        "chunk_id": 1,
        "content": "(1) The Registrar shall perform the duties assigned to the Registrar under this Act and other duties as the Chief Registrar may direct, and in particular, be responsible for— (a) the establishment and maintenance of the Register in which all records of the Court shall be kept; (b) the acceptance, transmission, service and custody of documents in accordance with the Rules; (c) the enforcement of the decisions of the Court; (d) certifying that any order, direction or decision is an order, direction or decision of the Court; (e) causing to be kept records of the proceedings and minutes of the Court and such other records as that Court may direct; (f) managing and supervising the staff of the Court; (g) the day to day administration of the Court; and (h) facilitating access to judgements and records of the Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "9 – Functions of Registrar",
        "chunk_id": 2,
        "content": "(2) The Registrar may consider and dispose of procedural or administrative matters in accordance with the Rules or on direction of the Adjudicator."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part II – ESTABLISHMENT, ORGANIZATION AND ADMINISTRATION OF THE COURT",
        "section": "10 – Review of Registrar’s decisions",
        "chunk_id": 1,
        "content": "(1) A person aggrieved by a decision of the Registrar on matters relating to the judicial functions of the Court may apply for review by an Adjudicator of that Court in accordance with the Rules. (2) The Adjudicator may confirm, modify or reverse the decision of the Registrar referred to in subsection (1)."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "11 – Local limits of the Court’s jurisdiction",
        "chunk_id": 1,
        "content": "(1) The Chief Justice shall determine and publish a notice in the Gazette designating the local limits of the jurisdiction of Small Claims Court. (2) When determining the local limits of the jurisdiction of the Court, the Chief Justice shall ensure that such Courts are accessible in every sub-county and progressively in other decentralized units of judicial service delivery."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "12 – Nature of claims and pecuniary jurisdiction",
        "chunk_id": 1,
        "content": "(1) Subject to this Act, the Rules and any other law, the Court has jurisdiction to determine any civil claim relating to— (a) a contract for sale and supply of goods or services; (b) a contract relating to money held and received; (c) liability in tort in respect of loss or damage caused to any property or for the delivery or recovery of movable property; (d) compensation for personal injuries; and (e) set-off and counterclaim under any contract. (2) Without prejudice to the generality of subsection (1), the Court may exercise any other civil jurisdiction as may be conferred under any other written law. (3) The pecuniary jurisdiction of the Court shall be limited to one million shillings. (4) Without prejudice to subsection (3), the Chief Justice may determine by notice in the Gazette such other pecuniary jurisdiction of the Court as the Chief Justice thinks fit. [Act No."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "12 – Nature of claims and pecuniary jurisdiction",
        "chunk_id": 2,
        "content": "5 of 2020, s. 3.]"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "13 – Exclusion of jurisdiction",
        "chunk_id": 1,
        "content": "(1) If a claim has been lodged with the Court, no proceedings relating to the same course of action shall be brought before any other Court except where the— (a) proceedings before that other Court were commenced before the claim was lodged with the Small Claims Court; or (b) claim before the other Court has been withdrawn. (2) A claim shall not be brought before the Court if proceedings relating to that claim are pending in or have been heard and determined by any other Court. (3) Subject to section 12(3), a higher court may transfer a claim to a Small Claims Court. (4) For the purposes of this section, a claim is deemed to have been lodged with the Court in any case where section 23 has been complied with."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "13 – Exclusion of jurisdiction",
        "chunk_id": 2,
        "content": "(5) A claim shall not be brought before the Court if the cause of action is founded upon defamation, libel, slander, malicious prosecution or is upon a dispute over a title to or possession of land, or employment and labour relations."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "14 – Prohibition on division of claims",
        "chunk_id": 1,
        "content": "No claim shall be divided or pursued in parts for the sole purpose of bringing the sum claimed in each of such proceedings within the jurisdiction of the Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "15 – Parties to proceedings before the Court",
        "chunk_id": 1,
        "content": "(1) A person has the right to lodge a claim before the Court only if— (a) such a person ordinarily resides or carries on business within the local limits of the jurisdiction of the Court; (b) the subject matter of the claim is situated within the local limits of the jurisdiction of the Court; (c) the contract to which the claim relates was either made or was intended to be performed within the local limits of the jurisdiction of the Court; (d) the cause of action arose within the local limits of the jurisdiction of the Court; or (e) the defendant to the claim resides within the local limits of the jurisdiction of the Court. (2) Without prejudice to subsection (1), any person against whom notice of a claim has been served under section 25 shall be party to the proceedings of that claim."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "16 – Representative claims",
        "chunk_id": 1,
        "content": "(1) Subject to subsection (2), if two or more persons have claims against the same respondent, such claims may be brought in the name of one of such persons as the representative of some or all of them save that the authority to act as a representative shall be given in writing. (2) The Court may, if at any stage of the proceedings be of the view that a representative claim may prejudice the respondent, order that the claims of all or any of the persons represented be heard separately."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part III – JURISDICTION OF THE COURT",
        "section": "16 – Representative claims",
        "chunk_id": 2,
        "content": "(3) Each person represented in a representative claim shall be considered to have authorized the representative on their behalf to— (a) call and give evidence and make submissions to the Court on any matter arising during the hearing of the claim; (b) file affidavits, statements or other documents; (c) agree to an adjournment or change of venue; (d) agree to a settlement of the claim on such terms as the person thinks fit; or (e) amend or abandon the claim. (4) The authority given to a representative under subsection (1) shall not be withdrawn except with leave of the Court. (5) The Court may, at any time before determining any claim, grant leave to any person to join in the claim as a person represented, on such terms as it may think fit."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "17 – Procedure of Small Claims Court",
        "chunk_id": 1,
        "content": "Subject to this Act and Rules, the Court shall have control of its own procedure in the determination of claims before it and, in the exercise of that control, the Court shall have regard to the principles of natural justice."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "18 – Alternative Dispute Resolution",
        "chunk_id": 1,
        "content": "(1) In exercise of its jurisdiction under this Act, the Court may, with the consent of the parties, adopt and implement any other appropriate means of dispute resolution for the attainment of the objective envisaged under section 3 of this Act. (2) The Court may adopt an alternative dispute resolution mechanism and shall make such orders or issue such directions as may be necessary to facilitate such means of dispute resolution. (3) Any agreement reached by means of an alternative dispute resolution mechanism shall be recorded as a binding order of the Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "19 – Power to summon witnesses and make inquiry",
        "chunk_id": 1,
        "content": "(1) A Court may, of its own motion or at the request of any party, summon any witness and require the production of any document, record, books of accounts or other thing, which is relevant in any proceedings. (2) The Court shall inquire into any matter which it may consider relevant to a claim, whether or not a party has raised it."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "20 – Representation before the Court",
        "chunk_id": 1,
        "content": "(1) A party to the proceedings shall appear in person or where he or she is unable to appear in person, be represented by a duly authorised representative. (2) Deleted by Act No. 5 of 2020, s. 4. (3) A Court shall, before permitting a person to act as a representative under subsection (1) where the representative is not a legal practitioner, satisfy itself that the person has sufficient knowledge of the case and sufficient authority to bind the party being represented. [Act No. 5 of 2020, s. 4.] 20A. Remuneration of advocates The Chief Justice shall, in consultation with the Council of the Law Society of Kenya established under the Law Society of Kenya Act (Cap. 18) make orders prescribing and regulating the remuneration of advocates who appear before the Court. [Act No. 5 of 2020, s. 5.]"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "21 – Language of the Court",
        "chunk_id": 1,
        "content": "(1) English, Kiswahili or any other appropriate language may be used at any stage of the proceedings of Court. (2) In all appropriate cases, the Court shall facilitate the use by parties of indigenous languages, Kenyan Sign Language, Braille and other communication formats and technologies accessible to persons with disabilities. (3) Without prejudice to subsections (1) and (2), records of proceedings before the Court shall be kept and maintained in the English language."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "22 – Record of the Court",
        "chunk_id": 1,
        "content": "The record of a Court shall include— (a) claims and responses filed with the Court by parties; (b) summaries of the facts of the issues in dispute in respect of those claims as determined and recorded by the Court during the hearing of the claims; and (c) orders made by the Court in relation to those claims."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "23 – Filing of claims",
        "chunk_id": 1,
        "content": "(1) Every claim filed with the Court shall commence with the filing of a statement of claim in the prescribed form signed or authenticated by the claimant or authorized representative. (2) Without prejudice to subsection (1), a party may present his or her claim orally to an officer of the Court, and such officer shall cause the claim to be reduced in writing in the prescribed form signed or authenticated by the claimant. (3) Any joint claim lodged by two or more claimants shall be admitted for determination notwithstanding that the statement has been signed or authenticated by only one or more of them. (4) Nothing in this section invalidates a statement of claim signed or authenticated by a representative of a claimant or joint claimants."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "23 – Filing of claims",
        "chunk_id": 2,
        "content": "(5) Any person in whose name a claim is lodged without his signature or mark authenticating the claim shall be required to sign or authenticate the statement of claim before the commencement of the hearing and determination of the claim. (6) A person who fails to comply with subsection (5) shall have his or her name struck out of the proceedings and whereupon his or her claim shall be deemed to be abandoned. (7) Any party may lodge his or her statement of claim or defence by electronic means."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "24 – Form of statement of claim",
        "chunk_id": 1,
        "content": "Every statement of claim shall contain the following particulars— (a) the name and address of each claimant and, in the case of a representative claim, the name and address of each person represented; (b) the name and address of each respondent; (c) the nature of the claim; (d) the sum of money claimed by each claimant or person represented; (e) the relief or orders sought; and (f) other particulars of the claim as are reasonably sufficient to inform the respondent of the ground for the claim and the manner in which the amount claimed by each claimant or person represented has been calculated."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "25 – Response to claim",
        "chunk_id": 1,
        "content": "(1) The Registrar or other officer designated for that purpose shall cause to be served on the respondent a copy of the statement of claim. (2) The respondent shall lodge with the Court a written response to the claim, including any counterclaim or set-off, in the prescribed form, within fifteen days."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "26 – Admission of claims",
        "chunk_id": 1,
        "content": "(1) Where the respondent admits any part of the claim, the Court shall record the admission as an order of the Court in favour of the Claimant and thereafter proceed to determine any part of the claim that is denied or has not been expressly admitted by the respondent. (2) The Court may permit a respondent at any time before that Court has made a final order on the claim, to orally admit the claim against the respondent. (3) The Court may accept any admission to the claim in writing by the respondent if such admission is received before a final order on the claim has been made by that Court. (4) The Court may, for good cause, refuse to accept an admission made under subsection (1), (2) or (3) and direct the respondent to appear in person before the Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "26 – Admission of claims",
        "chunk_id": 2,
        "content": "(5) If the Court is satisfied that an admission under subsection (1), (2), or (3) is legitimate, the Court may make an order under subsection (1) against the respondent. (6) Any order made by the Court under subsection (5) may be set aside on the application of the respondent if that Court is satisfied that the admission was not made by the respondent or with the respondent's authority. (7) An application under subsection (6) shall be made within fourteen days after the date of the order or such further period as the Court may permit."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "27 – Default judgment",
        "chunk_id": 1,
        "content": "(1) If the respondent fails to respond to the claim within the prescribed period, the Court may, either on its own motion or on the claimants application enter judgment for the claimant and order the relief sought in the statement of claim. (2) If a respondent fails to appear at the hearing in person or by a representative, the claimant may apply to the Court for an order to be made against the respondent. (3) Upon application made by the claimant under subsection (2), the Court shall grant the claimant the order if it is satisfied that the claimant is entitled thereto. (4) An order shall not be made against a respondent under this section unless the Court is satisfied that a copy of the written claim and the notice of hearing have been served on the respondent under section 25 of this Act."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "28 – Notice of hearing",
        "chunk_id": 1,
        "content": "(1) Upon receipt of the respondent's written response, the Court shall notify the parties of the date, time and place of hearing of the determination of the claim. (2) The parties may call witnesses at the hearing in support of their respective claims and the Court may accept any admission to the claim in writing by the respondent if such admission is received before any order on the claim has been made by that Court. (3) A Court may summon any person to appear before it if, in the Court's opinion, the presence of the person is necessary to enable the Court to determine the questions in dispute in the claim."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "29 – Proceeding by electronic means",
        "chunk_id": 1,
        "content": "(1) The Court may, on such conditions as the Chief Justice may by Rules prescribe, permit proceedings before that Court to be conducted by telephone, videophone or any other electronic means. (2) The Court may at any time direct any proceedings before it conducted by electronic means to cease and order the parties to appear in person at a designated place for the hearing. (3) Any order made by the Court at the proceedings before it by electronic means may be set aside on the application of a person aggrieved by that order if that Court is satisfied that either party has been impersonated or that any person who participated in the hearing did not have authority to represent the party concerned. (4) An application made under subsection (3) shall be made within one month after the order was made or such further period as the Court may allow."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "30 – Proceeding by documents only",
        "chunk_id": 1,
        "content": "Subject to agreement of all parties to the proceedings, the Court may determine any claim and give such orders as it considers fit and just on the basis of documents and written submissions, statements or other submissions presented to the Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "31 – Consolidation of claims",
        "chunk_id": 1,
        "content": "(1) Where it appears to the Court that any two or more claims lodged with the Court relate to— (a) a common question of fact or law; or (b) the same cause of action, the Court may, before final determination of any of them order consolidation of such claims. (2) The Court may exercise its power to consolidate claims, where it considers that such consolidation is in the interest of the parties and would serve the ends of justice."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "32 – Exclusion of strict Rules of evidence",
        "chunk_id": 1,
        "content": "(1) The Court shall not be bound wholly by the Rules of evidence. (2) Without prejudice to the generality of subsection (1), the Court may admit as evidence in any proceedings before it, any oral or written testimony, record or other material that the Court considers credible or trustworthy even though the testimony, record or other material is not admissible as evidence in any other Court under the law of evidence. (3) Evidence tendered to the Court by or on behalf of a party to any proceedings may not be given on oath but that Court may, at any stage of the proceedings, require that such evidence or any part thereof be given on oath whether orally or in writing. (4) The Court may, on its own initiative, seek and receive such other evidence and make such other investigations and inquiries as it may require."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "32 – Exclusion of strict Rules of evidence",
        "chunk_id": 2,
        "content": "(5) All evidence and information received and ascertained by the Court under subsection (3) shall be disclosed to every party. (6) For the purposes of subsection (2), an Adjudicator is empowered to administer an oath. (7) An Adjudicator may require any written evidence given in the proceedings before the Court to be verified by statutory declaration."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "33 – Cost of proceedings",
        "chunk_id": 1,
        "content": "(1) The Court may award costs to the successful party in any proceedings. (2) In any other case parties shall bear their respective costs of the proceedings. (3) Without prejudice to subsections (1) and (2), the Court may award to a successful party disbursements incurred on account of the proceedings. (4) Except as provided in subsection (2), costs other than disbursements, shall not be granted to or awarded against any party to any proceedings before a Court. [Act No. 5 of 2020, s. 6.]"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "34 – Expeditious disposal of cases",
        "chunk_id": 1,
        "content": "(1) All proceedings before the Court on any particular day so far as is practicable shall be heard and determined on the same day or on a day to day basis until final determination of the matter which shall be within sixty days from the date of filing the claim. (2) Judgment given in determination of any claim shall be delivered on the same day and in any event, not later than three (3) days from the date of the hearing. (3) The Court may only adjourn the hearing of any matter under exceptional and unforeseen circumstances which shall be recorded and be limited to a maximum of three adjournments."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "34 – Expeditious disposal of cases",
        "chunk_id": 2,
        "content": "(4) When considering whether to allow an adjournment on the grounds of exceptional and unforeseen circumstances referred to in subsection (3), the court may in particular take into consideration where appropriate any of the following exceptional and unforeseen circumstances— (a) the absence of the parties concerned or their advocate or other participants to the proceedings required to appear in court for justified personal reasons which may include sickness, death, accident or other calamities; (b) an application by a party for the Adjudicator to withdraw from hearing the matter; (c) a request by parties to settle the matter out of court; (d) an appeal filed in the matter where orders of stay of proceedings have been granted; (e) an application by a party to summon new witnesses to court, collect new evidence, new inspection or evaluation or supplementary investigation on the subject matter of the case; and (f) any other exceptional and unforeseen circumstances which in the opinion of the court justifies or warrants an adjournment."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "34 – Expeditious disposal of cases",
        "chunk_id": 3,
        "content": "[Act No. 5 of 2020, s. 7., Act No. 1 of 2021, s. 53.]"
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "35 – Withdrawal of claim",
        "chunk_id": 1,
        "content": "(1) A claimant or joint claimant may, at any time before final judgment withdraw the claim. (2) The withdrawal of a claim by any person pursuant to subsection (1) shall not prejudice the hearing and determination of any counterclaim lodged by the respondent."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "36 – Orders of the Court",
        "chunk_id": 1,
        "content": "(1) The Court may, in relation to any claim within its jurisdiction, make one or more of the following orders— (a) order to pay money either in lump sum or by instalments; (b) an order for the restitution of any movable property; (c) an order for the recovery of any sum in relation to performance of a contract; (d) an order dismissing the claim to which the proceedings relate; or (e) any such consequential or ancillary orders as may be necessary including, any stipulations or conditions for the enforcement of its orders or directions. (2) An order made under subsection (1)(a) shall not require payment of money exceeding the prescribed limit. (3) The Court shall arrange for a copy of an order made under subsection (1) to be served on the person against whom it is made promptly."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "36 – Orders of the Court",
        "chunk_id": 2,
        "content": "(4) Nothing in this section precludes the Court from making any order or giving any direction it thinks necessary for the achievement of the purposes of this Act."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "37 – Enforcement of orders to pay money",
        "chunk_id": 1,
        "content": "(1) Every order made by the Court requiring a party to pay money shall be enforced in accordance with the provisions of this Act. (2) Where an application is made to the Court for the issue of any process to enforce an order requiring a party to pay money to another as an alternative to compliance with a work order, that Court shall give notice of application to the party against whom enforcement is sought. (3) If the party referred to in subsection (2) does not file in the Court within the period prescribed for so doing a notice of objection in the prescribed form, the order may, after the expiry of that period, be enforced pursuant to subsection (1)."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "37 – Enforcement of orders to pay money",
        "chunk_id": 2,
        "content": "(4) The notice referred to in subsection (3) may only be given on the ground that it is the belief of the party that the order of the Court has been fully complied with and that the party therefore disputes the entitlement of the applicant to enforce it. (5) If the party against whom enforcement is sought files the notice referred to in subsection (3) within the prescribed period, the matter shall be determined as provided under section 40. (6) No filing fee shall be payable by a person who seeks to enforce an order pursuant to subsection (1) but any fee which would otherwise be payable shall be included in and be considered as part of the award of the Court and shall be recoverable from the opposite party for the credit of the Consolidated Fund."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part IV – PROCEDURE BEFORE THE COURT",
        "section": "38 – Appeals",
        "chunk_id": 1,
        "content": "(1) A person aggrieved by the decision or an order of the Court may appeal against that decision or order to the High Court on matters of law. (2) An appeal from any decision or order referred to in subsection (1) shall be final."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part V – EXECUTION OF THE DECREE",
        "section": "39 – Procedure for execution",
        "chunk_id": 1,
        "content": "Where a judgment debtor fails to pay to the decree holder any sum specified in a decree or order, the Court may— (a) where the judgment debtor's movable property is insufficient to satisfy the decree, order execution by attachment and sale of the judgment debtor's immovable property; (b) order the attachment of the salary of the judgement debtor; or (c) suspend the execution of the warrant and the order either wholly or in part on such conditions as to security or otherwise as the Court may determine."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part V – EXECUTION OF THE DECREE",
        "section": "40 – Manner of execution",
        "chunk_id": 1,
        "content": "Where the judgment debtor fails to discharge the decree in whole or in part within the time or in the terms, if any, specified in any order of the Court, the Court may order execution to issue against the judgment debtor's immovable property or any other of his or her assets."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part V – EXECUTION OF THE DECREE",
        "section": "41 – Review of orders or awards of the Court",
        "chunk_id": 1,
        "content": "(1) An Adjudicator may, on application by any aggrieved party or on his or her own motion, review any order of the Court on the ground that— (a) the order was made ex-parte without notice to the applicant; (b) the claim or order was outside the jurisdiction of the Court; (c) the order was obtained fraudulently; (d) there was an error of law on the face of the record; or (e) new facts previously not before the Court have been discovered by either of the parties. (2) The application referred to under subsection (1) shall be made within thirty days of the order or award sought to be reviewed or such other period as the court may allow."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part V – EXECUTION OF THE DECREE",
        "section": "42 – Stay of execution on review",
        "chunk_id": 1,
        "content": "(1) The filing of an application for review shall not operate as a stay of execution of an order unless the Adjudicator otherwise orders. (2) Any stay of execution may be subject to such conditions as to costs, payment into the Court, the giving of security or otherwise as the Adjudicator considers fit."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part V – EXECUTION OF THE DECREE",
        "section": "43 – Setting aside of orders",
        "chunk_id": 1,
        "content": "The Court may on the application of any party to the proceedings set aside any of its orders and make such further orders as it thinks just."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "44 – Payment of a fee for a copy of the record",
        "chunk_id": 1,
        "content": "Any party to the claim shall, upon payment of a nominal prescribed fee, be entitled to a copy of the record of the Court and such record shall be admissible in evidence before any other Court for the purposes of any proceedings before that other Court."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "45 – Protection from liability",
        "chunk_id": 1,
        "content": "An Adjudicator or an officer of the Court or other person bound to execute the lawful warrants, orders or other process of the Court shall not be liable in an action or suit in respect of anything done or omitted to be done in good faith and in the lawful performance of judicial functions."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "46 – Removal and discipline of Adjudicators",
        "chunk_id": 1,
        "content": "The provisions of the Judicial Service Act (Cap. 8A) relating to the removal and discipline of Magistrates shall apply with necessary modifications to the discipline and removal of Adjudicators."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "47 – Contempt of Court",
        "chunk_id": 1,
        "content": ""
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "47 – Contempt of Court",
        "chunk_id": 2,
        "content": "(1) A person who— (a) assaults, threatens, intimates or wilfully insults an Adjudicator, judicial officer or a witness, involved in a case during a sitting or attendance in a court, or while the Adjudicator, judicial officer or witness is travelling to and from a court; (b) wilfully and without lawful excuse disobeys an order or direction of the court in the course of the hearing of proceedings; (c) within the premises in which any judicial proceedings are being heard or taken, or within the precincts of the same, shows disrespect, in speech or manner, to or with reference to such proceedings, or any person before whom such proceedings are being heard or taken; (d) having been called upon to give evidence in a judicial proceeding, fails to attend, or having been sworn or affirmed, refuses without lawful excuse to answer a question or to produce a document, or remains in the room in which such proceedings are being heard or taken after the witnesses have been ordered to leave such room; (e) causes an obstruction or disturbance in the cause of judicial proceedings; (f) while judicial proceedings are pending, makes use of any speech or writing misrepresenting such proceedings or capable of prejudicing any person in favour of or against any parties to such proceedings, or calculated to lower the authority taken; (g) publishes a report of the evidence taken in any judicial proceedings that has been directed to be held in private; (h) attempts wrongfully to interfere with or influence a witness in judicial proceedings, either before or after he or she has given evidence in connection with such evidence; (i) dismisses a servant because he or she has given evidence on behalf of a party to judicial proceedings; or (j) commits any other act of intentional disrespect to any judicial proceedings, or to any person before whom such proceedings are heard or taken, commits an offence."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "47 – Contempt of Court",
        "chunk_id": 3,
        "content": "(2) A police officer may, by order of the Court, take into custody and detain a person who commits an offence under subsection (1) until the court adjourns. (3) A person who commits an offence under subsection (1) shall on conviction be liable to imprisonment for a term not exceeding five days, or to a fine not exceeding one hundred thousand shillings, or to both. (4) In exercise of its powers under this section, the court shall observe the principles of fair administration of justice set out in Article 47 of the Constitution."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "48 – Right to lodge claim in other Courts",
        "chunk_id": 1,
        "content": "Nothing in this Act precludes a person from lodging a claim that is within the jurisdiction of the Court in any other Court if that person elects to institute proceedings in that other Court to hear and determine that claim."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "49 – Seal of the Court",
        "chunk_id": 1,
        "content": "Every Court shall use seals or stamps of such kind and pattern as the Chief Justice may direct."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "50 – Power to make Rules",
        "chunk_id": 1,
        "content": "(1) The Chief Justice may make Rules of practice and procedure for the better functioning of the Court. (2) For the purpose of Article 94(6) of the Constitution— (a) the purpose and objective of the delegation under this section is to enable the Chief Justice to make rules to provide for the better carrying into effect the provisions of this Act; (b) the authority of the Chief Justice to make Rules under this Act shall be limited to bringing into effect the provisions of this Act and fulfilment of the objectives specified under this section; (c) the principles and standards applicable to the Rules made under this section are those set out in the Interpretation and General Provisions Act (Cap. 2) and the Statutory Instruments Act (Cap. 2A)."
    },
    {
        "act": "Small Claims Court Act",
        "part": "Part VI – MISCELLANEOUS PROVISIONS",
        "section": "51 – Code of conduct for Adjudicators",
        "chunk_id": 1,
        "content": "The Chief Justice shall within six months of the commencement of this Act, prescribe the code of conduct applicable to an Adjudicator. Small Claims Court Act (Cap. 10A) Kenya 1 Small Claims Court Act (Cap. 10A) Kenya 1"
    }
]