[
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "General > Preamble",
    "chunk_index": 1,
    "chunk_id": 1,
    "text": "﻿EVIDENCE ACT CAP. 80 Chapter I PRELIMINARY",
    "prev_chunk_id": null,
    "next_chunk_id": 2,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "1 – Short title.",
    "section_number": "1",
    "section_title": "Short title.",
    "section_path": "General > 1",
    "chunk_index": 1,
    "chunk_id": 2,
    "text": "This Act may be cited as the Evidence Act.",
    "prev_chunk_id": 1,
    "next_chunk_id": 3,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "2 – Application.",
    "section_number": "2",
    "section_title": "Application.",
    "section_path": "General > 2",
    "chunk_index": 1,
    "chunk_id": 3,
    "text": "(1) This Act shall apply to all judicial proceedings in or before any court other than a Kadhi’s court, but not to proceedings before an arbitrator. (2) Subject to the provisions of any other Act or of any rules of court, this Act shall apply to affidavits presented to any court. [Act No. 17 of 1967, 1st Sch., Act No. 10 of 1969, Sch.]",
    "prev_chunk_id": 2,
    "next_chunk_id": 4,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "3 – Interpretation.",
    "section_number": "3",
    "section_title": "Interpretation.",
    "section_path": "General > 3",
    "chunk_index": 1,
    "chunk_id": 4,
    "text": "(1) In this Act, unless the context otherwise requires— \"admissible\" means admissible in evidence; \"advocate\" has the meaning ascribed to that expression in the Advocates Act (Cap. 16), and includes any person entitled, pursuant to section 9 of that Act, to act as an advocate, whilst so acting in connection with the duties of his office; \"bank\" means a person or company or other body of persons carrying on, whether on his or their own behalf or as agent for another, any banking business (as defined in section 2 of the Banking Act (Cap. 488), and includes— (a) a financial institution within the meaning of section 2 of the Banking Act (Cap. 488); (b) the Kenya Post Office Savings Bank established by the Kenya Post Office Savings Bank Act (Cap. 493B); (c) the Co-operative Bank of Kenya Limited; and (d) for the purposes of subsections 176 and 177, any person or company or other body of persons carrying on banking business in Tanzania or Uganda; \"banker’s book\" includes a ledger, day book, cash book, account book, and any other book used in the ordinary business of the bank, whether in written form or micro-film, magnetic tape or any other form of mechanical or electronic data retrieval mechanism whether kept in written form or printouts or electronic form; \"computer\" means any",
    "prev_chunk_id": 3,
    "next_chunk_id": 5,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "3 – Interpretation.",
    "section_number": "3",
    "section_title": "Interpretation.",
    "section_path": "General > 3",
    "chunk_index": 2,
    "chunk_id": 5,
    "text": "for the purposes of subsections 176 and 177, any person or company or other body of persons carrying on banking business in Tanzania or Uganda; \"banker’s book\" includes a ledger, day book, cash book, account book, and any other book used in the ordinary business of the bank, whether in written form or micro-film, magnetic tape or any other form of mechanical or electronic data retrieval mechanism whether kept in written form or printouts or electronic form; \"computer\" means any device that receives, stores and processes data, or information applying stipulated processes to the data and supplying results of that data or information; and any reference to information being derived from other information shall be construed to include a reference to its being derived therefrom by calculation, comparison or any other process; \"court\" includes all judges and magistrates, and persons, except arbitrators, legally authorized to take evidence; \"evidence\" denotes the means by which an alleged matter of fact, the truth of which is submitted to investigation, is proved or disproved; and, without prejudice to the foregoing generality, includes statements by accused persons, admissions, and observation by the court in its judicial capacity; \"fact\" includes— (a) any thing, state of things, or relation of things, capable of being perceived by the senses; and (b) any mental condition of which any person",
    "prev_chunk_id": 4,
    "next_chunk_id": 6,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "3 – Interpretation.",
    "section_number": "3",
    "section_title": "Interpretation.",
    "section_path": "General > 3",
    "chunk_index": 3,
    "chunk_id": 6,
    "text": "except arbitrators, legally authorized to take evidence; \"evidence\" denotes the means by which an alleged matter of fact, the truth of which is submitted to investigation, is proved or disproved; and, without prejudice to the foregoing generality, includes statements by accused persons, admissions, and observation by the court in its judicial capacity; \"fact\" includes— (a) any thing, state of things, or relation of things, capable of being perceived by the senses; and (b) any mental condition of which any person is conscious; \"fact in issue\" means any fact from which, either by itself or in connection with other facts, the existence, non-existence, nature or extent of any right, liability or disability, asserted or denied in any suit or proceeding, necessarily follows; \"Gazette and Government Printer\" respectively include the Gazette and the Organization Printer as defined in the Interpretation Act of the High Commission, and the High Commission Printer as formerly so defined; \"photograph” means an image created by light falling on a light sensitive surface, either photographic film or an electronic medium and made visible and permanent by chemical treatment or stored digitally; \"public officer\" except in section 80 of this Act, includes an officer in the service of the Organization. (2) A fact is proved when, after considering the matters before it, the court either believes it to exist,",
    "prev_chunk_id": 5,
    "next_chunk_id": 7,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "3 – Interpretation.",
    "section_number": "3",
    "section_title": "Interpretation.",
    "section_path": "General > 3",
    "chunk_index": 4,
    "chunk_id": 7,
    "text": "the High Commission, and the High Commission Printer as formerly so defined; \"photograph” means an image created by light falling on a light sensitive surface, either photographic film or an electronic medium and made visible and permanent by chemical treatment or stored digitally; \"public officer\" except in section 80 of this Act, includes an officer in the service of the Organization. (2) A fact is proved when, after considering the matters before it, the court either believes it to exist, or considers its existence so probable that a prudent man ought, in the circumstances of the particular case, to act upon the supposition that it exists. (3) A fact is disproved when, after considering the matters before it, the court either believes that it does not exist, or considers its non-existence so probable that a prudent man ought, in the circumstances of the particular case, to act upon the supposition that it does not exist. (4) A fact is not proved when it is neither proved nor disproved. [LN 22 of 1965, Act No. 19 of 1985, Sch., Act No. 7 of 1990, Sch., Act No. 9 of 2000, s. 64, Act No. 1 of 2009, s. 36, Act No. 19 of 2023, Sch.]",
    "prev_chunk_id": 6,
    "next_chunk_id": 8,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "General",
    "section": "4 – Presumptions of fact.",
    "section_number": "4",
    "section_title": "Presumptions of fact.",
    "section_path": "General > 4",
    "chunk_index": 1,
    "chunk_id": 8,
    "text": "(1) Whenever it is provided by law that the court may presume a fact, it may either regard such fact as proved, unless and until it is disproved, or may call for proof of it. (2) Whenever it is directed by law that the court shall presume a fact, it shall regard such fact as proved, unless and until it is disproved. (3) When one fact is declared by law to be conclusive proof of another, the court shall, on proof of the one fact, regard the other as proved, and shall not allow evidence to be given for the purpose of disproving it. Chapter II ADMISSIBILITY AND RELEVANCY",
    "prev_chunk_id": 7,
    "next_chunk_id": 9,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "5 – General restriction of admissibility of evidence.",
    "section_number": "5",
    "section_title": "General restriction of admissibility of evidence.",
    "section_path": "Part I – GENERAL > 5",
    "chunk_index": 1,
    "chunk_id": 9,
    "text": "Subject to the provisions of this Act and of any other law, no evidence shall be given in any suit or proceeding except evidence of the existence or non-existence of a fact in issue, and of any other fact declared by any provision of this Act to be relevant.",
    "prev_chunk_id": 8,
    "next_chunk_id": 10,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "6 – Facts forming part of the same transaction.",
    "section_number": "6",
    "section_title": "Facts forming part of the same transaction.",
    "section_path": "Part I – GENERAL > 6",
    "chunk_index": 1,
    "chunk_id": 10,
    "text": "Facts which, though not in issue, are so connected with a fact in issue as to form part of the same transaction are relevant whether they occurred at the same time and place or at different times and places.",
    "prev_chunk_id": 9,
    "next_chunk_id": 11,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "7 – Facts causing or caused by other facts.",
    "section_number": "7",
    "section_title": "Facts causing or caused by other facts.",
    "section_path": "Part I – GENERAL > 7",
    "chunk_index": 1,
    "chunk_id": 11,
    "text": "Facts which are the occasion, cause or effect, immediate or otherwise, of relevant facts or facts in issue, or which constitute the state of things under which they happened or which afforded an opportunity for their occurrence or transaction are relevant.",
    "prev_chunk_id": 10,
    "next_chunk_id": 12,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "8 – Facts relating to motive, preparation and conduct.",
    "section_number": "8",
    "section_title": "Facts relating to motive, preparation and conduct.",
    "section_path": "Part I – GENERAL > 8",
    "chunk_index": 1,
    "chunk_id": 12,
    "text": "(1) Any fact is relevant which shows or constitutes a motive or preparation for any fact in issue or relevant fact. (2) The conduct of any party, or of any agent of a party, to any suit or proceeding, in reference to such suit or proceeding or in reference to any fact in issue therein or relevant thereto, and the conduct of any person an offence against whom is the subject of any proceeding, is relevant, if such conduct influences or is influenced by any fact in issue or relevant fact, and whether it was previous or subsequent thereto. (3) When evidence of the conduct of a person is relevant any statement made to him, or in his presence and hearing, which affects such conduct, is relevant. (4) The word \"conduct\" in this section does not include statements, unless those statements accompany and explain acts other than statements.",
    "prev_chunk_id": 11,
    "next_chunk_id": 13,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "9 – Explanatory or introductory facts, etc.",
    "section_number": "9",
    "section_title": "Explanatory or introductory facts, etc.",
    "section_path": "Part I – GENERAL > 9",
    "chunk_index": 1,
    "chunk_id": 13,
    "text": "Facts necessary to explain or introduce a fact in issue or relevant fact, or which support or rebut an inference suggested by such a fact, or which establish the identity of any thing or person whose identity is relevant, or fix the time or place at which any fact in issue or relevant fact happened, or which show the relation of parties by whom any such fact was transacted, are relevant in so far as they are necessary for that purpose.",
    "prev_chunk_id": 12,
    "next_chunk_id": 14,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "10 – Statements and actions referring to common intention.",
    "section_number": "10",
    "section_title": "Statements and actions referring to common intention.",
    "section_path": "Part I – GENERAL > 10",
    "chunk_index": 1,
    "chunk_id": 14,
    "text": "Where there is reasonable ground to believe that two or more persons have conspired together to commit an offence or an actionable wrong, anything said, done or written by any one of such persons in reference to their common intention, after the time when such intention was first entertained by any one of them, is a relevant fact as against each of the persons believed to be so conspiring, as well for the purpose of proving the existence of the conspiracy as for the purpose of showing that any such person was a party to it.",
    "prev_chunk_id": 13,
    "next_chunk_id": 15,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "11 – Facts inconsistent with, or affecting probability of, other facts.",
    "section_number": "11",
    "section_title": "Facts inconsistent with, or affecting probability of, other facts.",
    "section_path": "Part I – GENERAL > 11",
    "chunk_index": 1,
    "chunk_id": 15,
    "text": "Facts not otherwise relevant are relevant— (a) if they are inconsistent with any fact in issue or relevant fact; or (b) if by themselves or in connection with other facts they make the existence or non-existence of any fact in issue or relevant fact highly probable or improbable.",
    "prev_chunk_id": 14,
    "next_chunk_id": 16,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "12 – Facts affecting quantum of damages.",
    "section_number": "12",
    "section_title": "Facts affecting quantum of damages.",
    "section_path": "Part I – GENERAL > 12",
    "chunk_index": 1,
    "chunk_id": 16,
    "text": "In suits in which damages are claimed, any fact which will enable the court to determine the amount of damages which ought to be awarded is relevant.",
    "prev_chunk_id": 15,
    "next_chunk_id": 17,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "13 – Facts affecting existence of right or custom.",
    "section_number": "13",
    "section_title": "Facts affecting existence of right or custom.",
    "section_path": "Part I – GENERAL > 13",
    "chunk_index": 1,
    "chunk_id": 17,
    "text": "Where the existence of any right or custom is in question, the following facts are relevant— (a) any transaction by which the right or custom in question was created, claimed, modified, recognized, asserted or denied, or which was inconsistent with its existence; or (b) particular instances in which the right or custom was claimed, recognized or exercised, or in which its exercise was disputed, asserted or departed from.",
    "prev_chunk_id": 16,
    "next_chunk_id": 18,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "14 – Facts showing state of mind or feeling.",
    "section_number": "14",
    "section_title": "Facts showing state of mind or feeling.",
    "section_path": "Part I – GENERAL > 14",
    "chunk_index": 1,
    "chunk_id": 18,
    "text": "(1) Facts showing the existence of any state of mind, such as intention, knowledge, good faith, negligence, rashness, ill-will or good-will towards any particular person, or showing the existence of any state of body or bodily feeling, are relevant, when the existence of any such state of mind or body or bodily feeling is in issue or relevant. (2) A fact relevant within the meaning of subsection (1) of this section as showing the existence of a state of mind must show that the state of mind exists, not generally, but in reference to the particular matter in question. (3) Where, upon the trial of a person accused of an offence, the previous commission by the accused of an offence is relevant within the meaning of subsection (1) of this section, the previous conviction of such person is also relevant.",
    "prev_chunk_id": 17,
    "next_chunk_id": 19,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "15 – Facts showing system.",
    "section_number": "15",
    "section_title": "Facts showing system.",
    "section_path": "Part I – GENERAL > 15",
    "chunk_index": 1,
    "chunk_id": 19,
    "text": "When there is a question whether an act was accidental or intentional, or done with a particular knowledge or intention, the fact that such act formed part of a series of similar occurrences, in each of which the person doing the act was concerned, is relevant.",
    "prev_chunk_id": 18,
    "next_chunk_id": 20,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – GENERAL",
    "section": "16 – Facts showing course of business.",
    "section_number": "16",
    "section_title": "Facts showing course of business.",
    "section_path": "Part I – GENERAL > 16",
    "chunk_index": 1,
    "chunk_id": 20,
    "text": "When there is a question whether a particular act was done, the existence of any course of business, according to which it naturally would have been done, is relevant.",
    "prev_chunk_id": 19,
    "next_chunk_id": 21,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "17 – Admissions defined generally.",
    "section_number": "17",
    "section_title": "Admissions defined generally.",
    "section_path": "Part II – ADMISSIONS > 17",
    "chunk_index": 1,
    "chunk_id": 21,
    "text": "An admission is a statement, oral or documentary, which suggests any inference as to a fact in issue or relevant fact, and which is made by any of the persons and in the circumstances hereinafter mentioned.",
    "prev_chunk_id": 20,
    "next_chunk_id": 22,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "18 – Statements by party to suit or agent or interested person.",
    "section_number": "18",
    "section_title": "Statements by party to suit or agent or interested person.",
    "section_path": "Part II – ADMISSIONS > 18",
    "chunk_index": 1,
    "chunk_id": 22,
    "text": "(1) Statements made by a party to the proceeding, or by an agent to any such party, whom the court regards in the circumstances of the case as expressly or impliedly authorized by him to make them, are admissions. (2) Statements made by parties to suits, suing or sued in a representative character, are not admissions unless they were made while the party making them held that character. (3) Statements made by— (a) persons who have any proprietary or pecuniary interest in the subject- matter of the proceeding, and who make the statement in the character of persons so interested; or (b) persons from whom the parties to a suit have derived their interest in the subject-matter of the suit, are admissions if they are made during the continuance of interest of the persons making the statements.",
    "prev_chunk_id": 21,
    "next_chunk_id": 23,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "19 – Statements by persons whose position or liability must be proved as against party to suit.",
    "section_number": "19",
    "section_title": "Statements by persons whose position or liability must be proved as against party to suit.",
    "section_path": "Part II – ADMISSIONS > 19",
    "chunk_index": 1,
    "chunk_id": 23,
    "text": "Statements made by persons whose position or liability it is necessary to prove as against any party to a suit, are admissions if such statements would be admissible as against such persons in relation to such position or liability in a suit brought by or against them, and if they are made whilst the person making them occupies such position or is subject to such liability.",
    "prev_chunk_id": 22,
    "next_chunk_id": 24,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "20 – Statements by persons expressly referred to by party to suit.",
    "section_number": "20",
    "section_title": "Statements by persons expressly referred to by party to suit.",
    "section_path": "Part II – ADMISSIONS > 20",
    "chunk_index": 1,
    "chunk_id": 24,
    "text": "Statements made by persons to whom a party to the suit has expressly referred for information in reference to a matter in dispute are admissions. 20A. Proof of written statement by consent. (1) If the person who makes a statement cannot read it, the statement shall be read to him by an officer of or above the rank of a Chief Inspector or a magistrate before he signs it, and an endorsement shall be made thereof by the person who so read the statement to the effect that it was so read. (2) A copy of the statement, together with a copy of any document referred to in the statement as an exhibit, or with such information as may be necessary in order to enable the party on whom it is served to inspect such document or a copy thereof, shall, before the date on which the document is to be tendered in evidence, be served on each of the other parties to the proceedings, and any such party may, at least two days before the commencement of the proceedings, object to the statement being tendered in evidence under this section. (3) If a party objects under subsection (2) that the statement in question be tendered in evidence, the statement shall not, but subject to the provisions of subsection (4),",
    "prev_chunk_id": 23,
    "next_chunk_id": 25,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "20 – Statements by persons expressly referred to by party to suit.",
    "section_number": "20",
    "section_title": "Statements by persons expressly referred to by party to suit.",
    "section_path": "Part II – ADMISSIONS > 20",
    "chunk_index": 2,
    "chunk_id": 25,
    "text": "shall, before the date on which the document is to be tendered in evidence, be served on each of the other parties to the proceedings, and any such party may, at least two days before the commencement of the proceedings, object to the statement being tendered in evidence under this section. (3) If a party objects under subsection (2) that the statement in question be tendered in evidence, the statement shall not, but subject to the provisions of subsection (4), be admissible as evidence under this section. (4) If a party does not object under subsection (2) or if the parties agree before or during the proceedings in question that the statement may be so tendered in evidence, the statement may, upon the mere production thereof at such proceedings, be admitted as evidence in the proceedings. (5) When the documents referred to in subsection (3) are served on an accused person, the documents shall be accompanied by a written notification in which the accused person is informed that the statement in question shall be tendered in evidence at his trial in lieu of the State calling as a witness the person who made the statement, but that such statement shall not without the consent of the accused person be so tendered in evidence if he notifies the prosecutor concerned, at",
    "prev_chunk_id": 24,
    "next_chunk_id": 26,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "20 – Statements by persons expressly referred to by party to suit.",
    "section_number": "20",
    "section_title": "Statements by persons expressly referred to by party to suit.",
    "section_path": "Part II – ADMISSIONS > 20",
    "chunk_index": 3,
    "chunk_id": 26,
    "text": "referred to in subsection (3) are served on an accused person, the documents shall be accompanied by a written notification in which the accused person is informed that the statement in question shall be tendered in evidence at his trial in lieu of the State calling as a witness the person who made the statement, but that such statement shall not without the consent of the accused person be so tendered in evidence if he notifies the prosecutor concerned, at least two days before the commencement of the proceedings, that he objects to the statement so being tendered in evidence. (6) The parties to criminal proceedings may, before or during such proceedings, agree that any written statement referred to in subsections (1) which has not been served in terms of subsection (2) be tendered in evidence at such proceedings, whereupon such statement may, upon the mere production thereof at such proceedings, be admitted as evidence in the proceedings. (7) Notwithstanding that a written statement made by any person may be admissible as evidence under this section— (a) a party by whom or on whose behalf a copy of the statement was served, may call such person to give oral evidence; (b) the court may, of its own motion, and shall, upon the application of any party to the proceedings in",
    "prev_chunk_id": 25,
    "next_chunk_id": 27,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "20 – Statements by persons expressly referred to by party to suit.",
    "section_number": "20",
    "section_title": "Statements by persons expressly referred to by party to suit.",
    "section_path": "Part II – ADMISSIONS > 20",
    "chunk_index": 4,
    "chunk_id": 27,
    "text": "such statement may, upon the mere production thereof at such proceedings, be admitted as evidence in the proceedings. (7) Notwithstanding that a written statement made by any person may be admissible as evidence under this section— (a) a party by whom or on whose behalf a copy of the statement was served, may call such person to give oral evidence; (b) the court may, of its own motion, and shall, upon the application of any party to the proceedings in question, cause the person giving oral evidence to be summoned before the court, or the court may, where the person concerned is resident outside the court's jurisdiction, issue summons to be effected through the diplomatic channel. (8) Any document or object referred to as an exhibit and identified in a written statement tendered in evidence under this section, shall be treated as if it had been produced as an exhibit and identified in court by the person who made the statement. (9) Any person who makes a statement which is admitted as evidence under this section and who in such statement willfully and falsely states anything which, if sworn, would have amounted to the offence of perjury, shall be deemed to have committed the offence of perjury and shall, upon conviction, be liable to the punishment prescribed therefor. [Act No.",
    "prev_chunk_id": 26,
    "next_chunk_id": 28,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "20 – Statements by persons expressly referred to by party to suit.",
    "section_number": "20",
    "section_title": "Statements by persons expressly referred to by party to suit.",
    "section_path": "Part II – ADMISSIONS > 20",
    "chunk_index": 5,
    "chunk_id": 28,
    "text": "treated as if it had been produced as an exhibit and identified in court by the person who made the statement. (9) Any person who makes a statement which is admitted as evidence under this section and who in such statement willfully and falsely states anything which, if sworn, would have amounted to the offence of perjury, shall be deemed to have committed the offence of perjury and shall, upon conviction, be liable to the punishment prescribed therefor. [Act No. 19 of 2014, s. 26.]",
    "prev_chunk_id": 27,
    "next_chunk_id": 29,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "21 – Proof of admissions against persons making them, and by or on their behalf.",
    "section_number": "21",
    "section_title": "Proof of admissions against persons making them, and by or on their behalf.",
    "section_path": "Part II – ADMISSIONS > 21",
    "chunk_index": 1,
    "chunk_id": 29,
    "text": "Subject to the provisions of this Act, an admission may be proved as against the person who makes it or his representative in interest; but an admission cannot be proved by or on behalf of the person who makes it or by his representative in interest, except in the following cases— (a) when it is of such a nature that, if the person making it were dead, it would be admissible as between third persons under section 33 of this Act; (b) when it consists of a statement of the existence of any state of mind or body, relevant or in issue, made at or about the time when such state of mind or body existed, and is accompanied by conduct rendering its falsehood improbable; (c) if it is relevant otherwise than as an admission.",
    "prev_chunk_id": 28,
    "next_chunk_id": 30,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "22 – Oral admissions as to contents of documents.",
    "section_number": "22",
    "section_title": "Oral admissions as to contents of documents.",
    "section_path": "Part II – ADMISSIONS > 22",
    "chunk_index": 1,
    "chunk_id": 30,
    "text": "Oral admissions as to the contents of a document may not be proved unless and until the party proposing to prove them shows that he is entitled to give secondary evidence of the contents of such document under the provisions of this Act or unless the genuineness of a document produced is in question.",
    "prev_chunk_id": 29,
    "next_chunk_id": 31,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "23 – Admissions made without prejudice in civil cases.",
    "section_number": "23",
    "section_title": "Admissions made without prejudice in civil cases.",
    "section_path": "Part II – ADMISSIONS > 23",
    "chunk_index": 1,
    "chunk_id": 31,
    "text": "(1) In civil cases no admission may be proved if it is made either upon an express condition that evidence of it is not to be given or in circumstances from which the court can infer that the parties agreed together that evidence of it should not be given. (2) Nothing in subsection (1) of this section shall be taken to exempt any advocate from giving evidence of any matter of which he may be compelled to give evidence under section 134 of this Act.",
    "prev_chunk_id": 30,
    "next_chunk_id": 32,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ADMISSIONS",
    "section": "24 – Effect of admissions.",
    "section_number": "24",
    "section_title": "Effect of admissions.",
    "section_path": "Part II – ADMISSIONS > 24",
    "chunk_index": 1,
    "chunk_id": 32,
    "text": "Admissions are not conclusive proof of the matters admitted, but they may operate as estoppels under the provisions hereinafter contained.",
    "prev_chunk_id": 31,
    "next_chunk_id": 33,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – CONFESSIONS",
    "section": "25 – Confession defined.",
    "section_number": "25",
    "section_title": "Confession defined.",
    "section_path": "Part III – CONFESSIONS > 25",
    "chunk_index": 1,
    "chunk_id": 33,
    "text": "A confession comprises words or conduct, or a combination of words and conduct, from which, whethertaken alone or in conjunction with other facts proved, an inference may reasonably be drawn that the person making it has committed an offence. 25A. Confessions generally inadmissible. (1) A confession or any admission of a fact tending to the proof of guilt made by an accused person is not admissible and shall not be proved as against such person unless it is made in court before a judge, a magistrate or before a police officer (other than the investigating officer), being an officer not below the rank of Inspector of Police, and a third party of the person’s choice. (2) The Attorney-General shall in consultation with the Law Society of Kenya, Kenya National Commission on Human Rights and other suitable bodies make rules governing the making of a confession in all instances where the confession is not made in court. [Act No. 5 of 2003, s. 99, Act No. 7 of 2007, Sch., Act No. 19 of 2014, s. 28.]",
    "prev_chunk_id": 32,
    "next_chunk_id": 34,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – CONFESSIONS",
    "section": "26 – Confessions and admissions caused by inducement, threat or promise.",
    "section_number": "26",
    "section_title": "Confessions and admissions caused by inducement, threat or promise.",
    "section_path": "Part III – CONFESSIONS > 26",
    "chunk_index": 1,
    "chunk_id": 34,
    "text": "A confession or any admission of a fact tending to the proof of guilt made by an accused person is notadmissible in a criminal proceeding if the making of the confession or admission appears to the court to have been caused by any inducement, threat or promise having reference to the charge against the accused person, proceeding from a person in authority and sufficient, in the opinion of the court, to give the accused person grounds which would appear to him reasonable for supposing that by making it he would gain any advantage or avoid any evil of a temporal nature in reference to the proceedings against him.",
    "prev_chunk_id": 33,
    "next_chunk_id": 35,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – CONFESSIONS",
    "section": "27 – Confession made after removal of impression caused by inducement, threat or promise.",
    "section_number": "27",
    "section_title": "Confession made after removal of impression caused by inducement, threat or promise.",
    "section_path": "Part III – CONFESSIONS > 27",
    "chunk_index": 1,
    "chunk_id": 35,
    "text": "If such a confession as is referred to in section 26 of this Act is made after the impression caused by any such inducement, threat or promise has, in the opinion of the court, been fully removed, it is admissible.",
    "prev_chunk_id": 34,
    "next_chunk_id": 36,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – CONFESSIONS",
    "section": "29 – Confessions to police officers.",
    "section_number": "29",
    "section_title": "Confessions to police officers.",
    "section_path": "Part III – CONFESSIONS > 29",
    "chunk_index": 1,
    "chunk_id": 36,
    "text": "No confession made to a police officer shall be proved against a person accused of any offence unless such police officer is— (a) of or above the rank of, or a rank equivalent to, Inspector; or (b) an administrative officer holding first or second class magisterial powers and acting in the capacity of a police officer. [Act No. 10 of 1969, Sch.]",
    "prev_chunk_id": 35,
    "next_chunk_id": 37,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – CONFESSIONS",
    "section": "32 – Confession implicating co-accused.",
    "section_number": "32",
    "section_title": "Confession implicating co-accused.",
    "section_path": "Part III – CONFESSIONS > 32",
    "chunk_index": 1,
    "chunk_id": 37,
    "text": "(1) When more persons than one are being tried jointly for the same offence, and a confession made by one of such persons affecting himself and some other of such persons is proved, the court may take the confession into consideration as against such other person as well as against the person who made the confession. (2) In this section \"confession\" means any words or conduct, or combination of words and conduct, which has the effect of admitting in terms either an offence or substantially all the facts which constitute an offence— \"offence\" includes the abetment of, or an attempt to commit, the offence.",
    "prev_chunk_id": 36,
    "next_chunk_id": 38,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES",
    "section": "33 – Statement by deceased person, etc., when.",
    "section_number": "33",
    "section_title": "Statement by deceased person, etc., when.",
    "section_path": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES > 33",
    "chunk_index": 1,
    "chunk_id": 38,
    "text": "Statements, written or oral or electronically recorded, of admissible facts made by a person who is dead, or who cannot be found, or who has become incapable of giving evidence or whose attendance cannot be procured, or whose attendance cannot be procured, without an amount of delay or expense which in the circumstances of the case appears to the court unreasonable, are themselves admissible in the following cases— (a) relating to cause of death when the statement is made by a person as to the cause of his death, or as to any of the circumstances of the transaction which resulted in his death, in cases in which the cause of that person’s death comes into question. Such statements are admissible whether the person who made them was or was not, at the time when they were made, under expectation of death, and whatever may be the nature of the proceeding in which the cause of his death comes into question; (b) made in the course of business when the statement was made by such person in the ordinary course of business, and in particular when it consists of an entry or memorandum made by him in books or records kept in the ordinary course of business or in the discharge of professional duty; or of an acknowledgement written or",
    "prev_chunk_id": 37,
    "next_chunk_id": 39,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES",
    "section": "33 – Statement by deceased person, etc., when.",
    "section_number": "33",
    "section_title": "Statement by deceased person, etc., when.",
    "section_path": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES > 33",
    "chunk_index": 2,
    "chunk_id": 39,
    "text": "of death, and whatever may be the nature of the proceeding in which the cause of his death comes into question; (b) made in the course of business when the statement was made by such person in the ordinary course of business, and in particular when it consists of an entry or memorandum made by him in books or records kept in the ordinary course of business or in the discharge of professional duty; or of an acknowledgement written or signed by him of the receipt of money, goods, securities or property of any kind; or of a document used in commerce, written or signed by him, or of the date of a letter or other document usually dated, written or signed by him; (c) against the interest of maker when the statement is against the pecuniary or proprietary interest of the person making it, or when, if true, it would expose him or would have exposed him to a criminal prosecution or to a suit for damages; (d) an opinion as to public right or custom when the statement gives the opinion of any such person as to the existence of any public right or custom or matter of public or general interest, of the existence of which, if it existed, he would have been likely to be aware,",
    "prev_chunk_id": 38,
    "next_chunk_id": 40,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES",
    "section": "33 – Statement by deceased person, etc., when.",
    "section_number": "33",
    "section_title": "Statement by deceased person, etc., when.",
    "section_path": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES > 33",
    "chunk_index": 3,
    "chunk_id": 40,
    "text": "of the person making it, or when, if true, it would expose him or would have exposed him to a criminal prosecution or to a suit for damages; (d) an opinion as to public right or custom when the statement gives the opinion of any such person as to the existence of any public right or custom or matter of public or general interest, of the existence of which, if it existed, he would have been likely to be aware, and when such statement was made before any controversy as to such right, custom or matter had arisen; (e) relating to existence of relationship when the statement relates to the existence of any relationship by blood, marriage, or adoption between persons at whose relationship by blood, marriage or adoption the person making the statement had special means of knowledge, and when the statement was made before the question in dispute was raised; (f) relating to family affairs when the statement relates to the existence of any relationship by blood, marriage or adoption between persons deceased, and is made in any will or deed relating to the affairs of the family to which any such deceased person belonged, or in any family pedigree or upon any tombstone, family portrait or other thing on which such statements are usually made, and when",
    "prev_chunk_id": 39,
    "next_chunk_id": 41,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES",
    "section": "33 – Statement by deceased person, etc., when.",
    "section_number": "33",
    "section_title": "Statement by deceased person, etc., when.",
    "section_path": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES > 33",
    "chunk_index": 4,
    "chunk_id": 41,
    "text": "when the statement was made before the question in dispute was raised; (f) relating to family affairs when the statement relates to the existence of any relationship by blood, marriage or adoption between persons deceased, and is made in any will or deed relating to the affairs of the family to which any such deceased person belonged, or in any family pedigree or upon any tombstone, family portrait or other thing on which such statements are usually made, and when such statement was made before the question in dispute was raised; (g) relating to a transaction creating or asserting, etc., a custom when the statement is contained in any deed or other document which relates to any such transaction as is mentioned in section 13(a); (h) made by several persons and expressing feelings when the statement was made by a number of persons, and expressed feelings or impressions on their part relevant to the matter in question. [Act No. 8 of 1968, Sch., Act No. 19 of 2014, s. 27.]",
    "prev_chunk_id": 40,
    "next_chunk_id": 42,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES",
    "section": "34 – Admissibility of evidence given in previous proceedings.",
    "section_number": "34",
    "section_title": "Admissibility of evidence given in previous proceedings.",
    "section_path": "Part IV – STATEMENTS BY PERSONS WHO CANNOT BE CALLED AS WITNESSES > 34",
    "chunk_index": 1,
    "chunk_id": 42,
    "text": "(1) Evidence given by a witness in a judicial proceeding is admissible in a subsequent judicial proceeding or at a later stage in the same proceeding, for the purpose of proving the facts which it states, in the following circumstances— (a) where the witness is dead, or cannot be found, or is incapable of giving evidence, or is kept out of the way by the adverse party, or where his presence cannot be obtained without an amount of delay or expense which in the circumstances of the case the court considers unreasonable; and where, in the case of a subsequent proceeding— (b) the proceeding is between the same parties or their representatives in interest; and (c) the adverse party in the first proceeding had the right and opportunity to cross-examine; and (d) the questions in issue were substantially the same in the first as in the second proceeding. (2) For the purposes of this section— (a) the expression \"judicial proceeding\" shall be deemed to include any proceeding in which evidence is taken by a person authorized by law to take that evidence on oath; and (b) a criminal trial or inquiry shall be deemed to be a proceeding between the prosecutor and the accused.",
    "prev_chunk_id": 41,
    "next_chunk_id": 43,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS",
    "section": "35 – Admissibility of documentary evidence as to facts in issue.",
    "section_number": "35",
    "section_title": "Admissibility of documentary evidence as to facts in issue.",
    "section_path": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS > 35",
    "chunk_index": 1,
    "chunk_id": 43,
    "text": "(1) In any civil proceedings where direct oral evidence of a fact would be admissible, any statement made by a person in a document and tending to establish that fact shall, on production of the original document, be admissible as evidence of that fact if the following conditions are satisfied, that is to say— (a) if the maker of the statement either— (i) had personal knowledge of the matters dealt with by the statement; or (ii) where the document in question is or forms part of a record purporting to be a continuous record, made the statement (in so far as the matters dealt with thereby are not within his personal knowledge) in the performance of a duty to record information supplied to him by a person who had, or might reasonably be supposed to have, personal knowledge of those matters; and (b) if the maker of the statement is called as a witness in the proceedings: Provided that the condition that the maker of the statement shall be called as a witness need not be satisfied if he is dead, or cannot be found, or is incapable of giving evidence, or if his attendance cannot be procured without an amount of delay or expense which in the circumstances of the case appears to the court unreasonable. (2) In any",
    "prev_chunk_id": 42,
    "next_chunk_id": 44,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS",
    "section": "35 – Admissibility of documentary evidence as to facts in issue.",
    "section_number": "35",
    "section_title": "Admissibility of documentary evidence as to facts in issue.",
    "section_path": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS > 35",
    "chunk_index": 2,
    "chunk_id": 44,
    "text": "matters; and (b) if the maker of the statement is called as a witness in the proceedings: Provided that the condition that the maker of the statement shall be called as a witness need not be satisfied if he is dead, or cannot be found, or is incapable of giving evidence, or if his attendance cannot be procured without an amount of delay or expense which in the circumstances of the case appears to the court unreasonable. (2) In any civil proceedings, the court may at any stage of the proceedings, if having regard to all the circumstances of the case it is satisfied that undue delay or expense would otherwise be caused, order that such a statement as is mentioned in subsection (1) of this section shall be admissible or may, without any such order having been made, admit such a statement in evidence— (a) notwithstanding that the maker of the statement is available but is not called as a witness; (b) notwithstanding that the original document is not produced, if in lieu thereof there is produced a copy of the original document or of the material part thereof certified to be a true copy in such manner as may be specified in the order or the court may approve, as the case may be. (3) Nothing in this",
    "prev_chunk_id": 43,
    "next_chunk_id": 45,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS",
    "section": "35 – Admissibility of documentary evidence as to facts in issue.",
    "section_number": "35",
    "section_title": "Admissibility of documentary evidence as to facts in issue.",
    "section_path": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS > 35",
    "chunk_index": 3,
    "chunk_id": 45,
    "text": "such a statement in evidence— (a) notwithstanding that the maker of the statement is available but is not called as a witness; (b) notwithstanding that the original document is not produced, if in lieu thereof there is produced a copy of the original document or of the material part thereof certified to be a true copy in such manner as may be specified in the order or the court may approve, as the case may be. (3) Nothing in this section shall render admissible any statement made by a person interested at a time when proceedings were pending or anticipated involving a dispute as to any fact which the statement might tend to establish. (4) For the purposes of this section, a statement in a document shall not be deemed to have been made by a person unless the document or the material part thereof was written, made or produced by him with his own hand, or was signed or initialled by him or otherwise recognized by him in writing as one for the accuracy of which he is responsible. (5) For the purpose of deciding whether or not a statement is admissible by virtue of this section, the court may draw any reasonable inference from the form or contents of the document in which the statement is contained, or",
    "prev_chunk_id": 44,
    "next_chunk_id": 46,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS",
    "section": "35 – Admissibility of documentary evidence as to facts in issue.",
    "section_number": "35",
    "section_title": "Admissibility of documentary evidence as to facts in issue.",
    "section_path": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS > 35",
    "chunk_index": 4,
    "chunk_id": 46,
    "text": "or the material part thereof was written, made or produced by him with his own hand, or was signed or initialled by him or otherwise recognized by him in writing as one for the accuracy of which he is responsible. (5) For the purpose of deciding whether or not a statement is admissible by virtue of this section, the court may draw any reasonable inference from the form or contents of the document in which the statement is contained, or from any other circumstances, and may, in deciding whether or not a person is fit to attend as a witness, act on a certificate purporting to be the certificate of a medical practitioner.",
    "prev_chunk_id": 45,
    "next_chunk_id": 47,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS",
    "section": "36 – Weight to be attached to statement admissible under section 35.",
    "section_number": "36",
    "section_title": "Weight to be attached to statement admissible under section 35.",
    "section_path": "Part V – STATEMENTS IN DOCUMENTS PRODUCED IN CIVIL PROCEEDINGS > 36",
    "chunk_index": 1,
    "chunk_id": 47,
    "text": "(1) In estimating the weight, if any, to be attached to a statement rendered admissible by section 35 of this Act, regard shall be had to all the circumstances from which any inference can reasonably be drawn as to the accuracy or otherwise of the statement, and in particular to the question whether or not the statement was made contemporaneously with the occurrence or existence of the facts stated, and to the question whether or not the maker of the statement had any incentive to conceal or misrepresent facts. (2) For the purpose of any rule of law or practice requiring evidence to be corroborated or regulating the manner in which uncorroborated evidence is to be treated, a statement rendered admissible by section 35 of this Act shall not be treated as corroboration of evidence given by the maker of the statement.",
    "prev_chunk_id": 46,
    "next_chunk_id": 48,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES",
    "section": "37 – Entries in books of account.",
    "section_number": "37",
    "section_title": "Entries in books of account.",
    "section_path": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES > 37",
    "chunk_index": 1,
    "chunk_id": 48,
    "text": "Entries in books of account regularly kept in the course of business are admissible whenever they refer to a matter into which the court has to inquire, but such statements shall not alone be sufficient evidence to charge any person with liability.",
    "prev_chunk_id": 47,
    "next_chunk_id": 49,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES",
    "section": "38 – Entries in public records.",
    "section_number": "38",
    "section_title": "Entries in public records.",
    "section_path": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES > 38",
    "chunk_index": 1,
    "chunk_id": 49,
    "text": "An entry in any public or other official book, register or record, stating a fact in issue or a relevant fact, and made by a public servant in the discharge of his official duty, or by any other person in performance of a duty specially enjoined by the law of the country in which such book, register or record is kept, is itself admissible.",
    "prev_chunk_id": 48,
    "next_chunk_id": 50,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES",
    "section": "39 – Statements, etc., in maps, charts and plans.",
    "section_number": "39",
    "section_title": "Statements, etc., in maps, charts and plans.",
    "section_path": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES > 39",
    "chunk_index": 1,
    "chunk_id": 50,
    "text": "Statements and representations of facts in issue or relevant facts made in published maps or charts generally offered for public sale, or in maps or plans made under the authority of any Government in the Commonwealth, as to matters usually stated or represented in such maps, charts or plans, are themselves admissible.",
    "prev_chunk_id": 49,
    "next_chunk_id": 51,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES",
    "section": "40 – Statements of fact contained in laws and official gazettes, etc.",
    "section_number": "40",
    "section_title": "Statements of fact contained in laws and official gazettes, etc.",
    "section_path": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES > 40",
    "chunk_index": 1,
    "chunk_id": 51,
    "text": "When the court has to form an opinion as to the existence of any fact of a public nature, any statement of it shall be admissible which is made— (a) in any written law of Kenya, or in any notice purporting to be made in pursuance of any such written law, where the law or notice (as the case may be) purports to be printed by the Government Printer; or (b) in any written law in force in any country in the Commonwealth, or in any notice purporting to be made in pursuance of any such written law, where the law or notice (as the case may be) purports to be printed or published by or under the authority of the Government of that country.",
    "prev_chunk_id": 50,
    "next_chunk_id": 52,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES",
    "section": "41 – Statements as to law contained in books.",
    "section_number": "41",
    "section_title": "Statements as to law contained in books.",
    "section_path": "Part VI – STATEMENTS UNDER SPECIAL CIRCUMSTANCES > 41",
    "chunk_index": 1,
    "chunk_id": 52,
    "text": "When the court has to form an opinion as to a law of any country, any statement of such law contained in a book purporting to be printed or published under the authority of the Government of such country and to contain any such law, and any report of a ruling of the courts of such country contained in a book purporting to be a report of such rulings, is admissible.",
    "prev_chunk_id": 51,
    "next_chunk_id": 53,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – EXTENT TO WHICH STATEMENT IS ADMISSIBLE",
    "section": "42 – Extent of admissibility.",
    "section_number": "42",
    "section_title": "Extent of admissibility.",
    "section_path": "Part VII – EXTENT TO WHICH STATEMENT IS ADMISSIBLE > 42",
    "chunk_index": 1,
    "chunk_id": 53,
    "text": "When any statement of which evidence is given forms part of a longer statement, or of a conversation, or of an isolated document, or is contained in a document which forms part of a book or of a connected series of letters or papers, evidence shall be given of so much and no more of such longer statement, or of such conversation, document, book or series, as the court considers necessary in the particular case to a full understanding of the nature and effect of the statement, and of the circumstances in which it was made.",
    "prev_chunk_id": 52,
    "next_chunk_id": 54,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VIII – JUDGMENTS",
    "section": "43 – Judgments, etc., excluding jurisdiction.",
    "section_number": "43",
    "section_title": "Judgments, etc., excluding jurisdiction.",
    "section_path": "Part VIII – JUDGMENTS > 43",
    "chunk_index": 1,
    "chunk_id": 54,
    "text": "The existence of any judgment, order or decree which by law prevents any court from taking cognizance of a suit or holding a trial, may be proved when the question is whether such court ought to take cognizance of such suit or to hold such trial.",
    "prev_chunk_id": 53,
    "next_chunk_id": 55,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VIII – JUDGMENTS",
    "section": "44 – Judgments in rem.",
    "section_number": "44",
    "section_title": "Judgments in rem.",
    "section_path": "Part VIII – JUDGMENTS > 44",
    "chunk_index": 1,
    "chunk_id": 55,
    "text": "(1) A final judgment, order or decree of a competent court which confers upon or takes away from any person any legal character, or which declares any person to be entitled to any such character, or to be entitled to any specific thing, not as against any specified person but absolutely, is admissible when the existence of any such legal character, or the title of any such person to any such thing, is admissible. (2) Such judgment, order or decree is conclusive proof— (a) that any legal character which it confers accrued at the time when such judgment, order or decree came into operation; (b) that any legal character to which it declares any such person to be entitled accrued to that person at the time when such judgment, order or decree declares it to have accrued to that person; (c) that any legal character which it takes away from any such person ceased at the time from which such judgment, order or decree declared that it had ceased or should cease; (d) that anything to which it declares any person to be so entitled was the property of that person at the time from which such judgment, order or decree declares that it had been or should be his property.",
    "prev_chunk_id": 54,
    "next_chunk_id": 56,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VIII – JUDGMENTS",
    "section": "45 – Other judgments of a public nature.",
    "section_number": "45",
    "section_title": "Other judgments of a public nature.",
    "section_path": "Part VIII – JUDGMENTS > 45",
    "chunk_index": 1,
    "chunk_id": 56,
    "text": "Judgments, orders or decrees, other than those mentioned in section 44 of this Act, are admissible if they relate to matters of a public nature relevant to the inquiry, but such judgments, orders or decrees are not conclusive proof of that which they state.",
    "prev_chunk_id": 55,
    "next_chunk_id": 57,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VIII – JUDGMENTS",
    "section": "46 – Inadmissible judgments.",
    "section_number": "46",
    "section_title": "Inadmissible judgments.",
    "section_path": "Part VIII – JUDGMENTS > 46",
    "chunk_index": 1,
    "chunk_id": 57,
    "text": "Judgments, orders or decrees other than those mentioned in sections 43, 44 and 45 of this Act are inadmissible except where the existence of such judgment, order or decree is a fact in issue or is relevant under some other provision of this Act.",
    "prev_chunk_id": 56,
    "next_chunk_id": 58,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VIII – JUDGMENTS",
    "section": "47 – Proof that judgment was incompetent or obtained by fraud or collusion.",
    "section_number": "47",
    "section_title": "Proof that judgment was incompetent or obtained by fraud or collusion.",
    "section_path": "Part VIII – JUDGMENTS > 47",
    "chunk_index": 1,
    "chunk_id": 58,
    "text": "Any party to a suit or other proceeding may show that any judgment, order or decree which is admissible under the provisions of this Act and which has been proved by the adverse party, was delivered by a court not competent to deliver it, or was obtained by fraud or collusion. 47A. Proof of guilt. A final judgment of a competent court in any criminal proceedings which declares any person to be guilty of a criminal offence shall, after the expiry of the time limited for an appeal against such judgment or after the date of the decision of any appeal therein, whichever is the latest, be taken as conclusive evidence that the person so convicted was guilty of that offence as charged. [Act No. 10 of 1969, Sch.]",
    "prev_chunk_id": 57,
    "next_chunk_id": 59,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "48 – Opinions of experts.",
    "section_number": "48",
    "section_title": "Opinions of experts.",
    "section_path": "Part IX – OPINIONS > 48",
    "chunk_index": 1,
    "chunk_id": 59,
    "text": "(1) When the court has to form an opinion upon a point of foreign law, or of science or art, or as to identity or genuineness of handwriting or finger or other impressions, opinions upon that point are admissible if made by persons specially skilled in such foreign law, science or art, or in questions as to identity, or genuineness of handwriting or fingerprint or other impressions. (2) Such persons are called experts.",
    "prev_chunk_id": 58,
    "next_chunk_id": 60,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "49 – Facts bearing upon opinions of experts.",
    "section_number": "49",
    "section_title": "Facts bearing upon opinions of experts.",
    "section_path": "Part IX – OPINIONS > 49",
    "chunk_index": 1,
    "chunk_id": 60,
    "text": "Facts not otherwise admissible are admissible if they support or are inconsistent with the opinions of experts, when such opinions are admissible.",
    "prev_chunk_id": 59,
    "next_chunk_id": 61,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "50 – Opinion as to handwriting.",
    "section_number": "50",
    "section_title": "Opinion as to handwriting.",
    "section_path": "Part IX – OPINIONS > 50",
    "chunk_index": 1,
    "chunk_id": 61,
    "text": "(1) When the court has to form an opinion as to the person by whom any document was written or signed, the opinion of any person acquainted with the handwriting of the person by whom it is supposed to be written or signed that it was or was not written or signed by that person, is admissible. (2) For the purposes of subsection (1) of this section, and without prejudice to any other means of determining the question, a person is said to be acquainted with the handwriting of another person when he has seen that person write, or when he has received documents purporting to be written by that person in answer to documents written by himself or under his authority and addressed to that person, or when in the ordinary course of business documents purporting to be written by that person have been habitually submitted to him.",
    "prev_chunk_id": 60,
    "next_chunk_id": 62,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "51 – Opinion relating to customs and rights.",
    "section_number": "51",
    "section_title": "Opinion relating to customs and rights.",
    "section_path": "Part IX – OPINIONS > 51",
    "chunk_index": 1,
    "chunk_id": 62,
    "text": "(1) When the court has to form an opinion as to the existence of any general custom or right, the opinions as to the existence of such custom or right of persons who would be likely to know of its existence if it existed are admissible. (2) For the purposes of subsection (1) of this section the expression \"general custom or right\" includes customs or rights common to any considerable class of persons.",
    "prev_chunk_id": 61,
    "next_chunk_id": 63,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "52 – Opinions of persons with special knowledge.",
    "section_number": "52",
    "section_title": "Opinions of persons with special knowledge.",
    "section_path": "Part IX – OPINIONS > 52",
    "chunk_index": 1,
    "chunk_id": 63,
    "text": "When the court has to form an opinion as to— (a) the usages and tenets of any association, body of men or family; or (b) the constitution and government of any religious or charitable foundation; or (c) the meaning of words or terms used in particular districts or by particular classes of people, the opinions of persons having special means of knowledge thereon are admissible.",
    "prev_chunk_id": 62,
    "next_chunk_id": 64,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "53 – Opinion on relationship.",
    "section_number": "53",
    "section_title": "Opinion on relationship.",
    "section_path": "Part IX – OPINIONS > 53",
    "chunk_index": 1,
    "chunk_id": 64,
    "text": "When the court has to form an opinion as to the relationship of one person to another, the opinion, expressed by conduct, as to the existence of such relationship of any person who, as a member of the family or otherwise, has special means of knowledge on the subject, is admissible: Provided that such an opinion shall not be sufficient to prove a marriage in a prosecution for bigamy or in proceedings for a divorce, or in any proceedings for damages against an adulterer.",
    "prev_chunk_id": 63,
    "next_chunk_id": 65,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IX – OPINIONS",
    "section": "54 – Grounds of opinion.",
    "section_number": "54",
    "section_title": "Grounds of opinion.",
    "section_path": "Part IX – OPINIONS > 54",
    "chunk_index": 1,
    "chunk_id": 65,
    "text": "Whenever the opinion of any living person is admissible, the grounds on which such opinion is based are also admissible.",
    "prev_chunk_id": 64,
    "next_chunk_id": 66,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part X – CHARACTER",
    "section": "55 – Character in civil cases.",
    "section_number": "55",
    "section_title": "Character in civil cases.",
    "section_path": "Part X – CHARACTER > 55",
    "chunk_index": 1,
    "chunk_id": 66,
    "text": "(1) In civil cases, the fact that the character of any person concerned is such as to render probable or improbable any conduct imputed to him is inadmissible except in so far as such character appears from facts otherwise admissible. (2) In civil cases, the fact that the character of any person is such as to affect the amount of damages, is admissible.",
    "prev_chunk_id": 65,
    "next_chunk_id": 67,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part X – CHARACTER",
    "section": "56 – Good character in criminal cases.",
    "section_number": "56",
    "section_title": "Good character in criminal cases.",
    "section_path": "Part X – CHARACTER > 56",
    "chunk_index": 1,
    "chunk_id": 67,
    "text": "In criminal proceedings, the fact that the person accused is of a good character is admissible.",
    "prev_chunk_id": 66,
    "next_chunk_id": 68,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part X – CHARACTER",
    "section": "57 – Bad character in criminal cases.",
    "section_number": "57",
    "section_title": "Bad character in criminal cases.",
    "section_path": "Part X – CHARACTER > 57",
    "chunk_index": 1,
    "chunk_id": 68,
    "text": "(1) In criminal proceedings the fact that the accused person has committed or been convicted of or charged with any offence other than that with which he is then charged, or is of bad character, is inadmissible unless— (aa) such evidence is otherwise admissible as evidence of a fact in issue or is directly relevant to a fact in issue; or (a) the proof that he has committed or been convicted of such other offence is admissible under section 14 or section 15 of this Act to show that he is guilty of the offence with which he is then charged; or (b) he has personally or by his advocate asked questions of a witness for the prosecution with a view to establishing his own character, or has given evidence of his own good character; or (c) the nature or conduct of the defence is such as to involve imputations on the character of the complainant or of a witness for the prosecution; or (d) he has given evidence against any other person charged with the same offence: Provided that the court may, in its discretion, direct that specific evidence on the ground of the exception referred to in paragraph (c) of this subsection shall not be led if, in the opinion of the court, the prejudicial effect of such",
    "prev_chunk_id": 67,
    "next_chunk_id": 69,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part X – CHARACTER",
    "section": "57 – Bad character in criminal cases.",
    "section_number": "57",
    "section_title": "Bad character in criminal cases.",
    "section_path": "Part X – CHARACTER > 57",
    "chunk_index": 2,
    "chunk_id": 69,
    "text": "conduct of the defence is such as to involve imputations on the character of the complainant or of a witness for the prosecution; or (d) he has given evidence against any other person charged with the same offence: Provided that the court may, in its discretion, direct that specific evidence on the ground of the exception referred to in paragraph (c) of this subsection shall not be led if, in the opinion of the court, the prejudicial effect of such evidence upon the person accused will so outweigh the damage done by imputations on the character of the complainant or of any witness for the prosecution as to prevent a fair trial. (2) Notwithstanding the provisions of subsection (1) of this section, evidence of previous conviction for an offence may be given in a criminal trial after conviction of the accused person, for the purpose of affecting the sentence to be awarded by the court. [Act No. 10 of 1969, Sch.]",
    "prev_chunk_id": 68,
    "next_chunk_id": 70,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part X – CHARACTER",
    "section": "58 – Definition of \"character\".",
    "section_number": "58",
    "section_title": "Definition of \"character\".",
    "section_path": "Part X – CHARACTER > 58",
    "chunk_index": 1,
    "chunk_id": 70,
    "text": "In sections 55, 56 and 57 of this Act the word \"character\" includes both reputation and disposition; but, except as provided in section 57, evidence may be given only of general reputation and general disposition, and not of particular acts by which reputation or disposition were shown. Chapter III PROOF",
    "prev_chunk_id": 69,
    "next_chunk_id": 71,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "59 – Facts judicially noticed.",
    "section_number": "59",
    "section_title": "Facts judicially noticed.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 59",
    "chunk_index": 1,
    "chunk_id": 71,
    "text": "No fact of which the court shall take judicial notice need be proved. 59A. Agreement on facts not in issue. (1) If an accused person has appointed an advocate and, at any stage during the proceedings, it appears to a prosecutor that a particular fact or facts which must be proved in a charge against an accused person is or are not in issue or shall not be placed in issue in criminal proceedings against the accused person, the prosecutor may, forward or hand a notice to the accused person and his advocate setting out that fact or those facts and stating that such fact or facts shall be deemed to have been proved at the proceedings unless notice is given that any such fact shall be placed in issue. (2) The notice by the prosecutor under subsection (1) shall be sent by registered mail or handed to the accused and his advocate personally at least fourteen days before the commencement of the criminal proceedings or the date set for the continuation of such proceedings, or within such shorter period as may be approved by the court or agreed upon by the accused person or his advocate and the prosecutor. (3) If any fact mentioned in the notice under subsection (2) is intended to be placed in issue at the",
    "prev_chunk_id": 70,
    "next_chunk_id": 72,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "59 – Facts judicially noticed.",
    "section_number": "59",
    "section_title": "Facts judicially noticed.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 59",
    "chunk_index": 2,
    "chunk_id": 72,
    "text": "be sent by registered mail or handed to the accused and his advocate personally at least fourteen days before the commencement of the criminal proceedings or the date set for the continuation of such proceedings, or within such shorter period as may be approved by the court or agreed upon by the accused person or his advocate and the prosecutor. (3) If any fact mentioned in the notice under subsection (2) is intended to be placed in issue at the proceedings, the accused person and his advocate shall at least five days before the commencement or the date set for the continuation of the proceedings, or within such shorter period as may be approved by the court or agreed upon with the prosecutor, deliver a notice in writing to that effect to the registrar or the clerk of the court, as the case may be, or orally notify the registrar or the clerk of the court to that effect, in which case the registrar or the clerk of the court shall record such notice. (4) If, after receipt of the notice from the prosecutor under subsection (1), any fact mentioned in that notice is not placed in issue as under subsection (3), the court may deem such fact or facts, subject to subsections (5) and (6), to have been sufficiently",
    "prev_chunk_id": 71,
    "next_chunk_id": 73,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "59 – Facts judicially noticed.",
    "section_number": "59",
    "section_title": "Facts judicially noticed.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 59",
    "chunk_index": 3,
    "chunk_id": 73,
    "text": "as the case may be, or orally notify the registrar or the clerk of the court to that effect, in which case the registrar or the clerk of the court shall record such notice. (4) If, after receipt of the notice from the prosecutor under subsection (1), any fact mentioned in that notice is not placed in issue as under subsection (3), the court may deem such fact or facts, subject to subsections (5) and (6), to have been sufficiently proved at the proceedings concerned. (5) If a notice was forwarded or handed over by a prosecutor under subsection (1), the prosecutor shall notify the court at the commencement of the proceedings of such fact and of the response thereto, if any, and the court shall thereupon institute an investigation into those facts which are not disputed and enquire from the accused person whether he confirms the information given by the prosecutor, and whether he understands his rights and the implications of the procedure and where the advocate of the accused person replies to any question by the court under this section, the accused person shall be required by the court to declare whether he confirms such reply or not. (6) The court may on its own motion or at the request of the accused person order oral evidence to",
    "prev_chunk_id": 72,
    "next_chunk_id": 74,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "59 – Facts judicially noticed.",
    "section_number": "59",
    "section_title": "Facts judicially noticed.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 59",
    "chunk_index": 4,
    "chunk_id": 74,
    "text": "the accused person whether he confirms the information given by the prosecutor, and whether he understands his rights and the implications of the procedure and where the advocate of the accused person replies to any question by the court under this section, the accused person shall be required by the court to declare whether he confirms such reply or not. (6) The court may on its own motion or at the request of the accused person order oral evidence to be adduced regarding any fact contemplated in subsection (4). [Act No. 19 of 2014, s. 29.]",
    "prev_chunk_id": 73,
    "next_chunk_id": 75,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "60 – Facts of which court shall take judicial notice.",
    "section_number": "60",
    "section_title": "Facts of which court shall take judicial notice.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 60",
    "chunk_index": 1,
    "chunk_id": 75,
    "text": "(1) The courts shall take judicial notice of the following facts— (a) all written laws, and all laws, rules and principles, written or unwritten, having the force of law, whether in force or having such force as aforesaid before, at or after the commencement of this Act, in any part of Kenya; (b) the general course of proceedings and privileges of Parliament, but not the transactions in their journals; (c) Articles of War for the Kenya Military Forces; (d) deleted by L.N. 22 of 1965; (e) the public seal of Kenya; the seals of all the courts of Kenya; and all seals which any person is authorized by any written law to use; (f) the accession to office, names, titles, functions and signatures of public officers, if the fact of their appointment is notified in the Gazette; (g) the existence, title and national flag of every State and Sovereign recognized by the Government; (h) natural and artificial divisions of time, and geographical divisions of the world, and public holidays; (i) the extent of the territories comprised in the Commonwealth; (j) the commencement, continuance and termination of hostilities between Kenya and any other State or body of persons; (k) the names of the members and officers of the court and of their deputies, subordinate officers and assistants, and of all officers",
    "prev_chunk_id": 74,
    "next_chunk_id": 76,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "60 – Facts of which court shall take judicial notice.",
    "section_number": "60",
    "section_title": "Facts of which court shall take judicial notice.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 60",
    "chunk_index": 2,
    "chunk_id": 76,
    "text": "title and national flag of every State and Sovereign recognized by the Government; (h) natural and artificial divisions of time, and geographical divisions of the world, and public holidays; (i) the extent of the territories comprised in the Commonwealth; (j) the commencement, continuance and termination of hostilities between Kenya and any other State or body of persons; (k) the names of the members and officers of the court and of their deputies, subordinate officers and assistants, and of all officers acting in execution of its process, and also of all advocates and other persons authorized by law to appear or act before it; (l) the rule of the road on land or at sea or in the air; (m) the ordinary course of nature; (n) the meaning of English words; (o) all matters of general or local notoriety; (p) all other matters of which it is directed by any written law to take judicial notice. (2) In all cases within subsection (1) of this section, and also on all matters of public history, literature, science or art, the court may resort for its aid to appropriate books or documents of reference. (3) If the court is called upon by any person to take judicial notice of any fact, it may refuse to do so unless and until such person produces",
    "prev_chunk_id": 75,
    "next_chunk_id": 77,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "60 – Facts of which court shall take judicial notice.",
    "section_number": "60",
    "section_title": "Facts of which court shall take judicial notice.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 60",
    "chunk_index": 3,
    "chunk_id": 77,
    "text": "other matters of which it is directed by any written law to take judicial notice. (2) In all cases within subsection (1) of this section, and also on all matters of public history, literature, science or art, the court may resort for its aid to appropriate books or documents of reference. (3) If the court is called upon by any person to take judicial notice of any fact, it may refuse to do so unless and until such person produces any such book or document as it considers necessary to enable it to do so. [L.N. 22 of 1965.]",
    "prev_chunk_id": 76,
    "next_chunk_id": 78,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – FACTS REQUIRING NO PROOF",
    "section": "61 – Facts admitted in civil proceedings.",
    "section_number": "61",
    "section_title": "Facts admitted in civil proceedings.",
    "section_path": "Part I – FACTS REQUIRING NO PROOF > 61",
    "chunk_index": 1,
    "chunk_id": 78,
    "text": "No fact need be proved in any civil proceeding which the parties thereto or their agents agree to admit at the hearing, or which before the hearing they agree, by writing under their hands, to admit, or which by any rule of pleading in force at the time they are deemed to have admitted by their pleadings: Provided that the court may in its discretion require the facts admitted to be proved otherwise than by such admissions.",
    "prev_chunk_id": 77,
    "next_chunk_id": 79,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ORAL EVIDENCE",
    "section": "62 – Oral evidence.",
    "section_number": "62",
    "section_title": "Oral evidence.",
    "section_path": "Part II – ORAL EVIDENCE > 62",
    "chunk_index": 1,
    "chunk_id": 79,
    "text": "All facts, except the contents of documents, may be proved by oral evidence.",
    "prev_chunk_id": 78,
    "next_chunk_id": 80,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ORAL EVIDENCE",
    "section": "63 – Oral evidence must be direct.",
    "section_number": "63",
    "section_title": "Oral evidence must be direct.",
    "section_path": "Part II – ORAL EVIDENCE > 63",
    "chunk_index": 1,
    "chunk_id": 80,
    "text": "(1) Oral evidence must in all cases be direct evidence. (2) For the purposes of subsection (1) of this section, \"direct evidence\" means— (a) with reference to a fact which could be seen, the evidence of a witness who says he saw it; (b) with reference to a fact which could be heard, the evidence of a witness who says he heard it; (c) with reference to a fact which could be perceived by any other sense or in any other manner, the evidence of a witness who says he perceived it by that sense or in that manner; (d) with reference to an opinion or to the grounds on which that opinion is held, the evidence of the person who holds that opinion or, as the case maybe, who holds it on those grounds: Provided that the opinion of an expert expressed in any treatise commonly offered for sale, and the grounds on which such opinion is held, may be proved by the production of such treatise if the author is dead or cannot be found, or has become incapable of giving evidence, or cannot be called as a witness without an amount of delay or expense which the court regards as unreasonable. (3) If oral evidence refers to the existence or condition of any material thing, other than",
    "prev_chunk_id": 79,
    "next_chunk_id": 81,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ORAL EVIDENCE",
    "section": "63 – Oral evidence must be direct.",
    "section_number": "63",
    "section_title": "Oral evidence must be direct.",
    "section_path": "Part II – ORAL EVIDENCE > 63",
    "chunk_index": 2,
    "chunk_id": 81,
    "text": "an expert expressed in any treatise commonly offered for sale, and the grounds on which such opinion is held, may be proved by the production of such treatise if the author is dead or cannot be found, or has become incapable of giving evidence, or cannot be called as a witness without an amount of delay or expense which the court regards as unreasonable. (3) If oral evidence refers to the existence or condition of any material thing, other than a document, the court may, if it thinks fit, require the production of such material thing for its inspection. 63A. Teleconferencing and video conferencing (1) A court may receive oral evidence through teleconferencing and video conferencing. (2) The Chief Justice may develop regulations to govern the use of teleconferencing and video conferencing. [Act No. 19 of 2014, s. 30.]",
    "prev_chunk_id": 80,
    "next_chunk_id": 82,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "64 – Proof of contents of documents.",
    "section_number": "64",
    "section_title": "Proof of contents of documents.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 64",
    "chunk_index": 1,
    "chunk_id": 82,
    "text": "The contents of documents may be proved either by primary or by secondary evidence.",
    "prev_chunk_id": 81,
    "next_chunk_id": 83,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 1,
    "chunk_id": 83,
    "text": "(1) Primary evidence means the document itself produced for the inspection of the court. (2) Where a document is executed in several parts, each part is primary evidence of the document. (3) Where a document is executed in counterpart each counterpart being executed by one or some of the parties only, each counterpart is primary evidence as against the parties executing it. (4) Where a number of documents are all made by one uniform process, as in the case of printing, lithography or photography, each is primary evidence of the contents of the rest; but where they are all copies of a common original they are not primary evidence of the contents of the original. (5) Notwithstanding anything contained in any other law for the time being in force— (a) a micro-film of a document or the reproduction of the image or images embodied in such micro-film; or (b) a facsimile copy of a document or an image of a document derived or captured from the original document; or (c) a statement contained in a document and included in printed material produced by a computer (hereinafter referred to as a \"computer print-out\"), shall, if the conditions stipulated in subsection (6) of this section are satisfied, be deemed to also be a document for the purposes of this Act and shall",
    "prev_chunk_id": 82,
    "next_chunk_id": 84,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 2,
    "chunk_id": 84,
    "text": "image or images embodied in such micro-film; or (b) a facsimile copy of a document or an image of a document derived or captured from the original document; or (c) a statement contained in a document and included in printed material produced by a computer (hereinafter referred to as a \"computer print-out\"), shall, if the conditions stipulated in subsection (6) of this section are satisfied, be deemed to also be a document for the purposes of this Act and shall be admissible in any proceedings without further proof of production of the original, as evidence of any contents of the original or of any fact stated therein of which direct evidence would be admissible. (6) The conditions referred to in subsection (5) in respect of a computer print- out shall be the following, namely— (a) the computer print-out containing the statement must have been produced by the computer during the period in which the computer was regularly used to store or process information for the purposes of any activities regularly carried on over that period by a person having lawful control over the use of the computer; (b) the computer was, during the period to which the proceedings relate, used in the ordinary course of business regularly and was supplied with information of the kind contained in the document or",
    "prev_chunk_id": 83,
    "next_chunk_id": 85,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 3,
    "chunk_id": 85,
    "text": "statement must have been produced by the computer during the period in which the computer was regularly used to store or process information for the purposes of any activities regularly carried on over that period by a person having lawful control over the use of the computer; (b) the computer was, during the period to which the proceedings relate, used in the ordinary course of business regularly and was supplied with information of the kind contained in the document or of the kind from which the information so contained is derived; (c) the computer was operating properly or, if not, that any respect in which it was not operating properly was not such as to affect the production of the document or the accuracy of its content; (d) the information contained in the statement reproduces or is derived from information supplied to the computer in the ordinary course of business. (7) Where, over any period, the function of storing or processing information for the purposes of any activities regularly carried on over that period mentioned in paragraph (a) of subsection (6) was regularly performed by computers, whether— (a) by a combination of computers operating over that period; or (b) by different computers operating in succession over that period; or (c) by different combinations of computers operating in succession over that",
    "prev_chunk_id": 84,
    "next_chunk_id": 86,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 4,
    "chunk_id": 86,
    "text": "supplied to the computer in the ordinary course of business. (7) Where, over any period, the function of storing or processing information for the purposes of any activities regularly carried on over that period mentioned in paragraph (a) of subsection (6) was regularly performed by computers, whether— (a) by a combination of computers operating over that period; or (b) by different computers operating in succession over that period; or (c) by different combinations of computers operating in succession over that period; or (d) in any other manner involving the successive operation over that period, in whatever order, of one or more computers and one or more combination of computers, all computers used for that purpose during that period shall be treated for the purposes of this section as constituting a single computer; and references in this section to a computer shall be construed accordingly. (8) In any proceedings under this Act where it is desired to give a computer print-out or statement in evidence by virtue of this section, a certificate doing any of the following things, that is to say— (a) identifying a document containing a print-out or statement and describing the manner in which it was produced; (b) giving such particulars of any device involved in the production of that document as may be appropriate for the purpose",
    "prev_chunk_id": 85,
    "next_chunk_id": 87,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 5,
    "chunk_id": 87,
    "text": "shall be construed accordingly. (8) In any proceedings under this Act where it is desired to give a computer print-out or statement in evidence by virtue of this section, a certificate doing any of the following things, that is to say— (a) identifying a document containing a print-out or statement and describing the manner in which it was produced; (b) giving such particulars of any device involved in the production of that document as may be appropriate for the purpose of showing that the document was produced by a computer; (c) dealing with any of the matters to which conditions mentioned in the subsection (6) relate, which is certified by a person holding a responsible position in relation to the operation of the relevant device or the management of the activities to which the document relates in the ordinary course of business shall be admissible in evidence. (9) For the purposes of this section— (a) information shall be deemed to be supplied to a computer if it is supplied in any appropriate form and whether it is so supplied directly or (with or without human intervention) by means of any appropriate equipment; (b) information shall be deemed to be supplied in the ordinary course of business if the information was obtained, received or supplied with a view to it being",
    "prev_chunk_id": 86,
    "next_chunk_id": 88,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "65 – Primary evidence.",
    "section_number": "65",
    "section_title": "Primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 65",
    "chunk_index": 6,
    "chunk_id": 88,
    "text": "of business shall be admissible in evidence. (9) For the purposes of this section— (a) information shall be deemed to be supplied to a computer if it is supplied in any appropriate form and whether it is so supplied directly or (with or without human intervention) by means of any appropriate equipment; (b) information shall be deemed to be supplied in the ordinary course of business if the information was obtained, received or supplied with a view to it being processed, stored or retrieved in the ordinary course of business; and (c) a document shall be deemed to have been produced by a computer whether it was produced by it directly or (with or without human intervention) by means of any other appropriate equipment connected to such computer. [Act No. 9 of 2000, s. 65.]",
    "prev_chunk_id": 87,
    "next_chunk_id": 89,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "66 – Secondary evidence.",
    "section_number": "66",
    "section_title": "Secondary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 66",
    "chunk_index": 1,
    "chunk_id": 89,
    "text": "Secondary evidence includes— (a) certified copies given under the provisions hereinafter contained; (b) copies made from the original by mechanical processes which in themselves ensure the accuracy of the copy, and copies compared with such copies; (c) copies made from or compared with the original; (d) counterparts of documents as against the parties who did not execute them; (e) oral accounts of the contents of a document given by some person who has himself seen it.",
    "prev_chunk_id": 88,
    "next_chunk_id": 90,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "67 – Proof of documents by primary evidence.",
    "section_number": "67",
    "section_title": "Proof of documents by primary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 67",
    "chunk_index": 1,
    "chunk_id": 90,
    "text": "Documents must be proved by primary evidence except in the cases hereinafter mentioned.",
    "prev_chunk_id": 89,
    "next_chunk_id": 91,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "68 – Proof of documents by secondary evidence.",
    "section_number": "68",
    "section_title": "Proof of documents by secondary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 68",
    "chunk_index": 1,
    "chunk_id": 91,
    "text": "(1) Secondary evidence may be given of the existence, condition or contents of a document in the following cases— (a) when the original is shown or appears to be in the possession or power of— (i) the person against whom the document is sought to be proved; or (ii) a person out of reach of, or not subject to, the process of the court; or (iii) any person legally bound to produce it, and when, after the notice required by section 69 of this Act has been given, such person refuses or fails to produce it; (b) when the existence, condition or contents of the original are proved to be admitted in writing by the person against whom it is proved, or by his representative in interest; (c) when the original has been destroyed or lost, or when the party offering evidence of its contents cannot, for any other reason not arising from his own default or neglect, produce it in a reasonable time; (d) when the original is of such a nature as not to be easily movable; (e) when the original is a public document within the meaning of section 79 of this Act; (f) when the original is a document of which a certified copy is permitted by this Act or by any written law to be",
    "prev_chunk_id": 90,
    "next_chunk_id": 92,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "68 – Proof of documents by secondary evidence.",
    "section_number": "68",
    "section_title": "Proof of documents by secondary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 68",
    "chunk_index": 2,
    "chunk_id": 92,
    "text": "offering evidence of its contents cannot, for any other reason not arising from his own default or neglect, produce it in a reasonable time; (d) when the original is of such a nature as not to be easily movable; (e) when the original is a public document within the meaning of section 79 of this Act; (f) when the original is a document of which a certified copy is permitted by this Act or by any written law to be given in evidence; (g) when the original consists of numerous accounts or other documents which cannot conveniently be examined in court, and the fact to be proved is the general result of the whole collection. (2) (a) In the cases mentioned in paragraphs (a), (c) and (d) of subsection (1), any secondary evidence of the contents of the document is admissible. (b) In the case mentioned in paragraph (b) of subsection (1) of this section, the written admission is admissible. (c) In the cases mentioned in paragraphs (e) and (f) of subsection (1) of this section, a certified copy of the document, but no other kind of secondary evidence, is admissible. (d) In the case mentioned in paragraph (g) of subsection (1) of this section, evidence may be given as to the general result of the accounts or documents by",
    "prev_chunk_id": 91,
    "next_chunk_id": 93,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "68 – Proof of documents by secondary evidence.",
    "section_number": "68",
    "section_title": "Proof of documents by secondary evidence.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 68",
    "chunk_index": 3,
    "chunk_id": 93,
    "text": "admissible. (b) In the case mentioned in paragraph (b) of subsection (1) of this section, the written admission is admissible. (c) In the cases mentioned in paragraphs (e) and (f) of subsection (1) of this section, a certified copy of the document, but no other kind of secondary evidence, is admissible. (d) In the case mentioned in paragraph (g) of subsection (1) of this section, evidence may be given as to the general result of the accounts or documents by any person who has examined them, and who is skilled in the examination of such accounts or documents.",
    "prev_chunk_id": 92,
    "next_chunk_id": 94,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "69 – Notice to produce a document.",
    "section_number": "69",
    "section_title": "Notice to produce a document.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 69",
    "chunk_index": 1,
    "chunk_id": 94,
    "text": "Secondary evidence of the contents of the documents referred to in section 68(1)(a) of this Act shall not be given unless the party proposing to give such secondary evidence has previously given to the party in whose possession or power the document is, or to his advocate, such a notice to produce it as is required by law or such notice as the court considers reasonable in the circumstances of the case: Provided that such notice shall not be required in order to render secondary evidence admissible in any of the following cases— (i) when the document to be proved is itself a notice; (ii) when from the nature of the case, the adverse party must know that he will be required to produce it; (iii) when it appears or is proved that the adverse party has obtained possession of the original by fraud or force; (iv) when the adverse party or his agent has the original in court; (v) when the adverse party or his agent has admitted the loss of the document; (vi) when the person in possession of the document is out of reach of, or not subject to, the process of the court; (vii) in any other case in which the court thinks fit to dispense with the requirement.",
    "prev_chunk_id": 93,
    "next_chunk_id": 95,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "70 – Proof of allegation that persons signed or wrote a document.",
    "section_number": "70",
    "section_title": "Proof of allegation that persons signed or wrote a document.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 70",
    "chunk_index": 1,
    "chunk_id": 95,
    "text": "If a document is alleged to be signed or to have been written wholly or in part by any person, the signature or the handwriting of so much of the document as is alleged to be in that person’s handwriting must be proved to be in his handwriting.",
    "prev_chunk_id": 94,
    "next_chunk_id": 96,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "71 – Proof of execution of document required by law to be attested.",
    "section_number": "71",
    "section_title": "Proof of execution of document required by law to be attested.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 71",
    "chunk_index": 1,
    "chunk_id": 96,
    "text": "If a document is required by law to be attested it shall not be used as evidence until one attesting witness at least has been called for the purpose of proving its execution, if there is an attesting witness alive and subject to the process of the court and capable of giving evidence: Provided that it shall not be necessary to call an attesting witness in proof of the execution of any document which has been registered in accordance with the provisions of any written law, unless its execution by the person by whom it purports to have been executed is specifically denied.",
    "prev_chunk_id": 95,
    "next_chunk_id": 97,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "72 – Proof where no attesting witness found.",
    "section_number": "72",
    "section_title": "Proof where no attesting witness found.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 72",
    "chunk_index": 1,
    "chunk_id": 97,
    "text": "Where evidence is required of a document which is required by law to be attested, and none of the attesting witnesses can be found, or where such witness is incapable of giving evidence or cannot be called as a witness without an amount of delay or expense which the court regards as unreasonable, it must be proved that the attestation of one attesting witness at least is in his handwriting, and that the signature of the person executing the document is in the handwriting of that person.",
    "prev_chunk_id": 96,
    "next_chunk_id": 98,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "73 – Admission of execution of attested document.",
    "section_number": "73",
    "section_title": "Admission of execution of attested document.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 73",
    "chunk_index": 1,
    "chunk_id": 98,
    "text": "The admission of a party to an attested document, of its execution by himself, shall be sufficient proof of its execution as against him though it be a document required by law to be attested.",
    "prev_chunk_id": 97,
    "next_chunk_id": 99,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "74 – Proof where attesting witness denies execution.",
    "section_number": "74",
    "section_title": "Proof where attesting witness denies execution.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 74",
    "chunk_index": 1,
    "chunk_id": 99,
    "text": "If the attesting witness denies or does not recollect the execution of a document, its execution may be proved by other evidence.",
    "prev_chunk_id": 98,
    "next_chunk_id": 100,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "75 – Proof of document not required to be attested.",
    "section_number": "75",
    "section_title": "Proof of document not required to be attested.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 75",
    "chunk_index": 1,
    "chunk_id": 100,
    "text": "An attested document not required by law to be attested may be proved as if it was unattested.",
    "prev_chunk_id": 99,
    "next_chunk_id": 101,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "76 – Comparison of signatures, seals, etc.",
    "section_number": "76",
    "section_title": "Comparison of signatures, seals, etc.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 76",
    "chunk_index": 1,
    "chunk_id": 101,
    "text": "(1) In order to ascertain whether a signature, writing or seal is that of the person by whom it purports to have been written or made, any signature, writing or seal, admitted or proved to the satisfaction of the court to have been written or made by that person, may be compared by a witness or by the court with the one which is to be proved, although that signature, writing or seal has not been produced or proved for any other purpose. (2) The court may direct any person present in court to write any words or figures for the purpose of enabling the court to compare the words or figures so written with any words or figures alleged to have been written by such person. (3) This section applies with necessary modifications to finger impressions.",
    "prev_chunk_id": 100,
    "next_chunk_id": 102,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "77 – Reports by Government analysts and geologists.",
    "section_number": "77",
    "section_title": "Reports by Government analysts and geologists.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 77",
    "chunk_index": 1,
    "chunk_id": 102,
    "text": "(1) In criminal proceedings any document purporting to be a report under the hand of a Government analyst, medical practitioner or of any ballistics expert, document examiner or geologist upon any person, matter or thing submitted to him for examination or analysis may be used in evidence. (2) The court may presume that the signature to any such document is genuine and that the person signing it held the office and qualifications which he professed to hold at the time when he signed it. (3) When any report is so used the court may, if it thinks fit, summon the analyst, ballistics expert, document examiner, medical practitioner, or geologist, as the case may be, and examine him as to the subject matter thereof. [Act No. 14 of 1991, Sch.]",
    "prev_chunk_id": 101,
    "next_chunk_id": 103,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "78 – Photographic evidence—admissibility of certificate.",
    "section_number": "78",
    "section_title": "Photographic evidence—admissibility of certificate.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 78",
    "chunk_index": 1,
    "chunk_id": 103,
    "text": "(1) In criminal proceedings a certificate in the form in the First Schedule to this Act, given under the hand of an officer appointed by order of the Director of Public Prosecutions for the purpose, who shall have prepared a photographic print or a photographic enlargement from exposed film or an electronic and digital medium submitted to him, shall be admissible, together with any photographic prints, photographic enlargements and any other annex referred to therein, and shall be evidence of all facts stated therein. (2) The court may presume that the signature to any such certificate is genuine. (3) When a certificate is received in evidence under this section the court may, if it thinks fit, summon and examine the person who gave it. [LN 22 of 1965, Act No. 12 of 2012, Sch., Act No. 19 of 2023, Sch.] 78A. Admissibility of electronic and digital evidence. (1) In any legal proceedings, electronic messages and digital material shall be admissible as evidence. (2) The court shall not deny admissibility of evidence under subsection (1) only on the ground that it is not in its original form. (3) In estimating the weight, if any, to be attached to electronic and digital evidence, under subsection (1), regard shall be had to— (a) the reliability of the manner in which the electronic and",
    "prev_chunk_id": 102,
    "next_chunk_id": 104,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "78 – Photographic evidence—admissibility of certificate.",
    "section_number": "78",
    "section_title": "Photographic evidence—admissibility of certificate.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 78",
    "chunk_index": 2,
    "chunk_id": 104,
    "text": "78A. Admissibility of electronic and digital evidence. (1) In any legal proceedings, electronic messages and digital material shall be admissible as evidence. (2) The court shall not deny admissibility of evidence under subsection (1) only on the ground that it is not in its original form. (3) In estimating the weight, if any, to be attached to electronic and digital evidence, under subsection (1), regard shall be had to— (a) the reliability of the manner in which the electronic and digital evidence was generated, stored or communicated; (b) the reliability of the manner in which the integrity of the electronic and digital evidence was maintained; (c) the manner in which the originator of the electronic and digital evidence was identified; and (d) any other relevant factor. (4) Electronic and digital evidence generated by a person in the ordinary course of business, or a copy or printout of or an extract from the electronic and digital evidence certified to be correct by a person in the service of such person, is on its mere production in any civil, criminal, administrative or disciplinary proceedings under any law, the rules of a self-regulatory organization or any other law or the common law, admissible in evidence against any person and rebuttable proof of the facts contained in such record, copy, printout or extract. [Act",
    "prev_chunk_id": 103,
    "next_chunk_id": 105,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – DOCUMENTARY EVIDENCE",
    "section": "78 – Photographic evidence—admissibility of certificate.",
    "section_number": "78",
    "section_title": "Photographic evidence—admissibility of certificate.",
    "section_path": "Part III – DOCUMENTARY EVIDENCE > 78",
    "chunk_index": 3,
    "chunk_id": 105,
    "text": "business, or a copy or printout of or an extract from the electronic and digital evidence certified to be correct by a person in the service of such person, is on its mere production in any civil, criminal, administrative or disciplinary proceedings under any law, the rules of a self-regulatory organization or any other law or the common law, admissible in evidence against any person and rebuttable proof of the facts contained in such record, copy, printout or extract. [Act No. 19 of 2014, s. 31.]",
    "prev_chunk_id": 104,
    "next_chunk_id": 106,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "79 – Distinction between public and private documents.",
    "section_number": "79",
    "section_title": "Distinction between public and private documents.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 79",
    "chunk_index": 1,
    "chunk_id": 106,
    "text": "(1) The following documents are public documents— (a) documents forming the acts or records of the acts— (i) of the sovereign authority; or (ii) of official bodies and tribunals; or (iii) of public officers, legislative, judicial or executive, whether of Kenya or of any other country; (b) public records kept in Kenya of private documents. (2) All documents other than public documents are private.",
    "prev_chunk_id": 105,
    "next_chunk_id": 107,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "80 – Certified copies of public documents.",
    "section_number": "80",
    "section_title": "Certified copies of public documents.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 80",
    "chunk_index": 1,
    "chunk_id": 107,
    "text": "(1) Every public officer having the custody of a public document which any person has a right to inspect shall give that person on demand a copy of it on payment of the legal fees therefor, together with a certificate written at the foot of such copy that it is a true copy of such document or part thereof, as the case may be, and such certificate shall be dated and subscribed by such officer with his name and his official title, and shall be sealed whenever such officer is authorized by law to make use of a seal, and such copies so certified shall be called certified copies. (2) Any officer who by the ordinary course of official duty is authorized to deliver copies of public documents shall be deemed to have the custody of such documents within the meaning of this section.",
    "prev_chunk_id": 106,
    "next_chunk_id": 108,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "81 – Proof by certified copies.",
    "section_number": "81",
    "section_title": "Proof by certified copies.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 81",
    "chunk_index": 1,
    "chunk_id": 108,
    "text": "Certified copies of public documents may be produced in proof of the contents of the documents or parts of the documents of which they purport to be copies.",
    "prev_chunk_id": 107,
    "next_chunk_id": 109,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "82 – Proof of certain public documents.",
    "section_number": "82",
    "section_title": "Proof of certain public documents.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 82",
    "chunk_index": 1,
    "chunk_id": 109,
    "text": "Without prejudice to any other mode of proof, prima facie evidence of the following public documents may be given in the manner hereinafter shown, that is to say— (a) deleted by L.N. 22 of 1965; (b) deleted by L.N. 22 of 1965; (c) proceedings of the East Africa Central Legislative Assembly, or of the legislature of any country in the Commonwealth, by the journals thereof, or, in the case of such Assembly or legislature as aforesaid, by copies of such journals purporting to be printed or published by or under the authority of such Assembly or legislature, or by or under the authority of the government of any such country; (d) acts, orders or notifications of the executive Government of Kenya, the High Commission or the Organization or any service, thereof, or any local authority, or of a ministry or department of any of the foregoing— (i) by the records of the service, ministry or department certified by the head of the service or department, or, in the case of a ministry, by the permanent secretary thereof; or (ii) by any document purporting to be printed or published by the Government Printer; (e) proceedings of any local authority, or of any corporate body created by Act or Ordinance, by a copy of the proceedings certified by the person having the",
    "prev_chunk_id": 108,
    "next_chunk_id": 110,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "82 – Proof of certain public documents.",
    "section_number": "82",
    "section_title": "Proof of certain public documents.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 82",
    "chunk_index": 2,
    "chunk_id": 110,
    "text": "department of any of the foregoing— (i) by the records of the service, ministry or department certified by the head of the service or department, or, in the case of a ministry, by the permanent secretary thereof; or (ii) by any document purporting to be printed or published by the Government Printer; (e) proceedings of any local authority, or of any corporate body created by Act or Ordinance, by a copy of the proceedings certified by the person having the lawful custody of the original thereof, or by a public document purporting to be printed or published by or by the authority of such authority or corporate body; (f) proclamations, treaties and other acts of State of any foreign country or of any part of the Commonwealth, and judgments, decrees, orders and other judicial proceedings of any court of justice in such country or part, and all affidavits, pleadings and other legal documents filed or deposited in any such court, by the procedure required by section 7 of the Evidence Act, 1851, of the United Kingdom; (g) public documents of any other class in a foreign country, by the original, or by a copy thereof bearing a certificate under the seal of a notary public or of a Kenya consular officer or diplomatic agent that the copy is duly certified",
    "prev_chunk_id": 109,
    "next_chunk_id": 111,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – PUBLIC DOCUMENTS",
    "section": "82 – Proof of certain public documents.",
    "section_number": "82",
    "section_title": "Proof of certain public documents.",
    "section_path": "Part IV – PUBLIC DOCUMENTS > 82",
    "chunk_index": 3,
    "chunk_id": 111,
    "text": "in such country or part, and all affidavits, pleadings and other legal documents filed or deposited in any such court, by the procedure required by section 7 of the Evidence Act, 1851, of the United Kingdom; (g) public documents of any other class in a foreign country, by the original, or by a copy thereof bearing a certificate under the seal of a notary public or of a Kenya consular officer or diplomatic agent that the copy is duly certified by the officer having the lawful custody of the original thereof, and upon proof of the character of the document according to the law of the foreign country. [L.N. 22 of 1965.]",
    "prev_chunk_id": 110,
    "next_chunk_id": 112,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "83 – Certified documents.",
    "section_number": "83",
    "section_title": "Certified documents.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 83",
    "chunk_index": 1,
    "chunk_id": 112,
    "text": "(1) The court shall presume to be genuine every document purporting to be a certificate, certified copy or other document which is— (a) declared by law to be admissible as evidence of any particular fact; and (b) substantially in the form, and purporting to be executed in the manner, directed by law in that behalf; and (c) purporting to be duly certified by a public officer. (2) The court shall also presume that any officer by whom any such document purports to be signed or certified held, when he signed it, the official character which he claims in such document.",
    "prev_chunk_id": 111,
    "next_chunk_id": 113,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "84 – Records of evidence.",
    "section_number": "84",
    "section_title": "Records of evidence.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 84",
    "chunk_index": 1,
    "chunk_id": 113,
    "text": "Whenever any document is produced before any court, purporting to be a record or memorandum of any evidence given in a judicial proceeding or before any officer authorized by law to take such evidence, and purporting to be signed by a judge or magistrate or any such officer as aforesaid, the court shall presume— (a) that the document is genuine; (b) that any statements as to the circumstances in which it was taken, purporting to be made by the person signing it, are true; and (c) that such evidence was duly taken.",
    "prev_chunk_id": 112,
    "next_chunk_id": 114,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "85 – Gazette, etc., to be prima facie evidence.",
    "section_number": "85",
    "section_title": "Gazette, etc., to be prima facie evidence.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 85",
    "chunk_index": 1,
    "chunk_id": 114,
    "text": "The production of a copy of any written law, or of a copy of the Gazette containing any written law or any notice purporting to be made in pursuance of a written law, where such law or notice (as the case may be) purports to be printed by the Government Printer, shall be prima facie evidence in all courts and for all purposes whatsoever of the due making and tenor of such written law or notice.",
    "prev_chunk_id": 113,
    "next_chunk_id": 115,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "86 – Gazettes, newspapers and documents produced from proper custody.",
    "section_number": "86",
    "section_title": "Gazettes, newspapers and documents produced from proper custody.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 86",
    "chunk_index": 1,
    "chunk_id": 115,
    "text": "(1) The court shall presume the genuineness of every document purporting to be— (a) the London Gazette, the Edinburgh Gazette, or the official Gazette of any country in the Commonwealth; (b) a newspaper or journal; (c) a document directed by any law to be kept by any person, if such document is kept substantially in the form required by law and is produced from proper custody. (2) Documents are said to be in proper custody if they are in the place in which and under the care of the person with whom they would naturally be; but no custody is improper if it is proved to have had a legitimate origin, or if the circumstances of the particular case are such as to render such an origin probable.",
    "prev_chunk_id": 114,
    "next_chunk_id": 116,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "87 – Publications generally.",
    "section_number": "87",
    "section_title": "Publications generally.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 87",
    "chunk_index": 1,
    "chunk_id": 116,
    "text": "Where any publication or part thereof indicates or purports to indicate the name of any person by or on behalf or under the sponsorship of whom, or the place at which or date on which, such publication or any part thereof was edited, printed or published or any part thereof was contributed, it shall, in any proceedings for an offence under any written law or for contempt of any court, be presumed, until the contrary is proved, that such publication or part thereof was edited, printed or published, or that such part thereof was contributed, by or on behalf or under the sponsorship of such person, or at such place or on such date, as the case may be.",
    "prev_chunk_id": 115,
    "next_chunk_id": 117,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "88 – Documents admissible in England.",
    "section_number": "88",
    "section_title": "Documents admissible in England.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 88",
    "chunk_index": 1,
    "chunk_id": 117,
    "text": "When any document is produced before any court, purporting to be a document which, by the law in force for the time being in England, would be admissible in proof of any particular in any Court of Justice in England, without proof of the seal or stamp or signature authenticating it, or of the judicial or official character claimed by the person by whom it purports to be signed— (a) the court shall presume that such seal, stamp or signature is genuine, and that the person signing it held, at the time when he signed it, the judicial or official character which he claims in such document; and (b) the document shall be admissible for the same purpose for which it would be admissible in England.",
    "prev_chunk_id": 116,
    "next_chunk_id": 118,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "89 – Maps or plans.",
    "section_number": "89",
    "section_title": "Maps or plans.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 89",
    "chunk_index": 1,
    "chunk_id": 118,
    "text": "(1) The court shall presume that maps or plans purporting to be made or published by the authority of the Government, or any department of the Government, of any country in the Commonwealth were so made or published and are accurate. (2) Maps or plans specially made for the purposes of any cause or other proceeding, civil or criminal, must be proved to be accurate.",
    "prev_chunk_id": 117,
    "next_chunk_id": 119,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "90 – Law and judicial reports.",
    "section_number": "90",
    "section_title": "Law and judicial reports.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 90",
    "chunk_index": 1,
    "chunk_id": 119,
    "text": "The court shall presume the genuineness of every book purporting to be printed or published under the authority of the Government of any country and to contain any of the laws of that country, and of every book purporting to contain reports of decisions of the courts of any country.",
    "prev_chunk_id": 118,
    "next_chunk_id": 120,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "91 – Powers of attorney.",
    "section_number": "91",
    "section_title": "Powers of attorney.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 91",
    "chunk_index": 1,
    "chunk_id": 120,
    "text": "The court shall presume that every document purporting to be a power of attorney, and to have been executed before and authenticated by a notary public or commissioner for oaths or any court, judge, magistrate, or Kenya consular officer or diplomatic agent, was so executed and authenticated. [L.N. 22 of 1965.]",
    "prev_chunk_id": 119,
    "next_chunk_id": 121,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "92 – Certified copies of foreign judicial records.",
    "section_number": "92",
    "section_title": "Certified copies of foreign judicial records.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 92",
    "chunk_index": 1,
    "chunk_id": 121,
    "text": "The court may presume that any document purporting to be a copy of a judgment or judicial record of any country not forming part of the Commonwealth is genuine and accurate, and that such judgment or record was pronounced or recorded by a court of competent jurisdiction, if the document purports to be certified in any manner which is certified by a Kenya consular officer or diplomatic representative in or for such country to be the manner commonly in use in that country for the certification of copies of judgments or judicial records. [L.N. 22 of 1965.]",
    "prev_chunk_id": 120,
    "next_chunk_id": 122,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "93 – Books, maps and charts.",
    "section_number": "93",
    "section_title": "Books, maps and charts.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 93",
    "chunk_index": 1,
    "chunk_id": 122,
    "text": "The court may presume that any book, to which it may refer for information on matters of public or general interest, and that any published map or chart, the statements of which are admissible facts and which is produced for its inspection, was written and published by the person and at the time and place by whom or at which it purports to have been written or published.",
    "prev_chunk_id": 121,
    "next_chunk_id": 123,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "94 – Telegraphic messages.",
    "section_number": "94",
    "section_title": "Telegraphic messages.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 94",
    "chunk_index": 1,
    "chunk_id": 123,
    "text": "The court may presume that a message forwarded from a telegraph office to the person to whom such message purports to be addressed, corresponds with a message delivered for transmission at the office from which the message purports to be sent; but the court shall not make any presumption as to the person by whom such message was delivered for transmission.",
    "prev_chunk_id": 122,
    "next_chunk_id": 124,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "95 – Presumption as to due execution, etc.",
    "section_number": "95",
    "section_title": "Presumption as to due execution, etc.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 95",
    "chunk_index": 1,
    "chunk_id": 124,
    "text": "The court shall presume that every document called for and not produced after notice to produce was attested, stamped and executed in the manner required by the law.",
    "prev_chunk_id": 123,
    "next_chunk_id": 125,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – PRESUMPTIONS AS TO DOCUMENTS",
    "section": "96 – Documents twenty years old.",
    "section_number": "96",
    "section_title": "Documents twenty years old.",
    "section_path": "Part V – PRESUMPTIONS AS TO DOCUMENTS > 96",
    "chunk_index": 1,
    "chunk_id": 125,
    "text": "(1) Where any document purporting or proved to be not less than twenty years old is produced from any custody which the court in the particular case considers proper, the court may presume that the signature and every other part of such document, which purports to be in the handwriting of any particular person, is in that person’s handwriting, and, in the case of a document executed or attested, that it was duly executed and attested by the persons by whom it purports to be executed and attested. (2) Documents are said to be in proper custody if they are in the place in which and under the care of the person with whom they would naturally be; but no custody is improper if it is proved to have had a legitimate origin, or if the circumstances of the particular case are such as to render such an origin probable.",
    "prev_chunk_id": 124,
    "next_chunk_id": 126,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "97 – Written contracts and grants.",
    "section_number": "97",
    "section_title": "Written contracts and grants.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 97",
    "chunk_index": 1,
    "chunk_id": 126,
    "text": "(1) When the terms of a contract, or of a grant, or of any other disposition of property, have been reduced to the form of a document, and in all cases in which any matter is required by law to be reduced to the form of a document, no evidence shall be given in proof of the terms of such contract, grant or other disposition of property, or of such matter, except the document itself, or secondary evidence of its contents in cases in which secondary evidence is admissible under the provisions of this Act. (2) Notwithstanding the provisions of subsection (1) of this section— (a) wills admitted to probate in Kenya may be proved by the probate; (b) when a public officer is required by law to be appointed in writing, and when it is shown that any particular person has acted as such officer, the writing by which he is appointed need not be proved. (3) Subsection (1) of this section applies equally to cases in which contracts, grants or dispositions of property referred to are contained in one document, and to cases in which they are contained in more documents than one. (4) Where there are more originals than one, one original only need be proved. (5) The statement, in any document whatever, of a fact other",
    "prev_chunk_id": 125,
    "next_chunk_id": 127,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "97 – Written contracts and grants.",
    "section_number": "97",
    "section_title": "Written contracts and grants.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 97",
    "chunk_index": 2,
    "chunk_id": 127,
    "text": "person has acted as such officer, the writing by which he is appointed need not be proved. (3) Subsection (1) of this section applies equally to cases in which contracts, grants or dispositions of property referred to are contained in one document, and to cases in which they are contained in more documents than one. (4) Where there are more originals than one, one original only need be proved. (5) The statement, in any document whatever, of a fact other than the facts referred to in subsection (1) of this section, shall not preclude the admission of oral evidence as to the same fact.",
    "prev_chunk_id": 126,
    "next_chunk_id": 128,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "98 – Evidence of oral agreement.",
    "section_number": "98",
    "section_title": "Evidence of oral agreement.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 98",
    "chunk_index": 1,
    "chunk_id": 128,
    "text": "When the terms of any contract or grant or other disposition of property, or any matter required by law to be reduced to the form of a document, have been proved according to section 97 of this Act, no evidence of any oral agreement or statement shall be admitted as between the parties to any such instrument or their representatives in interest for the purpose of contradicting, varying, adding to or subtracting from its terms: Provided that— (i) any fact may be proved which would invalidate any document, or which would entitle any person to any decree or order relating thereto; such as fraud, intimidation, illegality, want of due execution, want of capacity in any contracting party, want or failure of consideration, or mistake in fact or law; (ii) the existence of any separate oral agreement as to any matter on which a document is silent, and which is not inconsistent with its terms, may be proved, and in considering whether or not this paragraph of this proviso applies, the court shall have regard to the degree of formality of the document; (iii) the existence of any separate oral agreement constituting a condition precedent to the attaching of any obligation under any such contract, grant or disposition of property may be proved; (iv) the existence of any distinct subsequent oral",
    "prev_chunk_id": 127,
    "next_chunk_id": 129,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "98 – Evidence of oral agreement.",
    "section_number": "98",
    "section_title": "Evidence of oral agreement.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 98",
    "chunk_index": 2,
    "chunk_id": 129,
    "text": "on which a document is silent, and which is not inconsistent with its terms, may be proved, and in considering whether or not this paragraph of this proviso applies, the court shall have regard to the degree of formality of the document; (iii) the existence of any separate oral agreement constituting a condition precedent to the attaching of any obligation under any such contract, grant or disposition of property may be proved; (iv) the existence of any distinct subsequent oral agreement to rescind or modify any such contract, grant or disposition of property may be proved, except in cases in which such contract, grant or disposition of property is by law required to be in writing, or has been registered according to the law in force for the time being as to the registration of such documents; (v) any usage or custom by which incidents not expressly mentioned in any contract are usually annexed to contracts of that description may be proved, if the annexing of such incident would not be repugnant to, or inconsistent with, the express terms of the contract; (vi) any fact may be proved which shows in what manner the language of a document is related to existing facts.",
    "prev_chunk_id": 128,
    "next_chunk_id": 130,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "99 – Evidence to explain a patent ambiguity.",
    "section_number": "99",
    "section_title": "Evidence to explain a patent ambiguity.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 99",
    "chunk_index": 1,
    "chunk_id": 130,
    "text": "When the language used in a document is on the face of it ambiguous or defective, evidence may not be given of facts which would show its meaning or supply its defects.",
    "prev_chunk_id": 129,
    "next_chunk_id": 131,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "100 – Evidence to show inapplicability.",
    "section_number": "100",
    "section_title": "Evidence to show inapplicability.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 100",
    "chunk_index": 1,
    "chunk_id": 131,
    "text": "When language used in a document is plain, and it applies accurately to existing facts, evidence may not be given to show that it was not meant to apply to such facts.",
    "prev_chunk_id": 130,
    "next_chunk_id": 132,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "101 – Evidence to explain a latent ambiguity.",
    "section_number": "101",
    "section_title": "Evidence to explain a latent ambiguity.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 101",
    "chunk_index": 1,
    "chunk_id": 132,
    "text": "When language used in a document is plain, but is unmeaning in reference to existing facts, evidence may be given to show that it was used in a peculiar sense.",
    "prev_chunk_id": 131,
    "next_chunk_id": 133,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "102 – Evidence of application to one of several subjects.",
    "section_number": "102",
    "section_title": "Evidence of application to one of several subjects.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 102",
    "chunk_index": 1,
    "chunk_id": 133,
    "text": "When the facts are such that the language used in a document might have been meant to apply to any one, and could not have been meant to apply to more than one of several persons or things, evidence may be given of facts which show to which of those persons or things it was intended to apply.",
    "prev_chunk_id": 132,
    "next_chunk_id": 134,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "103 – Evidence of application to one of several sets of facts.",
    "section_number": "103",
    "section_title": "Evidence of application to one of several sets of facts.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 103",
    "chunk_index": 1,
    "chunk_id": 134,
    "text": "When the language used in a document applies partly to one set of existing facts, and partly to another, but the whole of it does not apply correctly to either, evidence may be given to show to which of the two it was meant to apply.",
    "prev_chunk_id": 133,
    "next_chunk_id": 135,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "104 – Evidence to explain special words.",
    "section_number": "104",
    "section_title": "Evidence to explain special words.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 104",
    "chunk_index": 1,
    "chunk_id": 135,
    "text": "Evidence may be given to show the meaning of illegible or not commonly intelligible characters, of foreign, obsolete, technical, local and, provincial expressions, of abbreviations and of words used in a peculiar sense.",
    "prev_chunk_id": 134,
    "next_chunk_id": 136,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "105 – Evidence of variation given by third parties.",
    "section_number": "105",
    "section_title": "Evidence of variation given by third parties.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 105",
    "chunk_index": 1,
    "chunk_id": 136,
    "text": "Persons who are not parties to a document, or their representatives in interest, may give evidence of any facts tending to show a contemporaneous agreement varying the terms of the document.",
    "prev_chunk_id": 135,
    "next_chunk_id": 137,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE",
    "section": "106 – Wills.",
    "section_number": "106",
    "section_title": "Wills.",
    "section_path": "Part VI – EXCLUSION OF ORAL BY DOCUMENTARY EVIDENCE > 106",
    "chunk_index": 1,
    "chunk_id": 137,
    "text": "Nothing in this Part shall affect the law relating to the interpretation and construction of wills or other testamentary dispositions.",
    "prev_chunk_id": 136,
    "next_chunk_id": 138,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 1,
    "chunk_id": 138,
    "text": "106A. Section 106B to apply in proof of electronic records. The contents of electronic records may be proved in accordance with the provisions of section 106B. [Act No. 1 of 2009, s. 36.] 106B. Admissibility of electronic records. (1) Notwithstanding anything contained in this Act, any information contained in an electronic record which is printed on a paper, stored, recorded or copied on optical or electro-magnetic media produced by a computer (herein referred to as \"computer output\") shall be deemed to be also a document, if the conditions mentioned in this section are satisfied in relation to the information and computer in question and shall be admissible in any proceedings, without further proof or production of the original, as evidence of any contents of the original or of any fact stated therein where direct evidence would be admissible. (2) The conditions mentioned in subsection (1), in respect of a computer output, are the following— (a) the computer output containing the information was produced by the computer during the period over which the computer was used to store or process information for any activities regularly carried out over that period by a person having lawful control over the use of the computer; (b) during the said period, information of the kind contained in the electronic record or of the kind from",
    "prev_chunk_id": 137,
    "next_chunk_id": 139,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 2,
    "chunk_id": 139,
    "text": "conditions mentioned in subsection (1), in respect of a computer output, are the following— (a) the computer output containing the information was produced by the computer during the period over which the computer was used to store or process information for any activities regularly carried out over that period by a person having lawful control over the use of the computer; (b) during the said period, information of the kind contained in the electronic record or of the kind from which the information so contained is derived was regularly fed into the computer in the ordinary course of the said activities; (c) throughout the material part of the said period, the computer was operating properly or, if not, then in respect of any period in which it was not operating properly or was out of operation during that part of the period, was not such as to affect the electronic record or the accuracy of its content; and (d) the information contained in the electronic record reproduces or is derived from such information fed into the computer in the ordinary course of the said activities. (3) Where over any period, the function of storing or processing information for the purposes of any activities regularly carried on over that period as mentioned in paragraph (a) of subsection (2) was regularly performed",
    "prev_chunk_id": 138,
    "next_chunk_id": 140,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 3,
    "chunk_id": 140,
    "text": "the period, was not such as to affect the electronic record or the accuracy of its content; and (d) the information contained in the electronic record reproduces or is derived from such information fed into the computer in the ordinary course of the said activities. (3) Where over any period, the function of storing or processing information for the purposes of any activities regularly carried on over that period as mentioned in paragraph (a) of subsection (2) was regularly performed by computers, whether— (a) by combination of computers operating in succession over that period; or (b) by different computers operating in succession over that period; or (c) in any manner involving the successive operation over that period, in whatever order, of one or more computers and one or more combinations of computers, then all computers used for that purpose during that period shall be treated for the purposes of this section to constitute a single computer and references in this sections to a computer shall be construed accordingly. (4) In any proceedings where it is desired to give a statement in evidence by virtue of this section, a certificate doing any of the following— (a) identifying the electronic record containing the statement and describing the manner in which it was produced; (b) giving such particulars of any device involved in",
    "prev_chunk_id": 139,
    "next_chunk_id": 141,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 4,
    "chunk_id": 141,
    "text": "that period shall be treated for the purposes of this section to constitute a single computer and references in this sections to a computer shall be construed accordingly. (4) In any proceedings where it is desired to give a statement in evidence by virtue of this section, a certificate doing any of the following— (a) identifying the electronic record containing the statement and describing the manner in which it was produced; (b) giving such particulars of any device involved in the production of that electronic record as may be appropriate for the purpose of showing that the electronic record was produced by a computer; (c) dealing with any matters to which conditions mentioned in subsection (2) relate; and (d) purporting to be signed by a person occupying a responsible position in relation to the operation of the relevant device or the management of the relevant activities (whichever is appropriate), shall be evidence of any matter stated in the certificate and for the purpose of this subsection it shall be sufficient for a matter to be stated to be the best of the knowledge of the person stating it. (5) For the purpose of this section, information is supplied to a computer if it is supplied thereto in any appropriate form and whether it is so supplied directly or (with or",
    "prev_chunk_id": 140,
    "next_chunk_id": 142,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 5,
    "chunk_id": 142,
    "text": "the management of the relevant activities (whichever is appropriate), shall be evidence of any matter stated in the certificate and for the purpose of this subsection it shall be sufficient for a matter to be stated to be the best of the knowledge of the person stating it. (5) For the purpose of this section, information is supplied to a computer if it is supplied thereto in any appropriate form and whether it is so supplied directly or (with or without human intervention) by means of an appropriate equipment, whether in the course of activities carried on by any official, information is supplied with a view to its being stored or processed for the purpose of those activities, that information, if duly supplied to that computer, shall be taken to be supplied to it in the course of those activities. [Act No. 1 of 2009, s. 36.] 106C. Proof as to a electronic signature. Except in the case of a secure signature, if the electronic signature of any subscriber is alleged to have been affixed to an electronic record, then the fact that such an electronic signature is the electronic signature of the subscriber must be proved. [Act No. 1 of 2009, s. 36.] 106D. Proof as to the verification of electronic signature. In order to ascertain whether an electronic",
    "prev_chunk_id": 141,
    "next_chunk_id": 143,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 6,
    "chunk_id": 143,
    "text": "[Act No. 1 of 2009, s. 36.] 106C. Proof as to a electronic signature. Except in the case of a secure signature, if the electronic signature of any subscriber is alleged to have been affixed to an electronic record, then the fact that such an electronic signature is the electronic signature of the subscriber must be proved. [Act No. 1 of 2009, s. 36.] 106D. Proof as to the verification of electronic signature. In order to ascertain whether an electronic signature is that of a person by whom it purports to have been affixed, the court may direct— (a) that person or the certification service provider to produce the electronic signature certificate; or (b) any other person to apply the procedure listed on the electronic signature certificate and verify the electronic signature purported to have been affixed by that person. [Act No. 1 of 2009, s. 36.] 106E. Presumption as to Gazette in electronic form. A court shall take recognizance of every electronic record purporting to be the official Gazette, or purporting to be electronic record directed by any law to be kept by any person, if such electronic record is kept substantially in the form required by law and is produced from its proper custody. [Act No. 1 of 2009, s. 36.] 106F. Presumption as to electronic agreements A",
    "prev_chunk_id": 142,
    "next_chunk_id": 144,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 7,
    "chunk_id": 144,
    "text": "[Act No. 1 of 2009, s. 36.] 106E. Presumption as to Gazette in electronic form. A court shall take recognizance of every electronic record purporting to be the official Gazette, or purporting to be electronic record directed by any law to be kept by any person, if such electronic record is kept substantially in the form required by law and is produced from its proper custody. [Act No. 1 of 2009, s. 36.] 106F. Presumption as to electronic agreements A court shall presume that every electronic record purporting to be an agreement containing the electronic signatures of the parties was concluded by affixing the digital signature of the parties. [Act No. 1 of 2009, s. 36.] 106G. Presumption as to electronic records and electronic signatures. (1) In any proceedings involving a secure electronic record, the court shall presume, unless the contrary is proved, that the secure electronic record has not been altered since the specific point of time the secure electronic signature was affixed. (2) In any proceedings involving secure electronic signature, the court shall presume, unless the contrary is proved, that the secure signature is affixed by the subscriber with the intention of signing or approving the electronic record. (3) Except in the case of a secure electronic or secure digital signature, nothing in this section shall create any",
    "prev_chunk_id": 143,
    "next_chunk_id": 145,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 8,
    "chunk_id": 145,
    "text": "contrary is proved, that the secure electronic record has not been altered since the specific point of time the secure electronic signature was affixed. (2) In any proceedings involving secure electronic signature, the court shall presume, unless the contrary is proved, that the secure signature is affixed by the subscriber with the intention of signing or approving the electronic record. (3) Except in the case of a secure electronic or secure digital signature, nothing in this section shall create any presumption relating to authenticity and integrity of the electronic record or any digital signature. [Act No. 1 of 2009, s. 36.] 106H. Presumption as to electronic signature certificates. A court shall presume, unless the contrary is proved, that the information listed in an electronic signature certificate is correct, except for information, which has not been verified, if the certificate was accepted by the subscriber. [Act No. 1 of 2009, s. 36.] 106I. Presumption as to electronic messages. A court may presume that an electronic message forwarded by the originator through an electronic mail server to the addressee to whom the message purports to be addressed corresponds with the message as fed into his computer for transmission, but the court shall not make any presumption as to the person by whom such a message was sent. [Act No. 1 of 2009,",
    "prev_chunk_id": 144,
    "next_chunk_id": 146,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VII – ELECTRONIC RECORDS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part VII – ELECTRONIC RECORDS > Preamble",
    "chunk_index": 9,
    "chunk_id": 146,
    "text": "accepted by the subscriber. [Act No. 1 of 2009, s. 36.] 106I. Presumption as to electronic messages. A court may presume that an electronic message forwarded by the originator through an electronic mail server to the addressee to whom the message purports to be addressed corresponds with the message as fed into his computer for transmission, but the court shall not make any presumption as to the person by whom such a message was sent. [Act No. 1 of 2009, s. 36.] Chapter IV PRODUCTION AND EFFECT OF EVIDENCE",
    "prev_chunk_id": 145,
    "next_chunk_id": 147,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "107 – Burden of proof.",
    "section_number": "107",
    "section_title": "Burden of proof.",
    "section_path": "Part I – BURDEN OF PROOF > 107",
    "chunk_index": 1,
    "chunk_id": 147,
    "text": "(1) Whoever desires any court to give judgment as to any legal right or liability dependent on the existence of facts which he asserts must prove that those facts exist. (2) When a person is bound to prove the existence of any fact it is said that the burden of proof lies on that person.",
    "prev_chunk_id": 146,
    "next_chunk_id": 148,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "108 – Incidence of burden.",
    "section_number": "108",
    "section_title": "Incidence of burden.",
    "section_path": "Part I – BURDEN OF PROOF > 108",
    "chunk_index": 1,
    "chunk_id": 148,
    "text": "The burden of proof in a suit or proceeding lies on that person who would fail if no evidence at all were given on either side.",
    "prev_chunk_id": 147,
    "next_chunk_id": 149,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "109 – Proof of particular fact.",
    "section_number": "109",
    "section_title": "Proof of particular fact.",
    "section_path": "Part I – BURDEN OF PROOF > 109",
    "chunk_index": 1,
    "chunk_id": 149,
    "text": "The burden of proof as to any particular fact lies on the person who wishes the court to believe in its existence, unless it is provided by any law that the proof of that fact shall lie on any particular person.",
    "prev_chunk_id": 148,
    "next_chunk_id": 150,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "110 – Proof of admissibility.",
    "section_number": "110",
    "section_title": "Proof of admissibility.",
    "section_path": "Part I – BURDEN OF PROOF > 110",
    "chunk_index": 1,
    "chunk_id": 150,
    "text": "The burden of proving any fact necessary to be proved in order to enable any person to give evidence of any other fact is on the person who wishes to give such evidence.",
    "prev_chunk_id": 149,
    "next_chunk_id": 151,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "111 – Burden on accused in certain cases.",
    "section_number": "111",
    "section_title": "Burden on accused in certain cases.",
    "section_path": "Part I – BURDEN OF PROOF > 111",
    "chunk_index": 1,
    "chunk_id": 151,
    "text": "(1) When a person is accused of any offence, the burden of proving the existence of circumstances bringing the case within any exception or exemption from, or qualification to, the operation of the law creating the offence with which he is charged and the burden of proving any fact especially within the knowledge of such person is upon him: Provided that such burden shall be deemed to be discharged if the court is satisfied by evidence given by the prosecution, whether in cross-examination or otherwise, that such circumstances or facts exist: Provided further that the person accused shall be entitled to be acquitted of the offence with which he is charged if the court is satisfied that the evidence given by either the prosecution or the defense creates a reasonable doubt as to the guilt of the accused person in respect of that offence. (2) Nothing in this section shall— (a) prejudice or diminish in any respect the obligation to establish by evidence according to law any acts, omissions or intentions which are legally necessary to constitute the offence with which the person accused is charged; or (b) impose on the prosecution the burden of proving that the circumstances or facts described in subsection (1) of this section do not exist; or (c) affect the burden placed upon an accused",
    "prev_chunk_id": 150,
    "next_chunk_id": 152,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "111 – Burden on accused in certain cases.",
    "section_number": "111",
    "section_title": "Burden on accused in certain cases.",
    "section_path": "Part I – BURDEN OF PROOF > 111",
    "chunk_index": 2,
    "chunk_id": 152,
    "text": "respect of that offence. (2) Nothing in this section shall— (a) prejudice or diminish in any respect the obligation to establish by evidence according to law any acts, omissions or intentions which are legally necessary to constitute the offence with which the person accused is charged; or (b) impose on the prosecution the burden of proving that the circumstances or facts described in subsection (1) of this section do not exist; or (c) affect the burden placed upon an accused person to prove a defence of intoxication or insanity.",
    "prev_chunk_id": 151,
    "next_chunk_id": 153,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "112 – Proof of special knowledge in civil proceedings.",
    "section_number": "112",
    "section_title": "Proof of special knowledge in civil proceedings.",
    "section_path": "Part I – BURDEN OF PROOF > 112",
    "chunk_index": 1,
    "chunk_id": 153,
    "text": "In civil proceedings, when any fact is especially within the knowledge of any party to those proceedings, the burden of proving or disproving that fact is upon him.",
    "prev_chunk_id": 152,
    "next_chunk_id": 154,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "115 – Disproving apparent special relationship.",
    "section_number": "115",
    "section_title": "Disproving apparent special relationship.",
    "section_path": "Part I – BURDEN OF PROOF > 115",
    "chunk_index": 1,
    "chunk_id": 154,
    "text": "When the question is whether persons are partners, landlord and tenant, or principal and agent, and it has been shown that they have been acting as such, the burden of proving that they do not stand, or have ceased to stand, to each other in those relationships respectively, is on the person who affirms it.",
    "prev_chunk_id": 153,
    "next_chunk_id": 155,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "116 – Disproving ownership.",
    "section_number": "116",
    "section_title": "Disproving ownership.",
    "section_path": "Part I – BURDEN OF PROOF > 116",
    "chunk_index": 1,
    "chunk_id": 155,
    "text": "When the question is whether any person is owner of anything of which he is shown to be in possession, the burden of proving that he is not the owner is on the person who affirms that he is not the owner.",
    "prev_chunk_id": 154,
    "next_chunk_id": 156,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "117 – Proof of good faith.",
    "section_number": "117",
    "section_title": "Proof of good faith.",
    "section_path": "Part I – BURDEN OF PROOF > 117",
    "chunk_index": 1,
    "chunk_id": 156,
    "text": "Where there is a question as to the good faith of a transaction between parties, one of whom stands to the other in a position of active confidence, the burden of proving the good faith of the transaction is on the party who is in a position of active confidence.",
    "prev_chunk_id": 155,
    "next_chunk_id": 157,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "118 – Conclusive proof of legitimacy.",
    "section_number": "118",
    "section_title": "Conclusive proof of legitimacy.",
    "section_path": "Part I – BURDEN OF PROOF > 118",
    "chunk_index": 1,
    "chunk_id": 157,
    "text": "The fact that any person was born during the continuance of a valid marriage between his mother and any man, or within two hundred and eighty days after its dissolution, the mother remaining unmarried, shall be conclusive proof that he is the legitimate son of that man, unless it can be shown that the parties to the marriage had no access to each other at any time when he could have been begotten. 118A. Presumption of death. Where it is proved that a person has not been heard of for seven years by those who might be expected to have heard of him if he were alive, there shall be a rebuttable presumption that he is dead. [Act No. 14 of 1972, Ninth Sch.]",
    "prev_chunk_id": 156,
    "next_chunk_id": 158,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – BURDEN OF PROOF",
    "section": "119 – Presumption of likely facts.",
    "section_number": "119",
    "section_title": "Presumption of likely facts.",
    "section_path": "Part I – BURDEN OF PROOF > 119",
    "chunk_index": 1,
    "chunk_id": 158,
    "text": "The court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct and public and private business, in their relation to the facts of the particular case.",
    "prev_chunk_id": 157,
    "next_chunk_id": 159,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ESTOPPEL",
    "section": "120 – General estoppel.",
    "section_number": "120",
    "section_title": "General estoppel.",
    "section_path": "Part II – ESTOPPEL > 120",
    "chunk_index": 1,
    "chunk_id": 159,
    "text": "When one person has, by his declaration, act or omission, intentionally caused or permitted another person to believe a thing to be true and to act upon such belief, neither he nor his representative shall be allowed, in any suit or proceeding between himself and such person or his representative, to deny the truth of that thing.",
    "prev_chunk_id": 158,
    "next_chunk_id": 160,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ESTOPPEL",
    "section": "121 – Estoppel of tenant or licensee.",
    "section_number": "121",
    "section_title": "Estoppel of tenant or licensee.",
    "section_path": "Part II – ESTOPPEL > 121",
    "chunk_index": 1,
    "chunk_id": 160,
    "text": "No tenant of immovable property, or person claiming through such tenant, shall, during the continuance of the tenancy, be permitted to deny that the landlord of such tenant had at the beginning of the tenancy a title to such immovable property; and no person who came upon any immovable property by the licence of the person in possession thereof shall be permitted to deny that such person had a right to such possession at the time when the license was given.",
    "prev_chunk_id": 159,
    "next_chunk_id": 161,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ESTOPPEL",
    "section": "122 – Estoppel of acceptor of a bill of exchange.",
    "section_number": "122",
    "section_title": "Estoppel of acceptor of a bill of exchange.",
    "section_path": "Part II – ESTOPPEL > 122",
    "chunk_index": 1,
    "chunk_id": 161,
    "text": "No acceptor of a bill of exchange shall be permitted to deny that the drawer had authority to draw such bill or to endorse it: Provided that the acceptor of a bill of exchange may deny that the bill was in fact drawn or endorsed by the person by whom it purports to have been drawn or endorsed.",
    "prev_chunk_id": 160,
    "next_chunk_id": 162,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – ESTOPPEL",
    "section": "123 – Estoppel of a bailee, licensee or agent.",
    "section_number": "123",
    "section_title": "Estoppel of a bailee, licensee or agent.",
    "section_path": "Part II – ESTOPPEL > 123",
    "chunk_index": 1,
    "chunk_id": 162,
    "text": "No bailee, agent or licensee shall be permitted to deny that the bailor, principal or licensor, by whom any goods were entrusted to any of them respectively, was entitled to those goods at the time when they were so entrusted: Provided that any such bailee, agent or licensee may show that he was compelled to deliver up any such goods to some person, who had a right to them as against his bailor, principal or licensor, wrongfully, and without notice to the bailee, agent or licensee, obtained the goods from a third person who has claimed them from such bailee, agent or licensee.",
    "prev_chunk_id": 161,
    "next_chunk_id": 163,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – EVIDENCE OF CHILDREN",
    "section": "124 – Corroboration required in criminal cases.",
    "section_number": "124",
    "section_title": "Corroboration required in criminal cases.",
    "section_path": "Part III – EVIDENCE OF CHILDREN > 124",
    "chunk_index": 1,
    "chunk_id": 163,
    "text": "Notwithstanding the provisions of section 19 of the Oaths and Statutory Declarations Act (Cap. 15), where the evidence of the alleged victim is admitted in accordance with that section on behalf of the prosecution in proceedings against any person for an offence, the accused shall not be liable to be convicted on such evidence unless it is corroborated by other material evidence in support thereof implicating him: Provided that where in a criminal case involving a sexual offence the only evidence is that of the alleged victim of the offence, the court shall receive the evidence of the alleged victim and proceed to convict the accused person if, for reasons to be recorded in the proceedings, the court is satisfied that the alleged victim is telling the truth. [Act No. 5 of 2003, s. 103, Act No. 3 of 2006, Second Sch.] Chapter V WITNESSES",
    "prev_chunk_id": 162,
    "next_chunk_id": 164,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – COMPETENCY OF WITNESSES",
    "section": "125 – Competency generally.",
    "section_number": "125",
    "section_title": "Competency generally.",
    "section_path": "Part I – COMPETENCY OF WITNESSES > 125",
    "chunk_index": 1,
    "chunk_id": 164,
    "text": "(1) All persons shall be competent to testify unless the court considers that they are prevented from understanding the questions put to them, or from giving rational answers to those questions, by tender years, extreme old age, disease (whether of body or mind) or any similar cause. (2) A person suffering from a mental illness is not incompetent to testify unless he is prevented by his condition from understanding the questions put to him and giving rational answers to them. [Act No. 19 of 2023, Sch.]",
    "prev_chunk_id": 163,
    "next_chunk_id": 165,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – COMPETENCY OF WITNESSES",
    "section": "126 – Dumb witnesses.",
    "section_number": "126",
    "section_title": "Dumb witnesses.",
    "section_path": "Part I – COMPETENCY OF WITNESSES > 126",
    "chunk_index": 1,
    "chunk_id": 165,
    "text": "(1) A witness who is unable to speak may give his evidence in any other manner in which he can make it intelligible, as, for example, by writing or by signs; but such writing must be written, and the signs made, in open court. (2) Evidence so given shall be deemed to be oral evidence.",
    "prev_chunk_id": 164,
    "next_chunk_id": 166,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – COMPETENCY OF WITNESSES",
    "section": "127 – Competency of parties and spouses.",
    "section_number": "127",
    "section_title": "Competency of parties and spouses.",
    "section_path": "Part I – COMPETENCY OF WITNESSES > 127",
    "chunk_index": 1,
    "chunk_id": 166,
    "text": "(1) In civil proceedings the parties to the suit, and the husband or wife of any party to the suit, shall be competent witnesses. (2) In criminal proceedings every person charged with an offence, and the wife or husband of the person charged, shall be a competent witness for the defence at every stage of the proceedings, whether such person is charged alone or jointly with any other person: Provided that— (i) the person charged shall not be called as a witness except upon his own application; (ii) save as provided in subsection (3) of this section, the wife or husband of the person charged shall not be called as a witness except upon the application of the person charged; (iii) the failure of the person charged (or of the wife or husband of that person) to give evidence shall not be made the subject of any comment by the prosecution. (3) In criminal proceedings the wife or husband of the person charged shall be a competent and compellable witness for the prosecution or defence without the consent of such person, in any case where such person is charged— (a) with the offence of bigamy; or (b) with offences under the Sexual Offences Act (Cap. 63A); (c) in respect of an act or omission affecting the person or property of",
    "prev_chunk_id": 165,
    "next_chunk_id": 167,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part I – COMPETENCY OF WITNESSES",
    "section": "127 – Competency of parties and spouses.",
    "section_number": "127",
    "section_title": "Competency of parties and spouses.",
    "section_path": "Part I – COMPETENCY OF WITNESSES > 127",
    "chunk_index": 2,
    "chunk_id": 167,
    "text": "not be made the subject of any comment by the prosecution. (3) In criminal proceedings the wife or husband of the person charged shall be a competent and compellable witness for the prosecution or defence without the consent of such person, in any case where such person is charged— (a) with the offence of bigamy; or (b) with offences under the Sexual Offences Act (Cap. 63A); (c) in respect of an act or omission affecting the person or property of the wife or husband of such person or the children of either of them, and not otherwise. (4) In this section \"husband\" and \"wife\" mean respectively the husband and wife of a marriage, whether or not monogamous, which is by law binding during the lifetime of both parties unless dissolved according to law, and includes a marriage under native or tribal custom. [Act No. 3 of 2006, Second Sch.]",
    "prev_chunk_id": 166,
    "next_chunk_id": 168,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "128 – Compellability of ordinary witnesses.",
    "section_number": "128",
    "section_title": "Compellability of ordinary witnesses.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 128",
    "chunk_index": 1,
    "chunk_id": 168,
    "text": "A witness shall not be excused from answering any question as to any matter relevant to the matter in issue in any suit or in any civil or criminal proceeding, upon the ground that the answer to such question will incriminate, or may tend directly or indirectly to incriminate, such witness, or that it will expose, or tend directly or indirectly to expose, such witness to a penalty or forfeiture of any kind, but no such answer which a witness is compelled to give shall subject him to any arrest or prosecution, or be proved against him in any criminal proceeding, except a prosecution for giving false evidence by such answer.",
    "prev_chunk_id": 167,
    "next_chunk_id": 169,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "129 – Privilege of court.",
    "section_number": "129",
    "section_title": "Privilege of court.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 129",
    "chunk_index": 1,
    "chunk_id": 169,
    "text": "No judge or magistrate shall, except upon the special order of some court to which he is subordinate, be compelled to answer any questions as to his own conduct in court as such judge or magistrate, or as to anything which came to his knowledge in court as such judge or magistrate, but he may be examined as to other matters which occurred in his presence whilst he was so acting.",
    "prev_chunk_id": 168,
    "next_chunk_id": 170,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "130 – Communications during marriage.",
    "section_number": "130",
    "section_title": "Communications during marriage.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 130",
    "chunk_index": 1,
    "chunk_id": 170,
    "text": "(1) No person shall be compelled to disclose any communication made to him or her during marriage, by the other spouse; nor shall a person be permitted to disclose such communication without the consent of the person who made it, or of his or her representative in interest, except in suits between the parties to the marriage or in any of the cases referred to in paragraphs (a), (b) and (c) of section 127(3) of this Act. (2) In this section \"marriage\" means a marriage, whether or not monogamous, which is by law binding during the lifetime of the parties thereto unless dissolved according to law, and includes a marriage under native or tribal custom.",
    "prev_chunk_id": 169,
    "next_chunk_id": 171,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "131 – Privilege relating to official records.",
    "section_number": "131",
    "section_title": "Privilege relating to official records.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 131",
    "chunk_index": 1,
    "chunk_id": 171,
    "text": "Whenever it is stated on oath (whether by affidavit or otherwise) by a Minister that he has examined the contents of any document forming part of any unpublished official records, the production of which document has been called for in any proceedings and that he is of the opinion that such production would be prejudicial to the public service, either by reason of the content thereof or of the fact that it belongs to a class which, on grounds of public policy, should be withheld from such production, the document shall not be admissible. [Act No. 10 of 1969, Sch., Act No. 7 of 1990, Sch.]",
    "prev_chunk_id": 170,
    "next_chunk_id": 172,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "132 – Privilege of official communications.",
    "section_number": "132",
    "section_title": "Privilege of official communications.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 132",
    "chunk_index": 1,
    "chunk_id": 172,
    "text": "No public officer shall be compelled to disclose communications made by any person to him in the course of his duty, when he considers that the public interest would suffer by the disclosure. [Act No. 13 of 1972, Sch.]",
    "prev_chunk_id": 171,
    "next_chunk_id": 173,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "133 – Privilege relating to information of commission of offences.",
    "section_number": "133",
    "section_title": "Privilege relating to information of commission of offences.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 133",
    "chunk_index": 1,
    "chunk_id": 173,
    "text": "(1) No judge, magistrate or police officer shall be compelled to say whence he got any information as to the commission of any offence, and no revenue officer shall be compelled to say whence he got any information as to the commission of any offence against the law relating to the public revenue or the laws specified in the First Schedule to the Kenya Revenue Authority Act (Cap. 469). (2) For the purposes of this section, “revenue officer” means any officer employed in or about the business of any public office for the collection of public revenue. [Act No. 22 of 2022, s. 52.]",
    "prev_chunk_id": 172,
    "next_chunk_id": 174,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "134 – Privilege of advocates.",
    "section_number": "134",
    "section_title": "Privilege of advocates.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 134",
    "chunk_index": 1,
    "chunk_id": 174,
    "text": "(1) No advocate shall at any time be permitted unless with his client’s express consent, to disclose any communication made to him in the course and for the purpose of his employment as such advocate, by or on behalf of his client, or to state the contents or condition of any document with which he has become acquainted in the course and for the purpose of his professional employment, or to disclose any advice given by him to his client in the course and for the purpose of such employment: Provided that nothing in this section shall protect from disclosure— (a) any communication made in furtherance of any illegal purpose; (b) any fact observed by any advocate in the course of his employment as such, showing that any crime or fraud has been committed since the commencement of his employment, whether the attention of such advocate was or was not directed to the fact by or on behalf of his client. (2) The protection given by subsection (1) of this section shall continue after the employment of the advocate has ceased.",
    "prev_chunk_id": 173,
    "next_chunk_id": 175,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "135 – Privilege of interpreters, and advocates’ clerks and servants.",
    "section_number": "135",
    "section_title": "Privilege of interpreters, and advocates’ clerks and servants.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 135",
    "chunk_index": 1,
    "chunk_id": 175,
    "text": "The provisions of section 134 of this Act shall apply to interpreters, and the clerks or servants of advocates.",
    "prev_chunk_id": 174,
    "next_chunk_id": 176,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "136 – Waiving of privilege of advocates, etc.",
    "section_number": "136",
    "section_title": "Waiving of privilege of advocates, etc.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 136",
    "chunk_index": 1,
    "chunk_id": 176,
    "text": "(1) If any party to a suit or proceeding gives evidence therein at his own instance or otherwise, he shall not be deemed to have consented thereby to such disclosure as is mentioned in section 134(1) of this Act. (2) If any party to a suit or proceeding calls any advocate, interpreter, clerk or servant as a witness, he shall be deemed to have consented to such disclosure as is mentioned in section 134(1) of this Act only if he questions such witness on matters which, but for such question, the witness would not be at liberty to disclose.",
    "prev_chunk_id": 175,
    "next_chunk_id": 177,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "137 – Communications with an advocate.",
    "section_number": "137",
    "section_title": "Communications with an advocate.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 137",
    "chunk_index": 1,
    "chunk_id": 177,
    "text": "No one shall be compelled to disclose to the court any confidential communication which has taken place between him and his advocate unless he offers himself as a witness, in which case he may be compelled to disclose any such communications as may appear to the court necessary to be known in order to explain any evidence which he has given, but no others.",
    "prev_chunk_id": 176,
    "next_chunk_id": 178,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "138 – Title deeds and incriminating documents in hands of third party.",
    "section_number": "138",
    "section_title": "Title deeds and incriminating documents in hands of third party.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 138",
    "chunk_index": 1,
    "chunk_id": 178,
    "text": "No witness who is not a party to the suit shall be compelled to produce his title deeds to any property, or any document in virtue of which he holds any property as pledgee or mortgagee, or any document the production of which might tend to incriminate him, unless he has agreed in writing with the person seeking the production of such deeds or document, or with some person through whom he claims, to produce them.",
    "prev_chunk_id": 177,
    "next_chunk_id": 179,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "139 – Privileged document in possession of another.",
    "section_number": "139",
    "section_title": "Privileged document in possession of another.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 139",
    "chunk_index": 1,
    "chunk_id": 179,
    "text": "No one shall be compelled to produce documents in his possession, which any other person would be entitled to refuse to produce if they were in his possession, unless such other person consents to their production.",
    "prev_chunk_id": 178,
    "next_chunk_id": 180,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "140 – Bankers’ books.",
    "section_number": "140",
    "section_title": "Bankers’ books.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 140",
    "chunk_index": 1,
    "chunk_id": 180,
    "text": "(1) A bank, or officer of a bank, shall not, in any legal proceedings to which the bank is not a party, be compelled to produce any banker’s book the contents of which can be proved under the provisions of Chapter VII. (2) No bank or officer of a bank shall be summoned or called as a witness to prove any matters, transactions or accounts recorded in a banker’s book except by order of a judge or magistrate made for special cause.",
    "prev_chunk_id": 179,
    "next_chunk_id": 181,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "141 – Accomplices.",
    "section_number": "141",
    "section_title": "Accomplices.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 141",
    "chunk_index": 1,
    "chunk_id": 181,
    "text": "An accomplice shall be a competent witness against an accused person; and a conviction shall not be illegal merely because it proceeds upon the uncorroborated evidence of an accomplice.",
    "prev_chunk_id": 180,
    "next_chunk_id": 182,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "142 – Privileges to exclude oral evidence of documents.",
    "section_number": "142",
    "section_title": "Privileges to exclude oral evidence of documents.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 142",
    "chunk_index": 1,
    "chunk_id": 182,
    "text": "No person who is entitled to refuse to produce a document shall be compelled to give oral evidence of its contents.",
    "prev_chunk_id": 181,
    "next_chunk_id": 183,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES",
    "section": "143 – Number of witnesses.",
    "section_number": "143",
    "section_title": "Number of witnesses.",
    "section_path": "Part II – COMPELLABILITY AND PRIVILEGES OF WITNESSES > 143",
    "chunk_index": 1,
    "chunk_id": 183,
    "text": "No particular number of witnesses shall, in the absence of any provision of law to the contrary, be required for the proof of any fact.",
    "prev_chunk_id": 182,
    "next_chunk_id": 184,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – EXAMINATION OF WITNESSES",
    "section": "144 – Court to decide as to the admissibility of evidence.",
    "section_number": "144",
    "section_title": "Court to decide as to the admissibility of evidence.",
    "section_path": "Part III – EXAMINATION OF WITNESSES > 144",
    "chunk_index": 1,
    "chunk_id": 184,
    "text": "(1) When either party proposes to give evidence of any fact, the court may ask the party proposing to give the evidence in what manner the alleged fact, if proved, would be admissible. (2) The court shall admit the evidence of any fact if it thinks that the fact, if proved, would be admissible and not otherwise. (3) If the fact proposed to be proved is one of which evidence is admissible only upon proof of some other fact, such last mentioned fact must be proved before evidence is given of the fact first mentioned, unless the party undertakes to give proof of such fact and the court is satisfied with such undertaking. (4) If the admissibility of one alleged fact depends upon another alleged fact being first proved, the court may, in its discretion, either permit evidence of the first fact to be given before the second fact is proved, or require evidence to be given of the second fact before evidence is given of the first fact.",
    "prev_chunk_id": 183,
    "next_chunk_id": 185,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – EXAMINATION OF WITNESSES",
    "section": "145 – Type of examination of witnesses.",
    "section_number": "145",
    "section_title": "Type of examination of witnesses.",
    "section_path": "Part III – EXAMINATION OF WITNESSES > 145",
    "chunk_index": 1,
    "chunk_id": 185,
    "text": "(1) The examination of a witness by the party who calls him shall be called his examination-in-chief. (2) The examination of a witness by the adverse party shall be called his cross- examination. (3) Where a witness has been cross-examined and is then examined by the party who called him, such examination shall be called his re-examination.",
    "prev_chunk_id": 184,
    "next_chunk_id": 186,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part III – EXAMINATION OF WITNESSES",
    "section": "146 – Order and direction of examinations.",
    "section_number": "146",
    "section_title": "Order and direction of examinations.",
    "section_path": "Part III – EXAMINATION OF WITNESSES > 146",
    "chunk_index": 1,
    "chunk_id": 186,
    "text": "(1) Witnesses shall first be examined-in-chief, then, if the adverse party so desires, cross-examined, then, if the party calling them so desires, re-examined. (2) Subject to the following provisions of this Act, the examination-in-chief and cross-examination must relate to relevant facts, but the cross-examination need not be confined to the facts to which the witness testified in his examination-in-chief. (3) The re-examination shall be directed to the explanation of matters referred to in crossexamination; and, if new matter is, by permission of the court, introduced in re-examination, the adverse party may further cross-examine upon that matter. (4) The court may in all cases permit a witness to be recalled either for further examination-in-chief or for further cross-examination, and if it does so, the parties have the right of further crossexamination and re-examination respectively.",
    "prev_chunk_id": 185,
    "next_chunk_id": 187,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "147 – Person called to produce a document.",
    "section_number": "147",
    "section_title": "Person called to produce a document.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 147",
    "chunk_index": 1,
    "chunk_id": 187,
    "text": "A person called to produce a document does not become a witness by the mere fact that he produces it, and cannot be cross-examined unless and until he is called as a witness.",
    "prev_chunk_id": 186,
    "next_chunk_id": 188,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "148 – Witness to character.",
    "section_number": "148",
    "section_title": "Witness to character.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 148",
    "chunk_index": 1,
    "chunk_id": 188,
    "text": "A witness to character may be cross-examined and re-examined.",
    "prev_chunk_id": 187,
    "next_chunk_id": 189,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "149 – Meaning of leading question.",
    "section_number": "149",
    "section_title": "Meaning of leading question.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 149",
    "chunk_index": 1,
    "chunk_id": 189,
    "text": "Any question suggesting the answer which the person putting it wishes or expects to receive, or suggesting a disputed fact as to which the witness is to testify, is a leading question.",
    "prev_chunk_id": 188,
    "next_chunk_id": 190,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "150 – Leading questions in examination-in-chief and re-examination.",
    "section_number": "150",
    "section_title": "Leading questions in examination-in-chief and re-examination.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 150",
    "chunk_index": 1,
    "chunk_id": 190,
    "text": "(1) Leading questions must not, if objected to by the adverse party, be asked in an examination-in-chief or in a re-examination, except with the permission of the court. (2) The court shall permit leading questions as to matters which are introductory or undisputed, or which have in its opinion been already sufficiently proved.",
    "prev_chunk_id": 189,
    "next_chunk_id": 191,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "151 – Leading questions in cross-examination.",
    "section_number": "151",
    "section_title": "Leading questions in cross-examination.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 151",
    "chunk_index": 1,
    "chunk_id": 191,
    "text": "Leading questions may be asked in cross-examination.",
    "prev_chunk_id": 190,
    "next_chunk_id": 192,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "152 – Examination as to whether certain formal matters are contained in writing.",
    "section_number": "152",
    "section_title": "Examination as to whether certain formal matters are contained in writing.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 152",
    "chunk_index": 1,
    "chunk_id": 192,
    "text": "Any witness may be asked, whilst under examination, whether any contract or grant or other disposition of property as to which he is giving evidence was not contained in a document, but if he says that it was, or if he is about to make any statement as to the contents of any document which, in the opinion of the court, ought to be produced, the adverse party may object to such evidence being given until such document is produced, or until facts have been proved which entitle the party who called the witness to give secondary evidence of it.",
    "prev_chunk_id": 191,
    "next_chunk_id": 193,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "153 – Cross-examination as to previous written statements.",
    "section_number": "153",
    "section_title": "Cross-examination as to previous written statements.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 153",
    "chunk_index": 1,
    "chunk_id": 193,
    "text": "A witness may be cross-examined as to previous statements made by him in writing or reduced into writing, and relevant to matters in question, without such writing being shown to him or being proved, but if it is intended to contradict a witness by a previous written statement, his attention must, before the writing can be proved, be called to those parts of it which are to be used for the purpose of contradicting him.",
    "prev_chunk_id": 192,
    "next_chunk_id": 194,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "154 – Cross-examination as to credibility.",
    "section_number": "154",
    "section_title": "Cross-examination as to credibility.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 154",
    "chunk_index": 1,
    "chunk_id": 194,
    "text": "When a witness is cross-examined he may, in addition to the questions hereinbefore referred to, be asked any questions which tend— (a) to test his accuracy, veracity or credibility; (b) to discover who he is and what is his position in life; (c) to shake his credit, by injuring his character, although the answer to such questions might tend directly or indirectly to incriminate him or might expose or tend directly or indirectly to expose him to a penalty or forfeiture.",
    "prev_chunk_id": 193,
    "next_chunk_id": 195,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "155 – Compulsion to answer questions as to credit.",
    "section_number": "155",
    "section_title": "Compulsion to answer questions as to credit.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 155",
    "chunk_index": 1,
    "chunk_id": 195,
    "text": "If any question asked under section 154(c) for the purpose of affecting the credit of the witness relates to a matter relevant to the suit or proceeding, the provisions of section 128 of this Act shall apply thereto.",
    "prev_chunk_id": 194,
    "next_chunk_id": 196,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "156 – Cross-examination of accused person.",
    "section_number": "156",
    "section_title": "Cross-examination of accused person.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 156",
    "chunk_index": 1,
    "chunk_id": 196,
    "text": "A person charged with an offence and called as a witness for the defence may be asked any question in cross-examination notwithstanding that the answer may tend to incriminate him as to the offence charged.",
    "prev_chunk_id": 195,
    "next_chunk_id": 197,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "157 – Discretion of court to compel witness to answer question as to credit.",
    "section_number": "157",
    "section_title": "Discretion of court to compel witness to answer question as to credit.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 157",
    "chunk_index": 1,
    "chunk_id": 197,
    "text": "(1) If any question asked relates to a matter not relevant to the suit or proceeding except in so far as it affects the credit of the witness by injuring his character, the court shall decide whether or not the witness shall be compelled to answer it, and may, if it does not so compel him, warn the witness that he is not obliged to answer. (2) In exercising its discretion under this section, the court shall have regard to the following considerations— (a) such questions are proper if they are of such a nature that the truth of the imputation conveyed by them would seriously affect the opinion of the court as to the credibility of the witness on the matter to which he testifies; (b) such questions are improper if the imputation which they convey relates to matters so remote in time, or of such a character, that the truth of the imputation would not affect, or would affect in a slight degree, the opinion of the court as to the credibility of the witness on the matter to which he testifies; (c) such questions are improper if there is a great disproportion between the importance of the imputation made against the witness’s character and the importance of his evidence. (3) The court may, if it sees fit,",
    "prev_chunk_id": 196,
    "next_chunk_id": 198,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "157 – Discretion of court to compel witness to answer question as to credit.",
    "section_number": "157",
    "section_title": "Discretion of court to compel witness to answer question as to credit.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 157",
    "chunk_index": 2,
    "chunk_id": 198,
    "text": "so remote in time, or of such a character, that the truth of the imputation would not affect, or would affect in a slight degree, the opinion of the court as to the credibility of the witness on the matter to which he testifies; (c) such questions are improper if there is a great disproportion between the importance of the imputation made against the witness’s character and the importance of his evidence. (3) The court may, if it sees fit, draw from the witness’s refusal to answer, the inference that the answer, if given, would be unfavourable to the witness.",
    "prev_chunk_id": 197,
    "next_chunk_id": 199,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "158 – Necessity for grounds before attacking character.",
    "section_number": "158",
    "section_title": "Necessity for grounds before attacking character.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 158",
    "chunk_index": 1,
    "chunk_id": 199,
    "text": "No such question as is referred to in section 157 of this Act ought to be asked unless the person asking it has reasonable grounds for thinking that the imputation which it conveys is well founded.",
    "prev_chunk_id": 198,
    "next_chunk_id": 200,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "159 – Indecent or scandalous questions.",
    "section_number": "159",
    "section_title": "Indecent or scandalous questions.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 159",
    "chunk_index": 1,
    "chunk_id": 200,
    "text": "The court may forbid any questions or inquiries which it regards as indecent or scandalous, although such questions or inquiries may have some bearing on the questions before the court, unless they relate to facts in issue or to matters necessary to be known in order to determine whether or not the facts in issue existed.",
    "prev_chunk_id": 199,
    "next_chunk_id": 201,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "160 – Insulting or annoying questions.",
    "section_number": "160",
    "section_title": "Insulting or annoying questions.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 160",
    "chunk_index": 1,
    "chunk_id": 201,
    "text": "The court shall forbid any question which appears to it to be intended to insult or annoy, or which, though proper in itself, appears to the court needlessly offensive in form.",
    "prev_chunk_id": 200,
    "next_chunk_id": 202,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "161 – Discretion to allow cross-examination of own witness.",
    "section_number": "161",
    "section_title": "Discretion to allow cross-examination of own witness.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 161",
    "chunk_index": 1,
    "chunk_id": 202,
    "text": "The court may, in its discretion, permit the person who calls a witness to put any questions to him which might be put in cross-examination by the adverse party.",
    "prev_chunk_id": 201,
    "next_chunk_id": 203,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "162 – Exclusion of evidence to contradict a witness.",
    "section_number": "162",
    "section_title": "Exclusion of evidence to contradict a witness.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 162",
    "chunk_index": 1,
    "chunk_id": 203,
    "text": "When a witness has been asked and has answered any question which is relevant to the proceedings only in so far as it tends to shake his credit by injuring his character, no evidence shall be given to contradict him but if he answers falsely he may afterwards be charged with giving false evidence: Provided that— (i) if a witness is asked whether he has been previously convicted of any crime and denies it, evidence may be given of his previous conviction; (ii) if a witness is asked any question tending to impeach his impartiality and answers it by denying the facts suggested, evidence may be given of the facts.",
    "prev_chunk_id": 202,
    "next_chunk_id": 204,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "163 – Evidence to impeach the credit of a witness.",
    "section_number": "163",
    "section_title": "Evidence to impeach the credit of a witness.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 163",
    "chunk_index": 1,
    "chunk_id": 204,
    "text": "(1) The credit of a witness may be impeached in the following ways by the adverse party, or, with the consent of the court, by the party who calls him— (a) by the evidence of persons who testify that they, from their knowledge of the witness, believe him to be unworthy of credit; (b) by proof that the witness has been bribed, or has accepted the offer of a bribe, or has received any other corrupt inducement to give his evidence; (c) by proof of former statements, whether written or oral, inconsistent with any part of his evidence which is liable to be contradicted; (d) when a man is prosecuted for rape or an attempt to commit rape, it may be shown that the prosecutrix was of generally immoral character. (2) A person who, called as a witness pursuant to paragraph (a) of subsection (1) of this section, declares another witness to be unworthy of credit may not, upon his examination-in-chief, give reasons for his belief, but he may be asked his reasons in cross-examination and the answers which he gives cannot be contradicted, though, if they are false, he may afterwards be charged with giving false evidence.",
    "prev_chunk_id": 203,
    "next_chunk_id": 205,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "164 – Circumstantial questions to confirm evidence.",
    "section_number": "164",
    "section_title": "Circumstantial questions to confirm evidence.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 164",
    "chunk_index": 1,
    "chunk_id": 205,
    "text": "When a witness the truthfulness of whose evidence it is intended to confirm gives evidence of any fact, he may be questioned as to any other circumstances which he observed at or near the time or place at which the fact occurred, if the court is of opinion that such circumstances, if proved, would tend to confirm the testimony of the witness as to the fact to which he testifies.",
    "prev_chunk_id": 204,
    "next_chunk_id": 206,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "165 – Proof of consistency by former statements.",
    "section_number": "165",
    "section_title": "Proof of consistency by former statements.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 165",
    "chunk_index": 1,
    "chunk_id": 206,
    "text": "In order to show that the testimony of a witness is consistent any former statement made by such witness, whether written or oral, relating to the same fact at or about the time when the fact took place, or before any authority legally competent to investigate the fact, may be proved.",
    "prev_chunk_id": 205,
    "next_chunk_id": 207,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part IV – QUESTIONING OF WITNESSES",
    "section": "166 – Evidence to test statement of person not available as witness.",
    "section_number": "166",
    "section_title": "Evidence to test statement of person not available as witness.",
    "section_path": "Part IV – QUESTIONING OF WITNESSES > 166",
    "chunk_index": 1,
    "chunk_id": 207,
    "text": "Whenever any statement admissible under section 33 or section 34 of this Act is proved, all matters which might have been proved if that person had been called as a witness and had denied upon crossexamination the truth of the matter suggested, may be proved either to contradict or to show consistency, or in order to impeach or confirm the credit of the person by whom it was made.",
    "prev_chunk_id": 206,
    "next_chunk_id": 208,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "167 – Refreshing memory by reference to contemporaneous writing.",
    "section_number": "167",
    "section_title": "Refreshing memory by reference to contemporaneous writing.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 167",
    "chunk_index": 1,
    "chunk_id": 208,
    "text": "(1) A witness may, while under examination, refresh his memory by referring to any writing made by himself at the time of the transaction concerning which he is questioned, or made so soon afterwards that the court considers it likely that the transaction was at that time fresh in his memory. (2) A witness may, while under examination, refresh his memory by referring to any writing made by any other person and read by the witness within the time mentioned in subsection (1) of this section, if when he read it he knew it to be correct. (3) Whenever a witness may refresh his memory by reference to any writing, he may, with the permission of the court, refer to a copy of such writing, if the court is satisfied that there is sufficient reason for the non-production of the original. (4) An expert may refresh his memory by reference to professional treatises.",
    "prev_chunk_id": 207,
    "next_chunk_id": 209,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "168 – Reference to accurate contemporaneous record though facts themselves not specifically recalled.",
    "section_number": "168",
    "section_title": "Reference to accurate contemporaneous record though facts themselves not specifically recalled.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 168",
    "chunk_index": 1,
    "chunk_id": 209,
    "text": "A witness may testify to facts mentioned in any such writing as is referred to in section 167 of this Act although he has no specific recollection of the facts themselves, if he is sure that the facts were correctly recorded in the document.",
    "prev_chunk_id": 208,
    "next_chunk_id": 210,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "169 – Rights of adverse party as to contemporaneous writing.",
    "section_number": "169",
    "section_title": "Rights of adverse party as to contemporaneous writing.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 169",
    "chunk_index": 1,
    "chunk_id": 210,
    "text": "Any writing referred to in section 167 or section 168 of this Act shall be produced and shown to the adverse party if he requires it, and such party may, if he pleases, cross-examine the witness thereupon.",
    "prev_chunk_id": 209,
    "next_chunk_id": 211,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "170 – Production of documents of doubtful admissibility.",
    "section_number": "170",
    "section_title": "Production of documents of doubtful admissibility.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 170",
    "chunk_index": 1,
    "chunk_id": 211,
    "text": "(1) A witness summoned to produce a document shall, if it is in his possession or power, bring it to court notwithstanding any objection which there may be to its production or to its admissibility, but the validity of any such objection shall be tried by the court. (2) (a) The court, if it sees fit, may inspect the document, unless it is a document to which the provisions of section 131 of this Act are applied, or take other evidence to enable it to determine on its admissibility. (b) If for such purpose it is necessary to cause any document to be translated, the court may, if it thinks fit, direct the translator to keep the contents secret, unless the document is to be given in evidence.",
    "prev_chunk_id": 210,
    "next_chunk_id": 212,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "171 – Document produced in answer to notice to be given as evidence if required.",
    "section_number": "171",
    "section_title": "Document produced in answer to notice to be given as evidence if required.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 171",
    "chunk_index": 1,
    "chunk_id": 212,
    "text": "When a party calls for a document which he has given the other party notice to produce, and such document is produced and inspected by the party calling for its production, he is bound to give it as evidence if the party producing it requires him to do so and if it is admissible.",
    "prev_chunk_id": 211,
    "next_chunk_id": 213,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "172 – Consequence of refusal to produce document in answer to notice.",
    "section_number": "172",
    "section_title": "Consequence of refusal to produce document in answer to notice.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 172",
    "chunk_index": 1,
    "chunk_id": 213,
    "text": "When a party refuses to produce a document for which he has had notice to produce, he cannot afterwards use the document as evidence without the consent of the other party or the order of the court.",
    "prev_chunk_id": 212,
    "next_chunk_id": 214,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS",
    "section": "173 – Extended powers of court for purpose of obtaining proper evidence.",
    "section_number": "173",
    "section_title": "Extended powers of court for purpose of obtaining proper evidence.",
    "section_path": "Part V – REFRESHING OF MEMORY AND PRODUCTION OF DOCUMENTS > 173",
    "chunk_index": 1,
    "chunk_id": 214,
    "text": "(1) A judge or magistrate may, in order to discover or to obtain proper evidence, ask any question he pleases, in any form, at any time, of any witness, or of the parties about any fact whether or not it is otherwise admissible; and may order the production of any document or thing; and neither the parties nor their agents shall be entitled to object to any such question or order, nor, without leave of the court, to cross-examine the witness upon any answer given in reply to any such question: Provided that judgment shall be based only upon facts which are otherwise admissible and which have been duly proved. (2) Subsection (1) of this section shall not authorize a judge or magistrate— (a) to compel a witness to answer any question or to produce any document which such witness would be entitled to refuse to answer or produce under the provisions of Part II of this Chapter, if the question were asked or the document was called for by the adverse party; nor (b) to ask any question which it would be improper for any other person to ask under section 157 or 158 of this Act; nor (c) to dispense with the primary evidence of any document, except in the cases excepted by the provisions of this Act.",
    "prev_chunk_id": 213,
    "next_chunk_id": 215,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "174 – [Deleted by Act No. 7 of 2007, Sch.]",
    "section_number": "174",
    "section_title": "[Deleted by Act No. 7 of 2007, Sch.]",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 174",
    "chunk_index": 1,
    "chunk_id": 215,
    "text": "Chapter VI IMPROPER ADMISSION AND REJECTION OF EVIDENCE",
    "prev_chunk_id": 214,
    "next_chunk_id": 216,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "175 – Effect of improper admission or rejection.",
    "section_number": "175",
    "section_title": "Effect of improper admission or rejection.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 175",
    "chunk_index": 1,
    "chunk_id": 216,
    "text": "The improper admission or rejection of evidence shall not of itself be ground for a new trial or for reversal of any decision in a case if it shall appear to the court before which the objection is taken that, independently of the evidence objected to and admitted, there was sufficient evidence to justify the decision, or that if the rejected evidence had been received it ought not to have varied the decision. Chapter VII BANKERS’ BOOKS",
    "prev_chunk_id": 215,
    "next_chunk_id": 217,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "176 – Mode of proof of entries in bankers’ books.",
    "section_number": "176",
    "section_title": "Mode of proof of entries in bankers’ books.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 176",
    "chunk_index": 1,
    "chunk_id": 217,
    "text": "Subject to the provisions of this Chapter of this Act, a copy of any entry in a banker’s book shall in all legal proceedings be received as prima facie evidence of such entry, and of the matters, transaction and accounts therein recorded.",
    "prev_chunk_id": 216,
    "next_chunk_id": 218,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "177 – Proof and verification of copy.",
    "section_number": "177",
    "section_title": "Proof and verification of copy.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 177",
    "chunk_index": 1,
    "chunk_id": 218,
    "text": "(1) A copy of an entry in a banker’s book shall not be received in evidence under section 176 of this Act unless it be first proved that— (a) the book was, at the time of making the entry, one of the ordinary books of the bank; and (b) the book is in the custody and control of the bank; and (c) the entry was made in the usual and ordinary course of banking business; and (d) the copy has been examined with the original entry, and is correct. (2) Such proof may be given by an officer of the bank, or, in the case of the proof required under paragraph (d) of subsection (1), by the person who has performed the examination, and may be given either orally or by an affidavit sworn before a commissioner for oaths or a person authorised to take affidavits.",
    "prev_chunk_id": 217,
    "next_chunk_id": 219,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "178 – Restriction on compelling production of banker’s book.",
    "section_number": "178",
    "section_title": "Restriction on compelling production of banker’s book.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 178",
    "chunk_index": 1,
    "chunk_id": 219,
    "text": "A banker or officer of a bank shall not, in any proceedings to which the bank is not a party, be compellable to produce any banker’s book the contents of which can be proved under this Chapter of this Act, or to appear as a witness to prove the matters, transactions and accounts therein recorded, unless by order of the court made for special cause.",
    "prev_chunk_id": 218,
    "next_chunk_id": 220,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "179 – Inspection of bankers’ books.",
    "section_number": "179",
    "section_title": "Inspection of bankers’ books.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 179",
    "chunk_index": 1,
    "chunk_id": 220,
    "text": "(1) On the application of any party to proceedings a court may order that such party be at liberty to inspect and take copies of any entries in a banker’s book for any of the purposes, of such proceedings. (2) An order made under this section may be made either with or without summoning the bank or any other party, and shall be served on the bank three clear days before it is to be obeyed, unless the court otherwise directs. (3) For the purposes of subsection (1), \"proceedings\" includes any proceedings in Tanzania or Uganda. [L.N. 22 of 1965.]",
    "prev_chunk_id": 219,
    "next_chunk_id": 221,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "180 – Warrant to investigate.",
    "section_number": "180",
    "section_title": "Warrant to investigate.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 180",
    "chunk_index": 1,
    "chunk_id": 221,
    "text": "(1) Where it is proved on oath to a judge or magistrate that in fact, or according to reasonable suspicion, the inspection of any banker’s book is necessary or desirable for the purpose of any investigation into the commission of an offence, the judge or magistrate may by warrant authorize a police officer or other person named therein to investigate the account of any specified person in any banker’s book, and such warrant shall be sufficient authority for the production of any such banker’s book as may be required for scrutiny by the officer or person named in the warrant, and such officer or person may take copies of any relevant entry or matter in such banker’s book. (2) Any person who fails to produce any such banker’s book to the police officer or other person executing a warrant issued under this section or to permit such officer or person to scrutinize the book or to take copies of any relevant entry or matter therein shall be guilty of an offence and liable to imprisonment for a term not exceeding one year or to a fine not exceeding two thousand shillings or to both such imprisonment and fine.",
    "prev_chunk_id": 220,
    "next_chunk_id": 222,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "181 – Costs.",
    "section_number": "181",
    "section_title": "Costs.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 181",
    "chunk_index": 1,
    "chunk_id": 222,
    "text": "(1) The costs of any application to a court under or for the purposes of this Chapter of this Act and the costs of anything done or to be done under an order of a court made under or for the purposes of this Chapter, shall be in the discretion of the court, which may order them, or any part thereof, to be paid to any party by the bank where the costs were occasioned by any default or delay on the part of the bank. (2) An order under subsection (1) of this section may be enforced as if the bank was a party to the proceedings. Chapter VIII MISCELLANEOUS PROVISIONS",
    "prev_chunk_id": 221,
    "next_chunk_id": 223,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "182 – Saving for other laws.",
    "section_number": "182",
    "section_title": "Saving for other laws.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 182",
    "chunk_index": 1,
    "chunk_id": 223,
    "text": "Save as otherwise expressly provided in this Act, nothing in this Act shall be deemed to derogate from the provisions of any other written law which relate to matters of evidence.",
    "prev_chunk_id": 222,
    "next_chunk_id": 224,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "183 – Cessation of application of Indian Evidence Act.",
    "section_number": "183",
    "section_title": "Cessation of application of Indian Evidence Act.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 183",
    "chunk_index": 1,
    "chunk_id": 224,
    "text": "(1) From and after the commencement of this Act the Evidence Act, 1872 (No. 1 of 1872) of India shall cease to extend or apply to Kenya. (2) For the purposes of sections 21 and 23 of the Interpretation and General Provisions Act (Cap. 2), the Evidence Act, 1872, of India, as it applied to Kenya prior to the commencement of this Act, shall be deemed to be a written law which has been repealed by, and re-enacted in, this Act. SCHEDULE [s. 78] CERTIFICATE AS TO PHOTOGRAPHIC PRINT OR ENLARGEMENT I, .................................... of .................. being an officer appointed by the ............................ under ..................... (Gazette Notice No. ............ of .........................) hereby certify as follows— (1) On the ........... day of ............. 20 ........ at ................. I received in a sealed packet numbered ..................... purporting to be signed by ............................... exposed photographic film (s) under cover of a letter, No. .............. dated ..................... purporting to be sent by ....................................., requesting that I should process the said film(s) and prepare therefrom photographic print(s) and/or enlargement(s). (2) The said letter and packet were each signed and dated by me and are attached hereto as annexes 1 and 2, respectively. (3) In pursuance of the said request (I processed) the said film(s) were processed under my supervision and (prepared) therefrom photographic print(s) and/or enlargement(s)",
    "prev_chunk_id": 223,
    "next_chunk_id": 225,
    "act_year": null
  },
  {
    "act": "Evidence Act",
    "part": "Part VI – QUESTIONS BY ASSESSORS",
    "section": "183 – Cessation of application of Indian Evidence Act.",
    "section_number": "183",
    "section_title": "Cessation of application of Indian Evidence Act.",
    "section_path": "Part VI – QUESTIONS BY ASSESSORS > 183",
    "chunk_index": 2,
    "chunk_id": 225,
    "text": "photographic film (s) under cover of a letter, No. .............. dated ..................... purporting to be sent by ....................................., requesting that I should process the said film(s) and prepare therefrom photographic print(s) and/or enlargement(s). (2) The said letter and packet were each signed and dated by me and are attached hereto as annexes 1 and 2, respectively. (3) In pursuance of the said request (I processed) the said film(s) were processed under my supervision and (prepared) therefrom photographic print(s) and/or enlargement(s) (each of) were prepared which I have signed and now attach hereto as annex(es) ........................... (4) The photographic print(s) and/or enlargement(s) attached hereto as annex(es) .............................. is/are as nearly as may be (an) exact reproduction(s) from the exposed film(s) submitted to me as aforesaid and have in no way been retouched, altered or otherwise interfered with in the process of their preparation. Given at .............. under my hand this ............ day of ............, 20 ............ ............................................. (Signed) Evidence Act (Cap. 80) Kenya 1 Evidence Act (Cap. 80) Kenya 1",
    "prev_chunk_id": 224,
    "next_chunk_id": null,
    "act_year": null
  }
]