[
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "General > Preamble",
    "chunk_index": 1,
    "chunk_id": 1,
    "text": "﻿LAW OF CONTRACT ACT CAP. 23 An Act of Parliament to apply the English common law of contract to Kenya, with certain modifications",
    "prev_chunk_id": null,
    "next_chunk_id": 2,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "1 – Short title.",
    "section_number": "1",
    "section_title": "Short title.",
    "section_path": "General > 1",
    "chunk_index": 1,
    "chunk_id": 2,
    "text": "This Act may be cited as the Law of Contract Act.",
    "prev_chunk_id": 1,
    "next_chunk_id": 3,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "2 – English law of contract to apply in Kenya.",
    "section_number": "2",
    "section_title": "English law of contract to apply in Kenya.",
    "section_path": "General > 2",
    "chunk_index": 1,
    "chunk_id": 3,
    "text": "(1) Save as may be provided by any written law for the time being in force, the common law of England relating to contract, as modified by the doctrines of equity, by the Acts of Parliament of the United Kingdom applicable by virtue of subsection 2 of this section and by the Acts of Parliament of the United Kingdom specified in the Schedule to this Act, to the extent and subject to the modifications mentioned in the said Schedule, shall extend and apply to Kenya: Provided that no contract in writing shall be void or unenforceable by reason only that it is not under seal. (2) After the commencement, and subject to section 4, of this Act, the provisions of section 74 of the Kenya (Constitution) Order in Council, 1958, shall have effect, in relation to paragraph (2) of Article 4 of the Kenya Colony Order in Council, 1921, as if the Contract Act, 1872, of India had never been applied to Kenya. [Vol. V, (1948), Act No. 9 of 1872, L.N. 87/1964, Sch.]",
    "prev_chunk_id": 2,
    "next_chunk_id": 4,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "3 – Certain contracts to be in writing.",
    "section_number": "3",
    "section_title": "Certain contracts to be in writing.",
    "section_path": "General > 3",
    "chunk_index": 1,
    "chunk_id": 4,
    "text": "(1) No suit shall be brought whereby to charge the defendant upon any special promise to answer for the debt, default or miscarriages of another person unless the agreement upon which such suit is brought, or some memorandum or note thereof, is in writing and signed by the party to be charged therewith or some other person thereunto by him lawfully authorized. (2) No suit shall be brought whereby to charge any person upon or by reason of any representation or assurance made or given concerning or relating to the character, conduct, credit, ability, trade or dealings of any other person, to the intent or purpose that such other person may obtain credit, money or goods, unless such representation or assurance is made in writing, signed by the party to be charged therewith. (3) No suit shall be brought upon a contract for the disposition of an interest in land unless— (a) the contract upon which the suit is founded— (i) is in writing; (ii) is signed by all the parties thereto; and (b) the signature of each party signing has been attested by a witness who is present when the contract was signed by such party: Provided that this subsection shall not apply to a contract made in the course of a public auction by an auctioneer within the",
    "prev_chunk_id": 3,
    "next_chunk_id": 5,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "3 – Certain contracts to be in writing.",
    "section_number": "3",
    "section_title": "Certain contracts to be in writing.",
    "section_path": "General > 3",
    "chunk_index": 2,
    "chunk_id": 5,
    "text": "a contract for the disposition of an interest in land unless— (a) the contract upon which the suit is founded— (i) is in writing; (ii) is signed by all the parties thereto; and (b) the signature of each party signing has been attested by a witness who is present when the contract was signed by such party: Provided that this subsection shall not apply to a contract made in the course of a public auction by an auctioneer within the meaning of the Auctioneers Act (Cap. 526), nor shall anything in it affect the creation of a resulting, implied or constructive trust. (4) Subsection (3) shall not apply to a contract made in the course of a public auction nor shall anything in that subsection affect the creation or operation of a resulting, implied or a constructive trust. (5) The terms of a contract may be incorporated in a document either by being set out in it or by reference to some other document. (6) For the purposes of subsection (3)— \"advanced electronic signature\" has the same meaning as defined in the Kenya Information and Communications Act (Cap. 411A); \"disposition\" includes a transfer and a device, bequest or appointment of property contained in a will; \"interest in land\" means any estate in or charge over land, or any estate in",
    "prev_chunk_id": 4,
    "next_chunk_id": 6,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "3 – Certain contracts to be in writing.",
    "section_number": "3",
    "section_title": "Certain contracts to be in writing.",
    "section_path": "General > 3",
    "chunk_index": 3,
    "chunk_id": 6,
    "text": "terms of a contract may be incorporated in a document either by being set out in it or by reference to some other document. (6) For the purposes of subsection (3)— \"advanced electronic signature\" has the same meaning as defined in the Kenya Information and Communications Act (Cap. 411A); \"disposition\" includes a transfer and a device, bequest or appointment of property contained in a will; \"interest in land\" means any estate in or charge over land, or any estate in or charge over the proceeds of sale of land; \"party\" includes any agent, auctioneer or advocate duly authorized in writing to act in the absence of the party who has given such authority; \"sign\", in relation to a contract, includes making one’s mark or writing one’s name or initial physically or by means of an advanced electronic signature on the instrument as an indication that one intends to bind himself to the contents of the instrument and in relation to a body corporate includes— (a) signature by an attorney of the body corporate duly appointed by a power of attorney registered under the Registration of Documents Act (Cap. 285); (b) the affixing of the common seal of the body corporate in accordance with the constitution or the articles of association of the body corporate, as the case may be, in",
    "prev_chunk_id": 5,
    "next_chunk_id": 7,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "3 – Certain contracts to be in writing.",
    "section_number": "3",
    "section_title": "Certain contracts to be in writing.",
    "section_path": "General > 3",
    "chunk_index": 4,
    "chunk_id": 7,
    "text": "instrument as an indication that one intends to bind himself to the contents of the instrument and in relation to a body corporate includes— (a) signature by an attorney of the body corporate duly appointed by a power of attorney registered under the Registration of Documents Act (Cap. 285); (b) the affixing of the common seal of the body corporate in accordance with the constitution or the articles of association of the body corporate, as the case may be, in which case no further attestation shall be required; (c) execution of the document in accordance with section 37 of the Companies Act (Cap. 486), for body corporates incorporated under the Companies Act (Cap. 486). \"transfer\" includes a mortgage, charge, lease, conveyance, assignment, assent, vesting declaration, vesting instrument disclaimer, release and every other assurance of property or any interest therein by any instrument other than a will or a codicil. (7) The provisions of subsection (3) shall not apply to any agreement or contract made or entered into before the commencement of that subsection. [Act No. 28 of 1968, Act No. 21 of 1990, Sch., Act No. 5 of 1996, s. 33, Act No. 2 of 2002, Sch, Act No. 1 of 2020, s. 2, Act No. 1 of 2021, s. 2.]",
    "prev_chunk_id": 6,
    "next_chunk_id": 8,
    "act_year": null
  },
  {
    "act": "Law of Contract Act",
    "part": "General",
    "section": "4 – Application of Indian Act.",
    "section_number": "4",
    "section_title": "Application of Indian Act.",
    "section_path": "General > 4",
    "chunk_index": 1,
    "chunk_id": 8,
    "text": "The Contract Act, 1872, of India (now repealed in its application to Kenya) shall, notwithstanding such repeal, continue to apply to any agreement made or contract entered into before the commencement of this Act. [Act No. 9 of 1872, Act No. 3 of 1987, s. 10.] SCHEDULE [s. 2] APPLICABLE LAWS OF THE UNITED KINGDOM The Law Reform (Married Women and Tortfeasors) Act, 1935 (25 and 26 Geo. 5, Paragraphs (b) and (c) of section 1 in so far as they relate to contract, debt or obligation (not being a debt or obligation arising out of the commission of a tort). The Law Reform (Frustrated Contracts) Act, 1943 (6 & 7 Geo. 6, c. 40) The whole Act: Provided that the reference in paragraph (c) of subsection (5) of section 2 to section seven of the Sale of Goods Act (Cap. 31) shall be construed as a reference to section 9 of the Sale of Goods Act (Cap. 31). Law of Contract Act (Cap. 23) Kenya 1 Law of Contract Act (Cap. 23) Kenya 1",
    "prev_chunk_id": 7,
    "next_chunk_id": null,
    "act_year": null
  }
]