[
  {
    "act": "Marriage Act",
    "part": "General",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "General > Preamble",
    "chunk_index": 1,
    "chunk_id": 1,
    "text": "﻿ MARRIAGE ACT CAP. 150 An Act of Parliament to amend and consolidate the various laws relating to marriage and divorce and for connected purposes",
    "prev_chunk_id": null,
    "next_chunk_id": 2,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part I – PRELIMINARY",
    "section": "1 – Short title",
    "section_number": "1",
    "section_title": "Short title",
    "section_path": "Part I – PRELIMINARY > 1",
    "chunk_index": 1,
    "chunk_id": 2,
    "text": "This Act may be cited as the Marriage Act.",
    "prev_chunk_id": 1,
    "next_chunk_id": 3,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part I – PRELIMINARY",
    "section": "2 – Interpretation",
    "section_number": "2",
    "section_title": "Interpretation",
    "section_path": "Part I – PRELIMINARY > 2",
    "chunk_index": 1,
    "chunk_id": 3,
    "text": "In this Act, unless the context otherwise requires— \"child\" means an individual who has not attained the age of eighteen years; \"cohabit\" means to live in an arrangement in which an unmarried couple lives together in a long-term relationship that resembles a marriage; \"conciliatory body\" means— (a) a body established under this Act for the purpose of reconciling parties to a marriage; (b) a mechanism of conciliation recognised under customary or Islamic law; (c) any other body designated as such by the Cabinet Secretary by notice in the Gazette; or (d) any other body established by any written law; \"court\" means a resident magistrate’s court established under section 3 of the Magistrates’ Courts Act (Cap. 10); \"dowry\" means any token of stock, goods, moneys or other property given or promised in consideration of an intended marriage; \"faith\" means an association of a religious nature and, in the case of any system of religious beliefs which is divided into denominations, sects or schools, any such denomination, sect or school; \"Hindu\" means a person who is— (a) a Hindu by religion in any form (including a Virashaiva, a Lingayat and a follower of the Brahmo, Prarthana or Arya Samaj); (b) a Buddhist of Indian origin; or (c) a Jain or a Sikh by religion; \"matrimonial proceedings\" means proceedings instituted under Part IX",
    "prev_chunk_id": 2,
    "next_chunk_id": 4,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part I – PRELIMINARY",
    "section": "2 – Interpretation",
    "section_number": "2",
    "section_title": "Interpretation",
    "section_path": "Part I – PRELIMINARY > 2",
    "chunk_index": 2,
    "chunk_id": 4,
    "text": "of a religious nature and, in the case of any system of religious beliefs which is divided into denominations, sects or schools, any such denomination, sect or school; \"Hindu\" means a person who is— (a) a Hindu by religion in any form (including a Virashaiva, a Lingayat and a follower of the Brahmo, Prarthana or Arya Samaj); (b) a Buddhist of Indian origin; or (c) a Jain or a Sikh by religion; \"matrimonial proceedings\" means proceedings instituted under Part IX and include proceedings for the payment of maintenance or for custody of children instituted independently of a petition for a declaratory decree or for annulment, separation or divorce; \"monogamous marriage\" means a marriage whose character has been converted to a monogamous marriage by a declaration made under section 8, including an originally polygamous or potentially polygamous marriage; \"party\", in relation to a marriage, an intended marriage or a purported marriage, means a spouse in a marriage, or the intended spouse to a marriage or purported spouse in a marriage; \"polygamy\" means the state or practice of a man having more than one wife simultaneously; \"prohibited marriage relationship\" has the meaning assigned to it in section 10; \"Registrar\" means a person appointed under section 50 of this Act; \"spouse\" means a husband or a wife; and \"witness\" means to be present",
    "prev_chunk_id": 3,
    "next_chunk_id": 5,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part I – PRELIMINARY",
    "section": "2 – Interpretation",
    "section_number": "2",
    "section_title": "Interpretation",
    "section_path": "Part I – PRELIMINARY > 2",
    "chunk_index": 3,
    "chunk_id": 5,
    "text": "to a marriage, an intended marriage or a purported marriage, means a spouse in a marriage, or the intended spouse to a marriage or purported spouse in a marriage; \"polygamy\" means the state or practice of a man having more than one wife simultaneously; \"prohibited marriage relationship\" has the meaning assigned to it in section 10; \"Registrar\" means a person appointed under section 50 of this Act; \"spouse\" means a husband or a wife; and \"witness\" means to be present at, to observe, and to attest to the celebration of a marriage by signing ones name to or putting ones mark on a marriage certificate.",
    "prev_chunk_id": 4,
    "next_chunk_id": 6,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "3 – Meaning of marriage",
    "section_number": "3",
    "section_title": "Meaning of marriage",
    "section_path": "Part II – GENERAL PROVISIONS > 3",
    "chunk_index": 1,
    "chunk_id": 6,
    "text": "(1) Marriage is the voluntary union of a man and a woman whether in a monogamous or polygamous union and registered in accordance with this Act. (2) Parties to a marriage have equal rights and obligations at the time of the marriage, during the marriage and at the dissolution of the marriage. (3) All marriages registered under this Act have the same legal status. (4) Subject to subsection (2), the parties to an Islamic marriage shall only have the rights granted under Islamic law.",
    "prev_chunk_id": 5,
    "next_chunk_id": 7,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "4 – Minimum age",
    "section_number": "4",
    "section_title": "Minimum age",
    "section_path": "Part II – GENERAL PROVISIONS > 4",
    "chunk_index": 1,
    "chunk_id": 7,
    "text": "A person shall not marry unless that person has attained the age of eighteen years.",
    "prev_chunk_id": 6,
    "next_chunk_id": 8,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "5 – Witnesses to a marriage",
    "section_number": "5",
    "section_title": "Witnesses to a marriage",
    "section_path": "Part II – GENERAL PROVISIONS > 5",
    "chunk_index": 1,
    "chunk_id": 8,
    "text": "(1) A marriage conducted under this Act shall be witnessed by two competent witnesses. (2) A person is not competent to act as a witness if that person is— (a) below the age of eighteen years; (b) otherwise not competent to enter into a contract because of— (i) mental disability rendering that person incapable of understanding what the parties are doing; or (ii) intoxication; (c) unable to understand, whether through an interpreter or otherwise, the language in which the ceremony is held. (3) The person who celebrates a marriage shall not be a witness to the marriage for the purposes of this section.",
    "prev_chunk_id": 7,
    "next_chunk_id": 9,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "6 – Kinds of marriages",
    "section_number": "6",
    "section_title": "Kinds of marriages",
    "section_path": "Part II – GENERAL PROVISIONS > 6",
    "chunk_index": 1,
    "chunk_id": 9,
    "text": "(1) A marriage may be registered under this Act if it is celebrated— (a) in accordance with the rites of a Christian denomination; (b) as a civil marriage; (c) in accordance with the customary rites relating to any of the communities in Kenya; (d) in accordance with the Hindu rites and ceremonies; and (e) in accordance with Islamic law. (2) A Christian, Hindu or civil marriage is monogamous. (3) A marriage celebrated under customary law or Islamic law is presumed to be polygamous or potentially polygamous.",
    "prev_chunk_id": 8,
    "next_chunk_id": 10,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "7 – Declaration of marriage registration areas",
    "section_number": "7",
    "section_title": "Declaration of marriage registration areas",
    "section_path": "Part II – GENERAL PROVISIONS > 7",
    "chunk_index": 1,
    "chunk_id": 10,
    "text": "The Cabinet Secretary may, by notice in the Gazette, declare any area of Kenya to be a registration area for the purposes of this Act.",
    "prev_chunk_id": 9,
    "next_chunk_id": 11,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "8 – Conversion of marriages",
    "section_number": "8",
    "section_title": "Conversion of marriages",
    "section_path": "Part II – GENERAL PROVISIONS > 8",
    "chunk_index": 1,
    "chunk_id": 11,
    "text": "(1) A marriage may be converted from being a potentially polygamous marriage to a monogamous marriage if each spouse voluntarily declares the intent to make such a conversion. (2) A polygamous marriage may not be converted to a monogamous marriage unless at the time of the conversion the husband has only one wife. (3) A declaration under subsection (1) shall be made in the presence of a marriage officer and shall be recorded in writing and signed by each spouse. (4) A marriage officer before whom a declaration is made under subsection (3) shall forthwith transmit a copy thereof to the Registrar. (5) Where a declaration is made under subsection (1), the Registrar shall take possession of the certificate registering the marriage as potentially polygamous and shall issue a certificate registering the marriage as monogamous. (6) The Registrar shall enter the details of converted marriages in the prescribed manner into a register maintained for that purpose.",
    "prev_chunk_id": 10,
    "next_chunk_id": 12,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "9 – Subsisting marriages",
    "section_number": "9",
    "section_title": "Subsisting marriages",
    "section_path": "Part II – GENERAL PROVISIONS > 9",
    "chunk_index": 1,
    "chunk_id": 12,
    "text": "Subject to section 8, a married person shall not, while— (a) in a monogamous marriage, contract another marriage; or (b) in a polygamous or potentially polygamous marriage, contract another marriage in any monogamous form.",
    "prev_chunk_id": 11,
    "next_chunk_id": 13,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "10 – Prohibited marriage relationship",
    "section_number": "10",
    "section_title": "Prohibited marriage relationship",
    "section_path": "Part II – GENERAL PROVISIONS > 10",
    "chunk_index": 1,
    "chunk_id": 13,
    "text": "(1) A person shall not marry— (a) that person’s grandparent, parent, child, grandchild, sister, brother, cousin, great aunt, great uncle, aunt, uncle, niece, nephew, great niece or great nephew; (b) the grandparent, parent, child or grandchild of that person’s spouse or former spouse; (c) the grandparent, parent, child or grandchild of that person’s former spouse; (d) a person whom that person has adopted or by whom that person has been adopted; or (e) any other person where such marriages is prohibited under customary law. (2) For the purposes of this section, a relationship of the half-blood is a bar to marriage. (3) A person who, by this section, is forbidden to marry shall be said to be within a prohibited marriage relationship. (4) The marriage of a person with that person’s cousin does not apply to persons who profess the Islamic faith.",
    "prev_chunk_id": 12,
    "next_chunk_id": 14,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "11 – Void marriages",
    "section_number": "11",
    "section_title": "Void marriages",
    "section_path": "Part II – GENERAL PROVISIONS > 11",
    "chunk_index": 1,
    "chunk_id": 14,
    "text": "(1) A union is not a marriage if at the time of the making of the union— (a) either party is below the minimum age for marriage; (b) the parties are within the prohibited marriage relationship; (c) either party is incompetent to marry by reason of a subsisting marriage; (d) by order made under section 25, the court has directed that the intended marriage is not to be contracted; (e) the consent of either party has not been freely given; (f) either party is absent from the ceremony; (g) both parties knowingly and willfully permit a person who is not authorised to do so to celebrate the union; (h) either party is mistaken about the identity of the other party; or (i) either party knowingly or willfully enters into the marriage for fraudulent purposes. (2) Consent is not freely given where the party who purports to give it— (a) is influenced by coercion of fraud; (b) is mistaken as to the nature or purport of the ceremony; or (c) is suffering from any mental condition whether permanent or temporary, or is intoxicated, or is under the influence of drugs, so as not to appreciate the nature or purport of the ceremony.",
    "prev_chunk_id": 13,
    "next_chunk_id": 15,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "12 – Voidable marriages",
    "section_number": "12",
    "section_title": "Voidable marriages",
    "section_path": "Part II – GENERAL PROVISIONS > 12",
    "chunk_index": 1,
    "chunk_id": 15,
    "text": "Subject to section 11, a marriage is voidable if— (a) at the date of the marriage— (i) either party was and has ever since remained incapable of consummating it; (ii) either party was and has ever since remained subject to recurrent attacks of insanity; (b) there was a failure to give notice of intention to marry under section 25; (c) notice of objection to the intended marriage having been given was not withdrawn or dismissed; (d) the fact that a person officiating the marriage was not lawfully entitled to officiate; (e) there was a failure to register the marriage.",
    "prev_chunk_id": 14,
    "next_chunk_id": 16,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "13 – Spouses and the law of tort",
    "section_number": "13",
    "section_title": "Spouses and the law of tort",
    "section_path": "Part II – GENERAL PROVISIONS > 13",
    "chunk_index": 1,
    "chunk_id": 16,
    "text": "Despite the provisions of any other written law— (a) a spouse shall not be liable for the torts of the other spouse by reason of being a spouse; (b) spouses have the same liability in tort towards each other as if they were not married; and (c) a spouse shall be entitled to claim, in any action resulting from a negligent act, omission or breach of duty, which causes loss of the companionship of the other, or damages in respect of that loss.",
    "prev_chunk_id": 15,
    "next_chunk_id": 17,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "14 – Arrangement to live apart",
    "section_number": "14",
    "section_title": "Arrangement to live apart",
    "section_path": "Part II – GENERAL PROVISIONS > 14",
    "chunk_index": 1,
    "chunk_id": 17,
    "text": "(1) The parties to a civil marriage may agree to live apart for one year and any such agreement shall be valid and enforceable, and shall be filed with the court. (2) Despite subsection (1), the court may vary or set aside the agreement or any of its provisions if the court is satisfied that since the agreement was made there has been a material change of circumstances. (3) A party to a civil marriage may apply to the court to determine their status after the expiry of the one year period from the date of agreement.",
    "prev_chunk_id": 16,
    "next_chunk_id": 18,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "15 – Rights of widow and widowers",
    "section_number": "15",
    "section_title": "Rights of widow and widowers",
    "section_path": "Part II – GENERAL PROVISIONS > 15",
    "chunk_index": 1,
    "chunk_id": 18,
    "text": "(1) A widow or widower may re-marry. (2) A widow or a widower may elect not to re-marry.",
    "prev_chunk_id": 17,
    "next_chunk_id": 19,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part II – GENERAL PROVISIONS",
    "section": "16 – Duration of marriage",
    "section_number": "16",
    "section_title": "Duration of marriage",
    "section_path": "Part II – GENERAL PROVISIONS > 16",
    "chunk_index": 1,
    "chunk_id": 19,
    "text": "A marriage registered under this Act subsists until it is determined by— (a) the death of a spouse; (b) a decree declaring the presumption of the death of a spouse; (c) a decree of annulment; (d) a decree of divorce; or (e) a decree of divorce or annulment obtained in a foreign country and recognized in Kenya under this Act.",
    "prev_chunk_id": 18,
    "next_chunk_id": 20,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "17 – Christian marriages",
    "section_number": "17",
    "section_title": "Christian marriages",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 17",
    "chunk_index": 1,
    "chunk_id": 20,
    "text": "This Part applies to a marriage where a party to the marriage professes the Christian religion.",
    "prev_chunk_id": 19,
    "next_chunk_id": 21,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "18 – Interpretation of Part",
    "section_number": "18",
    "section_title": "Interpretation of Part",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 18",
    "chunk_index": 1,
    "chunk_id": 21,
    "text": "In this Part \"marriage officer\" means a licensed church minister appointed by the registrar under section 50.",
    "prev_chunk_id": 20,
    "next_chunk_id": 22,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "19 – Objection to give a notice of intention to marry",
    "section_number": "19",
    "section_title": "Objection to give a notice of intention to marry",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 19",
    "chunk_index": 1,
    "chunk_id": 22,
    "text": "(1) A person who knows of an impediment to an intended marriage may give a written notice of objection to the person in charge of a public place of worship where notice of intended marriage has been posted in accordance with section 26. (2) A notice of objection shall include the name of the person giving the notice of objection and the person’s relationship with either of the intended parties and shall state the reason for the objection to the intended marriage. (3) A person who has given notice of objection may, at any time, withdraw the objection in writing.",
    "prev_chunk_id": 21,
    "next_chunk_id": 23,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "20 – Obligations of the church minister in relation to objection",
    "section_number": "20",
    "section_title": "Obligations of the church minister in relation to objection",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 20",
    "chunk_index": 1,
    "chunk_id": 23,
    "text": "(1) Upon receiving a notice of objection, the person in charge of a public place of worship shall hear the objection forthwith and if the person in charge of a public place of worship considers that the objection requires a further hearing, he or she shall postpone the marriage ceremony until such time as the objections will be determined in accordance with the church regulations. (2) The person in charge of a public place of worship shall determine an objection within a reasonable period which shall not be more than seven days after hearing the objection. (3) Upon determination of an objection, the person in charge of public place of worship shall prepare and submit a report of the process of determination of the objection in the prescribed form to the parties and the Registrar within seven days of determination. (4) Any party who is dissatisfied with the decision of the person in charge of a public place of worship may appeal to the court within fourteen days of the decision.",
    "prev_chunk_id": 22,
    "next_chunk_id": 24,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "21 – Signing of the marriage certificate",
    "section_number": "21",
    "section_title": "Signing of the marriage certificate",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 21",
    "chunk_index": 1,
    "chunk_id": 24,
    "text": "(1) When a marriage has been celebrated in accordance with the provisions of this Part, the person officiating at the marriage ceremony shall— (a) complete and sign a marriage certificate in the prescribed form; and (b) cause it to be signed by the parties and by the witnesses to the marriage. (2) The person officiating at the marriage ceremony shall issue— (a) one copy of the marriage certificate to the parties; (b) retain one copy of the marriage certificate; and (c) deliver one copy of the marriage certificate to the Registrar.",
    "prev_chunk_id": 23,
    "next_chunk_id": 25,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "22 – Recognition of foreign marriages as Christian marriages in Kenya",
    "section_number": "22",
    "section_title": "Recognition of foreign marriages as Christian marriages in Kenya",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 22",
    "chunk_index": 1,
    "chunk_id": 25,
    "text": "A marriage celebrated outside Kenya otherwise than in accordance with this Part, shall be recognized as a marriage under this Part if— (a) it is contracted in accordance with the law of the country where it is celebrated and is consistent with the requirements of this Part; (b) at the time of the celebration of the marriage, the parties to the marriage had the capacity to marry under the law of the country where the marriage is celebrated; or (c) at the time of the marriage any party to the marriage is domiciled in Kenya, both parties had the capacity to marry under this Act.",
    "prev_chunk_id": 24,
    "next_chunk_id": 26,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part III – CHRISTIAN MARRIAGES",
    "section": "23 – Christian marriages at the embassy, high commission or consulate",
    "section_number": "23",
    "section_title": "Christian marriages at the embassy, high commission or consulate",
    "section_path": "Part III – CHRISTIAN MARRIAGES > 23",
    "chunk_index": 1,
    "chunk_id": 26,
    "text": "A marriage celebrated in the embassy, high commission or consulate of a foreign country in Kenya is a Christian marriage under this Part if— (a) it is contracted in accordance with the law relating to Christian marriages of that foreign country; (b) at the time of the marriage, the parties had capacity to marry under the law of that foreign country and under this Act; or (c) either of the parties is at the time of the marriage domiciled in Kenya and both parties had capacity to marry under this Act.",
    "prev_chunk_id": 25,
    "next_chunk_id": 27,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "24 – Celebration of civil marriages",
    "section_number": "24",
    "section_title": "Celebration of civil marriages",
    "section_path": "Part IV – CIVIL MARRIAGE > 24",
    "chunk_index": 1,
    "chunk_id": 27,
    "text": "A marriage under this Part shall be celebrated by the Registrar in the place determined by the Registrar.",
    "prev_chunk_id": 26,
    "next_chunk_id": 28,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "25 – Notice of intention to marry",
    "section_number": "25",
    "section_title": "Notice of intention to marry",
    "section_path": "Part IV – CIVIL MARRIAGE > 25",
    "chunk_index": 1,
    "chunk_id": 28,
    "text": "(1) Where a man and a woman intend to marry under this Part, they shall give to the Registrar and the person in charge of the place where they intend to celebrate the marriage a written notice of not less than twenty-one days and not more than three months of their intention to marry. (2) A notice given under this section shall include— (a) the names and ages of the parties to the intended marriage and the places where they ordinarily reside; (b) the names of the parents of the parties, if known and alive, and the places where they ordinarily reside; (c) a declaration that the parties are not within a prohibited relationship; (d) the marital status of each party and, where a party is— (i) divorced, a copy of the relevant decree; or (ii) widowed widow or a widower, a copy of the death certificate; and (e) the date and venue of the marriage ceremony. (3) The notice under subsection (1) shall be signed by both parties.",
    "prev_chunk_id": 27,
    "next_chunk_id": 29,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "26 – Publication of notice of intention to marry",
    "section_number": "26",
    "section_title": "Publication of notice of intention to marry",
    "section_path": "Part IV – CIVIL MARRIAGE > 26",
    "chunk_index": 1,
    "chunk_id": 29,
    "text": "After receiving a notice under section 25, the Registrar shall publish such notice in the prescribed manner in the place where the marriage is to be celebrated.",
    "prev_chunk_id": 28,
    "next_chunk_id": 30,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "27 – Objection to a notice of intention to marry",
    "section_number": "27",
    "section_title": "Objection to a notice of intention to marry",
    "section_path": "Part IV – CIVIL MARRIAGE > 27",
    "chunk_index": 1,
    "chunk_id": 30,
    "text": "(1) A person who knows of an impediment to an intended marriage may give a written notice of objection to the Registrar or the person in charge of the place where a notice of intended marriage has been posted in accordance with section 26. (2) A notice of objection shall include the name of the person giving the notice of objection and the person’s relationship with either of the intended parties to the marriage and shall state the reasons for the objection to the intended marriage. (3) A person who has given a notice of objection may at any time withdraw the objection in writing.",
    "prev_chunk_id": 29,
    "next_chunk_id": 31,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "28 – Obligation of the person in charge of a place where a marriage is to be celebrated in relation to objections",
    "section_number": "28",
    "section_title": "Obligation of the person in charge of a place where a marriage is to be celebrated in relation to objections",
    "section_path": "Part IV – CIVIL MARRIAGE > 28",
    "chunk_index": 1,
    "chunk_id": 31,
    "text": "(1) Upon receiving a notice of objection, the person in charge of a place where the marriage is to be celebrated shall hear the objection forthwith and if the person in charge of the place where the marriage is to be celebrated considers that the objection requires further hearing, he or she shall postpone the marriage ceremony until such time as the objection shall be determine in accordance with the Regulations. (2) The person in charge of a place where the marriage is to be celebrated shall determine an objection within a reasonable period which shall not be more than seven days after the hearing of the objection. (3) Upon determination of an objection, the person in charge of a place where the marriage is to be celebrated shall prepare and submit a report of the process of determination of the objection in the prescribed form to the parties and the Registrar within seven days of the determination. (4) Any person who is dissatisfied with the decision of the person in charge of a place where the marriage is to be celebrated may appeal to the Court within fourteen days of the decision.",
    "prev_chunk_id": 30,
    "next_chunk_id": 32,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "29 – Determination of objection",
    "section_number": "29",
    "section_title": "Determination of objection",
    "section_path": "Part IV – CIVIL MARRIAGE > 29",
    "chunk_index": 1,
    "chunk_id": 32,
    "text": "(1) The Registrar shall hear an objection under section 28 within seven days of the Registrar receiving the notice of objection. (2) The Registrar shall determine an objection under section 28 within a reasonable period but in any case not more than seven days after the hearing under subsection (1). (3) Any party dissatisfied with the decision of the Registrar may appeal to the court within seven days of the decision by the Registrar. (4) A person who makes a frivolous, malicious or fraudulent objection commits an offence and upon conviction is liable to imprisonment for a term not exceeding five years or a fine not exceeding one million shillings or to both.",
    "prev_chunk_id": 31,
    "next_chunk_id": 33,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "30 – Effect of an appeal to an objection",
    "section_number": "30",
    "section_title": "Effect of an appeal to an objection",
    "section_path": "Part IV – CIVIL MARRIAGE > 30",
    "chunk_index": 1,
    "chunk_id": 33,
    "text": "A marriage ceremony may not be performed until any appeal that has been made against a decision of the Registrar to permit the marriage ceremony to be performed is heard and determined.",
    "prev_chunk_id": 32,
    "next_chunk_id": 34,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "31 – Appeal proceedings",
    "section_number": "31",
    "section_title": "Appeal proceedings",
    "section_path": "Part IV – CIVIL MARRIAGE > 31",
    "chunk_index": 1,
    "chunk_id": 34,
    "text": "(1) The court shall hear and determine any appeal expeditiously. (2) The court may hear and determine an appeal despite the failure of any party or other person to appear before it.",
    "prev_chunk_id": 33,
    "next_chunk_id": 35,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "32 – Certificate of no impediment",
    "section_number": "32",
    "section_title": "Certificate of no impediment",
    "section_path": "Part IV – CIVIL MARRIAGE > 32",
    "chunk_index": 1,
    "chunk_id": 35,
    "text": "(1) Where a person does not object to the celebration of a marriage, the Registrar shall issue the persons intending to marry with a certificate of no impediment. (2) Where a Kenyan wishes to celebrate a marriage outside Kenya and where that Kenyan is required to obtain a certificate of no impediment from the Registrar, such Kenyan shall apply for such a certificate and the Registrar shall issue the certificate if no person objects to the intended marriage.",
    "prev_chunk_id": 34,
    "next_chunk_id": 36,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "33 – Power of Registrar to dispense with notice",
    "section_number": "33",
    "section_title": "Power of Registrar to dispense with notice",
    "section_path": "Part IV – CIVIL MARRIAGE > 33",
    "chunk_index": 1,
    "chunk_id": 36,
    "text": "(1) Subject to section 25, the Registrar may, by licence in the prescribed form, dispense with the notice required by section 27 where there is sufficient reason to do so. (2) Before dispensing with the notice, the Registrar shall confirm that— (a) neither party is within a prohibited relationship; (b) either party is below the minimum age for marriage; (c) neither party is married to another person.",
    "prev_chunk_id": 35,
    "next_chunk_id": 37,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "34 – Effect of appeal on the findings of an objection",
    "section_number": "34",
    "section_title": "Effect of appeal on the findings of an objection",
    "section_path": "Part IV – CIVIL MARRIAGE > 34",
    "chunk_index": 1,
    "chunk_id": 37,
    "text": "(1) The provisions of section 30 apply with the necessary modifications. (2) Unless a notice of objection has been withdrawn the Registrar shall not exercise the power conferred by section 33 to dispense with a notice.",
    "prev_chunk_id": 36,
    "next_chunk_id": 38,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "35 – Contracting a civil marriage",
    "section_number": "35",
    "section_title": "Contracting a civil marriage",
    "section_path": "Part IV – CIVIL MARRIAGE > 35",
    "chunk_index": 1,
    "chunk_id": 38,
    "text": "When a marriage has been celebrated in the presence of a Registrar, the Registrar shall— (a) complete and sign a marriage certificate in the prescribed form; and (b) cause the marriage certificate to be signed by the parties and by the witnesses to the marriage and give two copies of the marriage certificate to the parties and retain one copy.",
    "prev_chunk_id": 37,
    "next_chunk_id": 39,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "36 – Certificate of no impediment",
    "section_number": "36",
    "section_title": "Certificate of no impediment",
    "section_path": "Part IV – CIVIL MARRIAGE > 36",
    "chunk_index": 1,
    "chunk_id": 39,
    "text": "(1) If the Registrar is satisfied that no impediment to the intended marriage exists, the Registrar shall celebrate the marriage. (2) If a Kenyan wishes to celebrate a civil marriage in a foreign country in accordance with the law of that country and the law of that country requires a certificate of no impediment, the Registrar may issue a certificate of no impediment.",
    "prev_chunk_id": 38,
    "next_chunk_id": 40,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "37 – Civil marriages at the Kenyan embassy, high commission or consulate for non-Kenyan citizens",
    "section_number": "37",
    "section_title": "Civil marriages at the Kenyan embassy, high commission or consulate for non-Kenyan citizens",
    "section_path": "Part IV – CIVIL MARRIAGE > 37",
    "chunk_index": 1,
    "chunk_id": 40,
    "text": "A person who is not a Kenyan may celebrate a marriage under this Part in a foreign country if the marriage is celebrated in the presence of the Registrar or a person authorised by the Registrar for that purpose in any Kenyan embassy, high commission or consulate.",
    "prev_chunk_id": 39,
    "next_chunk_id": 41,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "38 – Civil marriages in foreign countries",
    "section_number": "38",
    "section_title": "Civil marriages in foreign countries",
    "section_path": "Part IV – CIVIL MARRIAGE > 38",
    "chunk_index": 1,
    "chunk_id": 41,
    "text": "A marriage celebrated in a foreign country otherwise than in accordance with section 37 is valid if— (a) it was contracted in accordance with the law of that country and is consistent with the laws of Kenya; (b) at the time of the marriage the parties had the capacity to marry under the law of that country and is consistent with the laws of Kenya; (c) either of the parties is at the time of the marriage domiciled in Kenya, both parties had capacity to marry under this Act; and (d) if the Registrar is satisfied that the parties have obtained a certificate of no impediment if the law of that country requires the parties to an intended marriage to obtain such a certificate.",
    "prev_chunk_id": 40,
    "next_chunk_id": 42,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "39 – Civil marriages at the Kenyan embassy, high commission or Consulate for Kenyan citizens",
    "section_number": "39",
    "section_title": "Civil marriages at the Kenyan embassy, high commission or Consulate for Kenyan citizens",
    "section_path": "Part IV – CIVIL MARRIAGE > 39",
    "chunk_index": 1,
    "chunk_id": 42,
    "text": "(1) A Kenyan may celebrate a civil marriage in a Kenyan embassy, high commission or consulate in a foreign country if— (a) it is celebrated in accordance with the law of that foreign country; or (b) both parties have the capacity to marry under the law of that foreign country. (2) Despite subsection (1), a civil marriage celebrated in a Kenyan embassy, high commission or consulate in a foreign country is valid in Kenya if the parties were capable of celebrating the marriage in Kenya.",
    "prev_chunk_id": 41,
    "next_chunk_id": 43,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "40 – Recognition of foreign marriages as civil marriages in Kenya",
    "section_number": "40",
    "section_title": "Recognition of foreign marriages as civil marriages in Kenya",
    "section_path": "Part IV – CIVIL MARRIAGE > 40",
    "chunk_index": 1,
    "chunk_id": 43,
    "text": "A civil marriage contracted in a foreign country shall be recognized as a valid marriage if— (a) it is contracted in accordance with the law of that country; (b) it is consistent with the provisions of this Part; and (c) the parties have the capacity to marry under this Act.",
    "prev_chunk_id": 42,
    "next_chunk_id": 44,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "41 – Appointment of diplomatic staff as celebrants of marriage",
    "section_number": "41",
    "section_title": "Appointment of diplomatic staff as celebrants of marriage",
    "section_path": "Part IV – CIVIL MARRIAGE > 41",
    "chunk_index": 1,
    "chunk_id": 44,
    "text": "(1) The Cabinet Secretary may appoint by notice in the Gazette a member of the diplomatic staff of Kenya in a foreign country to which this Part applies to celebrate marriages under this Act in respect of that country. (2) The Registrar shall maintain a register of all marriages conducted in foreign countries.",
    "prev_chunk_id": 43,
    "next_chunk_id": 45,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IV – CIVIL MARRIAGE",
    "section": "42 – Duty to register marriages",
    "section_number": "42",
    "section_title": "Duty to register marriages",
    "section_path": "Part IV – CIVIL MARRIAGE > 42",
    "chunk_index": 1,
    "chunk_id": 45,
    "text": "(1) A person who celebrates or officiates at a marriage shall deliver a copy of the marriage certificate to the Registrar and the Registrar shall enter the details of such a certificate in a register of marriages maintained for that purpose by the Registrar. (2) Where the Registrar officiates at a marriage, the Registrar shall enter the details of the marriage in the register of marriages maintained under subsection (1). (3) A person who fails to register a marriage commits an offence and shall upon conviction be liable to a fine not exceeding five thousand shillings or to a community service order or to both.",
    "prev_chunk_id": 44,
    "next_chunk_id": 46,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part V – MARRIAGE UNDER CUSTOMARY LAW",
    "section": "43 – Governing law for Customary marriage",
    "section_number": "43",
    "section_title": "Governing law for Customary marriage",
    "section_path": "Part V – MARRIAGE UNDER CUSTOMARY LAW > 43",
    "chunk_index": 1,
    "chunk_id": 46,
    "text": "(1) A marriage under this Part shall be celebrated in accordance with the customs of the communities of one or both of the parties to the intended marriage. (2) Where the payment of dowry is required to prove a marriage under customary law, the payment of a token amount of dowry shall be sufficient to prove a customary marriage.",
    "prev_chunk_id": 45,
    "next_chunk_id": 47,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part V – MARRIAGE UNDER CUSTOMARY LAW",
    "section": "44 – Notification of Customary marriage",
    "section_number": "44",
    "section_title": "Notification of Customary marriage",
    "section_path": "Part V – MARRIAGE UNDER CUSTOMARY LAW > 44",
    "chunk_index": 1,
    "chunk_id": 47,
    "text": "The parties to a customary marriage shall notify the Registrar of such marriage within three months of completion of the relevant ceremonies or steps required to confer the status of marriage to the parties in the community concerned.",
    "prev_chunk_id": 46,
    "next_chunk_id": 48,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part V – MARRIAGE UNDER CUSTOMARY LAW",
    "section": "45 – Contents of notification of Customary marriage",
    "section_number": "45",
    "section_title": "Contents of notification of Customary marriage",
    "section_path": "Part V – MARRIAGE UNDER CUSTOMARY LAW > 45",
    "chunk_index": 1,
    "chunk_id": 48,
    "text": "(1) The notification under section 25 shall— (a) specify the customary law applied in the marriage of such parties; and (b) contain a written declaration by the parties, that the necessary customary requirements to prove the marriage have been undertaken. (2) A declaration under subsection (1) shall contain the signatures or personal marks of two adult witnesses and each witness shall have played a key cultural role in the celebrating the marriage. (3) The notification under subsection (1) shall confirm— (a) that the parties to the marriage were eighteen years of age at the time of the marriage; (b) that the marriage is between persons who are not within a prohibited marriage relationship; and (c) that the parties freely consent to the marriage.",
    "prev_chunk_id": 47,
    "next_chunk_id": 49,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VI – HINDU MARRIAGE",
    "section": "46 – Application of this Part",
    "section_number": "46",
    "section_title": "Application of this Part",
    "section_path": "Part VI – HINDU MARRIAGE > 46",
    "chunk_index": 1,
    "chunk_id": 49,
    "text": "This Part shall apply only to persons who profess the Hindu faith.",
    "prev_chunk_id": 48,
    "next_chunk_id": 50,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VI – HINDU MARRIAGE",
    "section": "47 – Persons authorised by Registrar to solemnize Hindu marriages",
    "section_number": "47",
    "section_title": "Persons authorised by Registrar to solemnize Hindu marriages",
    "section_path": "Part VI – HINDU MARRIAGE > 47",
    "chunk_index": 1,
    "chunk_id": 50,
    "text": "(1) A marriage under this Part is may be officiated by a person authorised by the Registrar and in accordance with the Hindu religious rituals of a party to the marriage. (2) A person authorised to officiate at a marriage under this Part shall record the details of a marriage under this part in the prescribed form and shall deliver the record to the Registrar for the registration of such a marriage.",
    "prev_chunk_id": 49,
    "next_chunk_id": 51,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VII – MARRIAGE UNDER ISLAMIC LAW",
    "section": "48 – Application of Islamic law",
    "section_number": "48",
    "section_title": "Application of Islamic law",
    "section_path": "Part VII – MARRIAGE UNDER ISLAMIC LAW > 48",
    "chunk_index": 1,
    "chunk_id": 51,
    "text": "This Part shall only apply to persons who profess the Islamic faith.",
    "prev_chunk_id": 50,
    "next_chunk_id": 52,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VII – MARRIAGE UNDER ISLAMIC LAW",
    "section": "49 – Officiation of Islamic marriages",
    "section_number": "49",
    "section_title": "Officiation of Islamic marriages",
    "section_path": "Part VII – MARRIAGE UNDER ISLAMIC LAW > 49",
    "chunk_index": 1,
    "chunk_id": 52,
    "text": "(1) A marriage under this Part shall be officiated by a kadhi, sheikh or imam as may be authorised by the Registrar and celebrated in accordance with Islamic law. (2) A person authorised to officiate at a marriage under this Part shall record the details of a marriage under this part in the prescribed form and shall deliver the record to the Registrar for the registration of such a marriage. (3) Any provision of this Act which is inconsistent with Islamic law and practices shall not apply to persons who profess the Islamic faith.",
    "prev_chunk_id": 51,
    "next_chunk_id": 53,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS",
    "section": "50 – Appointment of Registrar and Marriage officers",
    "section_number": "50",
    "section_title": "Appointment of Registrar and Marriage officers",
    "section_path": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS > 50",
    "chunk_index": 1,
    "chunk_id": 53,
    "text": "(1) There shall be a Registrar of Marriages who shall be appointed by the Cabinet Secretary. (2) The Registrar shall— (a) perform civil marriages; (b) register all marriages; (c) issue marriage certificates for all registered marriages; (d) issue certificates of no impediment to persons who intend to marry and who qualify for such a certificate; (e) determine the rules governing customary marriages; and (f) determine objections of notices to marry. (3) The Registrar may appoint such marriage officers at national and county levels, as may be necessary upon such terms and conditions as may be determined by the Public Service Commission for the purposes of this Act.",
    "prev_chunk_id": 52,
    "next_chunk_id": 54,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS",
    "section": "51 – Appointment of marriage officers in foreign countries",
    "section_number": "51",
    "section_title": "Appointment of marriage officers in foreign countries",
    "section_path": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS > 51",
    "chunk_index": 1,
    "chunk_id": 54,
    "text": "(1) The Registrar may by notice in the Gazette, appoint a member of the diplomatic staff of Kenya in a foreign country to celebrate civil marriages for the purposes of this Act. (2) A person appointed under subsection (1) shall keep a record of all marriages celebrated that that person in that country and shall deliver the record to the Registrar for the registration of such marriages.",
    "prev_chunk_id": 53,
    "next_chunk_id": 55,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS",
    "section": "52 – Licensing ministers of faith",
    "section_number": "52",
    "section_title": "Licensing ministers of faith",
    "section_path": "Part VIII – APPOINTMENT OF REGISTRAR OF MARRIAGES AND MARRIAGE OFFICERS > 52",
    "chunk_index": 1,
    "chunk_id": 55,
    "text": "(1) A minister of faith may apply to the Registrar to be appointed as a marriage officer for the purposes of this Act. (2) The Registrar may appoint a minister of faith who makes an application under subsection (1) as a marriage officer. (3) The Registrar shall issue a person appointed as a marriage officer under this section with a license. (4) A person appointed as a marriage officer under this section may only officiate at marriages celebrated according to the traditions of the faith in which the minister of faith serves. (5) The Registrar may cancel a license issued to a person under this section and shall give written reasons for such withdrawal. (6) A licence granted in respect of marriages under any law in operation before the commencement of this Act shall, if the licence has not been cancelled at the commencement of this Act, be deemed to be a licence granted under this section.",
    "prev_chunk_id": 54,
    "next_chunk_id": 56,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "53 – Registration of Christian marriages",
    "section_number": "53",
    "section_title": "Registration of Christian marriages",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 53",
    "chunk_index": 1,
    "chunk_id": 56,
    "text": "(1) Where a marriage is celebrated under Part III of this Act, the person officiating at the marriage shall forward a copy of the certificate of marriage to the Registrar within fourteen days of the celebration of the marriage for the registration of that marriage. (2) Before the Registrar registers a marriage under subsection (1) the Registrar shall confirm that the marriage complies with the provisions of this Act.",
    "prev_chunk_id": 55,
    "next_chunk_id": 57,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "54 – Registration of civil marriages",
    "section_number": "54",
    "section_title": "Registration of civil marriages",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 54",
    "chunk_index": 1,
    "chunk_id": 57,
    "text": "(1) Where the Registrar celebrates a marriage under Part IV of this Act, the Registrar shall register the marriage. (2) Where a marriage officer celebrates a marriage under Part IV, the marriage officer shall record the details of the marriage in the prescribed form and forward the record to the Registrar and the Registrar shall register the marriage. (3) The Registrar shall issue a certificate of marriage to the parties to a marriage celebrated under Part IV of this Act.",
    "prev_chunk_id": 56,
    "next_chunk_id": 58,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "55 – Registration of Customary marriage",
    "section_number": "55",
    "section_title": "Registration of Customary marriage",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 55",
    "chunk_index": 1,
    "chunk_id": 58,
    "text": "(1) Where the parties to a marriage under Part V have completed the necessary rituals for their union to be recognised as a marriage under the customary law of any of the parties both shall apply to the Registrar within six months of their marriage for a certificate and both shall appear in person before the Registrar to be issued with the certificate of marriage. (2) Where the Registrar is satisfied that the parties to a marriage under Part V have complied with the provisions of this Act, and the parties have appeared before him in person, the Registrar shall register the marriage and issue the parties with a certificate of marriage.",
    "prev_chunk_id": 57,
    "next_chunk_id": 59,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "56 – Registration of Hindu marriages",
    "section_number": "56",
    "section_title": "Registration of Hindu marriages",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 56",
    "chunk_index": 1,
    "chunk_id": 59,
    "text": "(1) Where a person authorised by the Registrar celebrates a marriage under Part VI, that person shall record the details of the marriage in the prescribed form and deliver the record to the Registrar and the Registrar shall register the marriage. (2) Before the Registrar registers a marriage celebrated under Part VI, the Registrar shall confirm that the marriage complies with the provisions of this Act. (3) The Cabinet Secretary may make rules regarding the registration of marriages under Part VI of this Act.",
    "prev_chunk_id": 58,
    "next_chunk_id": 60,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "57 – Registration of Islamic marriages",
    "section_number": "57",
    "section_title": "Registration of Islamic marriages",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 57",
    "chunk_index": 1,
    "chunk_id": 60,
    "text": "(1) Where a Kadhi, sheikh, Mukhi or imam authorised by the Registrar celebrates a marriage under Part VII of this Act, the Kadhi, sheikh, Mukhi or imam shall— (a) record the details of the marriage; (b) issue the parties to the marriage with a certificate of marriage; and (c) deliver the record and certificate to the Registrar. (2) Where the Registrar receives a record and certificate of a marriage celebrated under Part VII and the Registrar is satisfied that the provisions of this Act have been complied with, the Registrar shall register the marriage.",
    "prev_chunk_id": 59,
    "next_chunk_id": 61,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "58 – Registration of marriages contracted abroad",
    "section_number": "58",
    "section_title": "Registration of marriages contracted abroad",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 58",
    "chunk_index": 1,
    "chunk_id": 61,
    "text": "(1) A Kenyan who celebrates a marriage outside Kenya may apply to the Registrar to have that marriage registered and the Registrar may register such a marriage only when the Registrar is satisfied that the marriage complies with the provisions of this Act. (2) The Registrar may consider a marriage certificate issued in that country or such other proof as the Registrar may consider sufficient before registering a marriage celebrated outside Kenya and where a marriage certificate is not in the official languages it shall be accompanied by a certified translation into the official languages.",
    "prev_chunk_id": 60,
    "next_chunk_id": 62,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "59 – Evidence of marriage",
    "section_number": "59",
    "section_title": "Evidence of marriage",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 59",
    "chunk_index": 1,
    "chunk_id": 62,
    "text": "(1) A marriage may be proven in Kenya by— (a) a certificate of marriage issued under this Act or any other written law; (b) a certified copy of a certificate of marriage issued under this Act or any other written law; (c) an entry in a register of marriages maintained under this Act or any other written law; (d) a certified copy of an entry in a register of marriages maintained under this Act or any other written law; or (e) an entry in a register of marriages maintained by the proper authority of the Khoja Shia, Ith’nasheri, Shia imam, Ismaili or Bohra communities, or a certified copy of such an entry. (2) Despite subsection (1), a marriage may be proven in Kenya if it was celebrated in a public place of worship but its registration was not required, by an entry in any register maintained at that public place of worship or a certified copy of such an entry.",
    "prev_chunk_id": 61,
    "next_chunk_id": 63,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "60 – Copies of decrees of annulment and divorce to be sent to Registrar",
    "section_number": "60",
    "section_title": "Copies of decrees of annulment and divorce to be sent to Registrar",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 60",
    "chunk_index": 1,
    "chunk_id": 63,
    "text": "Where a court grants a decree of the annulment of a marriage or the dissolution of a marriage, it shall deliver a certified copy of the decree to the Registrar and the Registrar shall register the annulment or dissolution in a register maintained for the purpose.",
    "prev_chunk_id": 62,
    "next_chunk_id": 64,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "61 – Registration of foreign annulments and divorces",
    "section_number": "61",
    "section_title": "Registration of foreign annulments and divorces",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 61",
    "chunk_index": 1,
    "chunk_id": 64,
    "text": "(1) Where a marriage celebrated in Kenya is annulled or dissolved by a decree of a foreign court, any party to the annulled or dissolved marriage may apply to the Registrar to register the decree. (2) Where the Registrar is satisfied that a decree under this section should be recognised in Kenya as if the decree was made by a Kenyan court, the Registrar shall register the decree in a register maintained for the purpose. (3) An application under this section shall include— (a) a copy of the decree and where the decree is not in an official language, a certified translation of the decree in an official language and in the prescribed form; and (b) a declaration under the law of the country in which the decree was obtained made to a legal practitioner authorised to witness such a declaration that states the decree is effective in that country as if the marriage had been celebrated in that country.",
    "prev_chunk_id": 63,
    "next_chunk_id": 65,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "62 – Endorsement of marriage registers",
    "section_number": "62",
    "section_title": "Endorsement of marriage registers",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 62",
    "chunk_index": 1,
    "chunk_id": 65,
    "text": "(1) The Registrar shall enter the details of the declaration made under section 8 against the relevant entry in the register of marriages. (2) The Registrar shall enter the details of the decree registered under section 60 against the relevant entry in the register of marriages and such an entry shall be sufficient proof that the marriage has been determined by a foreign decree of annulment or dissolution of marriage.",
    "prev_chunk_id": 64,
    "next_chunk_id": 66,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part IX – REGISTRATION OF MARRIAGES",
    "section": "63 – Correction of errors",
    "section_number": "63",
    "section_title": "Correction of errors",
    "section_path": "Part IX – REGISTRATION OF MARRIAGES > 63",
    "chunk_index": 1,
    "chunk_id": 66,
    "text": "(1) A party to a marriage may apply to the Registrar or to a marriage officer or to a person authorised by the Registrar to correct a clerical error or omission in a register of marriage or a certificate of marriage regarding that person’s marriage. (2) Where the Registrar, a marriage officer or a person authorised by the Registrar makes a correction under subsection (1), the Registrar, marriage officer or person authorised by the Registrar shall sign and date the correction and shall enter the details of the correction against the relevant entry in the register of marriage. (3) The Registrar shall notify the parties to a marriage of any changes made in the register of marriage or marriage certificate within a reasonable period of the changes being made.",
    "prev_chunk_id": 65,
    "next_chunk_id": 67,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "Preamble – Preamble",
    "section_number": "Preamble",
    "section_title": "Preamble",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > Preamble",
    "chunk_index": 1,
    "chunk_id": 67,
    "text": "Dissolution of a Christian marriage",
    "prev_chunk_id": 66,
    "next_chunk_id": 68,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "64 – Mediation of disputes in Christian marriages",
    "section_number": "64",
    "section_title": "Mediation of disputes in Christian marriages",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 64",
    "chunk_index": 1,
    "chunk_id": 68,
    "text": "The parties to a marriage celebrated under Part III may seek the services of any reconciliation bodies established for that purpose that may exist in the public place of worship where the marriage was celebrated.",
    "prev_chunk_id": 67,
    "next_chunk_id": 69,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "65 – Grounds for dissolution of a Christian marriage",
    "section_number": "65",
    "section_title": "Grounds for dissolution of a Christian marriage",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 65",
    "chunk_index": 1,
    "chunk_id": 69,
    "text": "A party to a marriage celebrated under Part III may petition the court for a decree for the dissolution of the marriage on the ground of— (a) one or more acts of adultery committed by the other party; (b) cruelty, whether mental or physical, inflicted by the other party on the petitioner or on the children, if any, of the marriage; (c) desertion by either party for at least three years immediately preceding the date of presentation of the petition; (d) exceptional depravity by either party; or (e) the irretrievable breakdown of the marriage. Dissolution of a civil marriage",
    "prev_chunk_id": 68,
    "next_chunk_id": 70,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "66 – Right to petition for separation or divorce",
    "section_number": "66",
    "section_title": "Right to petition for separation or divorce",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 66",
    "chunk_index": 1,
    "chunk_id": 70,
    "text": "(1) A party to a marriage celebrated under Part IV may not petition the court for the separation of the parties or for the dissolution of the marriage unless three years have elapsed since the celebration of the marriage. (2) A party to a marriage celebrated under Part IV may only petition the court for the separation of the parties or the dissolution of the marriage on the following grounds— (a) adultery by the other spouse; (b) cruelty by the other spouse; (c) exceptional depravity by the other spouse; (d) desertion by the other spouse for at least three years; or (e) the irretrievable breakdown of the marriage. (3) The petitioner may file the petition with the court for the separation of the parties or the dissolution of the marriage despite any effort to reconcile the parties. (4) The court may refer a matrimonial dispute that arises in a marriage celebrated under Part IV to a conciliatory process agreed between the parties. (5) The proceedings for the dissolution of a marriage celebrated under Part IV may be adjourned for a period not exceeding six months as the court may think fit— (a) for the court to make further enquiries; or (b) for further attempts at reconciliation to be made by the parties to the marriage. (6) A marriage has irretrievably",
    "prev_chunk_id": 69,
    "next_chunk_id": 71,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "66 – Right to petition for separation or divorce",
    "section_number": "66",
    "section_title": "Right to petition for separation or divorce",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 66",
    "chunk_index": 2,
    "chunk_id": 71,
    "text": "may refer a matrimonial dispute that arises in a marriage celebrated under Part IV to a conciliatory process agreed between the parties. (5) The proceedings for the dissolution of a marriage celebrated under Part IV may be adjourned for a period not exceeding six months as the court may think fit— (a) for the court to make further enquiries; or (b) for further attempts at reconciliation to be made by the parties to the marriage. (6) A marriage has irretrievably broken down if— (a) a spouse commits adultery; (b) a spouse is cruel to the other spouse or to any child of the marriage; (c) a spouse willfully neglects the other spouse for at least two years immediately preceding the date of presentation of the petition; (d) the spouses have been separated for at least two years, whether voluntary or by decree of the court; (e) a spouse has deserted the other spouse or at least three years immediately preceding the date of presentation of the petition; (f) a spouse has been sentenced to a term of imprisonment for life or for a term of seven years or more; (g) a spouse suffers from incurable insanity, where two doctors, at least one of whom is qualified or experienced in psychiatry, have certified that the insanity is incurable or that recovery",
    "prev_chunk_id": 70,
    "next_chunk_id": 72,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "66 – Right to petition for separation or divorce",
    "section_number": "66",
    "section_title": "Right to petition for separation or divorce",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 66",
    "chunk_index": 3,
    "chunk_id": 72,
    "text": "by decree of the court; (e) a spouse has deserted the other spouse or at least three years immediately preceding the date of presentation of the petition; (f) a spouse has been sentenced to a term of imprisonment for life or for a term of seven years or more; (g) a spouse suffers from incurable insanity, where two doctors, at least one of whom is qualified or experienced in psychiatry, have certified that the insanity is incurable or that recovery is improbable during the life time of the respondent in the light of existing medical knowledge; or (h) any other ground as the court may deem appropriate.",
    "prev_chunk_id": 71,
    "next_chunk_id": 73,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "67 – Recognition of decree by foreign court in matrimonial proceedings",
    "section_number": "67",
    "section_title": "Recognition of decree by foreign court in matrimonial proceedings",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 67",
    "chunk_index": 1,
    "chunk_id": 73,
    "text": "Where a foreign court has granted a decree in matrimonial proceedings whether arising out of a marriage celebrated in Kenya or elsewhere, that decree shall be recognized in Kenya if— (a) either party is domiciled in the country where that court has jurisdiction or had been ordinarily resident in Kenya for at least two years immediately preceding the date of institution of proceedings; or (b) being a decree of annulment, divorce or separation, it is effective in the country of domicile of the parties or either of them. Dissolution of a customary marriage",
    "prev_chunk_id": 72,
    "next_chunk_id": 74,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "68 – Mediation of disputes in Customary marriages",
    "section_number": "68",
    "section_title": "Mediation of disputes in Customary marriages",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 68",
    "chunk_index": 1,
    "chunk_id": 74,
    "text": "(1) The parties to a marriage celebrated under Part V may undergo a process of conciliation or customary dispute resolution before the court may determine a petition for the dissolution of the marriage. (2) The process of mediation or traditional dispute resolution in subsection (1) shall conform to the principles of the Constitution. (3) The person who takes the parties to a marriage celebrated under Part V through the process of conciliation or traditional dispute resolution shall prepare a report of the process for the court.",
    "prev_chunk_id": 73,
    "next_chunk_id": 75,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "69 – Grounds for divorce of Customary marriages",
    "section_number": "69",
    "section_title": "Grounds for divorce of Customary marriages",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 69",
    "chunk_index": 1,
    "chunk_id": 75,
    "text": "(1) A Party to a marriage celebrated under Part V may petition the court for the dissolution of the marriage on the ground of— (a) adultery; (b) cruelty; (c) desertion; (d) exceptional depravity; (e) irretrievable breakdown of the marriage; or (f) any valid ground under the customary law of the petitioner. (2) The Cabinet Secretary may, in consultation with the communities make regulations for the implementation of this section. Dissolution of a Hindu Marriage",
    "prev_chunk_id": 74,
    "next_chunk_id": 76,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "70 – Grounds for divorce of Hindu marriages",
    "section_number": "70",
    "section_title": "Grounds for divorce of Hindu marriages",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 70",
    "chunk_index": 1,
    "chunk_id": 76,
    "text": "A party to a marriage celebrated under Part VI may petition the court for the dissolution of the marriage on the ground that— (a) the marriage has irretrievably broken down; (b) the other party has deserted the petitioner for at least three years before the making of the petition; (c) the other party has converted to another religion; (d) since the celebration of the marriage, the other party has committed rape, sodomy, bestiality or adultery; (e) the other party has committed cruelty on the other; and (f) the other party has committed exceptional depravity on the other. Dissolution of an Islamic marriage",
    "prev_chunk_id": 75,
    "next_chunk_id": 77,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "71 – Governing law for Islamic divorce matters",
    "section_number": "71",
    "section_title": "Governing law for Islamic divorce matters",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 71",
    "chunk_index": 1,
    "chunk_id": 77,
    "text": "The dissolution of marriage celebrated under Part VII shall be governed by Islamic law.",
    "prev_chunk_id": 76,
    "next_chunk_id": 78,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "72 – Registration of divorce under Islamic law",
    "section_number": "72",
    "section_title": "Registration of divorce under Islamic law",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 72",
    "chunk_index": 1,
    "chunk_id": 78,
    "text": "Where a Kadhi, sheikh, imam or person authorised by the Registrar grants a decree for the dissolution of a marriage celebrated under Part VII, the Kadhi, sheikh, imam, Mukhi or authorised person shall deliver a copy of the decree to the Registrar. Annulment of Marriage",
    "prev_chunk_id": 77,
    "next_chunk_id": 79,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "73 – Grounds for annulment of marriage",
    "section_number": "73",
    "section_title": "Grounds for annulment of marriage",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 73",
    "chunk_index": 1,
    "chunk_id": 79,
    "text": "(1) A party to a marriage may petition the court to annul the marriage on the ground that— (a) the marriage has not been consummated since its celebration; (b) at the time of the marriage and without the knowledge of either party, the parties were in a prohibited relationship; (c) in the case of a monogamous marriage, at the time of the marriage one of the parties was married to another person; (d) the petitioner’s consent was not freely given; (e) a party to the marriage was absent at the time of the celebration of the marriage; (f) at the time of the marriage and without the knowledge of the husband, the wife is pregnant and that the husband is not responsible for the pregnancy; or (g) at the time of the marriage and without the knowledge of the petitioner, the other party suffers recurrent bouts of insanity. (2) The court shall only grant a decree of annulment if— (a) the petition is made within one year of the celebration of the marriage; (b) at the date of the marriage and regarding subsections (1)(b) and (c), the petitioner was ignorant of the facts alleged in the petition; and (c) the marriage has not been consummated since the petition was made to the court.",
    "prev_chunk_id": 78,
    "next_chunk_id": 80,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "74 – Party to petition for annulment of marriage",
    "section_number": "74",
    "section_title": "Party to petition for annulment of marriage",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 74",
    "chunk_index": 1,
    "chunk_id": 80,
    "text": "(1) A petition for annulment may be presented only by one of the parties. (2) Where a petitioner alleges facts of which only one party was ignorant at the date of that marriage, it may be presented only by that party. (3) Where a petitioner alleges the willful refusal of one party to consummate the marriage it may not be presented by the party against whom the allegation is made.",
    "prev_chunk_id": 79,
    "next_chunk_id": 81,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS",
    "section": "75 – Effect of a decree of annulment",
    "section_number": "75",
    "section_title": "Effect of a decree of annulment",
    "section_path": "Part X – MATRIMONIAL DISPUTES AND MATRIMONIAL PROCEEDINGS > 75",
    "chunk_index": 1,
    "chunk_id": 81,
    "text": "The parties to a marriage which has been annulled by decree absolute of the court shall be deemed never to have been married but a decree of annulment shall not— (a) render lawful anything which was done unlawfully during the marriage or render unlawful anything which was done lawfully during the marriage; or (b) affect the competence of either of the parties as a witness in respect of anything done or omitted to be done, or any privilege in respect of communications between them, during the— (i) marriage; or (ii) relieve either party of any debt properly incurred on behalf of the other during the marriage.",
    "prev_chunk_id": 80,
    "next_chunk_id": 82,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XI – OTHER RIGHTS OF ACTION",
    "section": "76 – Effect of a promise to marry",
    "section_number": "76",
    "section_title": "Effect of a promise to marry",
    "section_path": "Part XI – OTHER RIGHTS OF ACTION > 76",
    "chunk_index": 1,
    "chunk_id": 82,
    "text": "Except as provided in this section a promise by a person to marry another person is not binding.",
    "prev_chunk_id": 81,
    "next_chunk_id": 83,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "77 – Grounds for order of maintenance",
    "section_number": "77",
    "section_title": "Grounds for order of maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 77",
    "chunk_index": 1,
    "chunk_id": 83,
    "text": "(1) The court may order a person to pay maintenance to a spouse or a former spouse— (a) if the person has refused or neglected to provide for the spouse or former spouse as required by this Act; (b) if the person has deserted the other spouse or former spouse, for as long as the desertion continues; (c) during the course of any matrimonial proceedings; (d) when granting or after granting a decree of separation or divorce; or (e) if, after making a decree of presumption of death, the spouse or former is found to be alive. (2) The court may order the payment of maintenance to a spouse or former spouse where a decree of separation, divorce or presumption of death is issued by a foreign court and the court may declare that the decree of separation, divorce or presumption of death is effective for the purposes of this section.",
    "prev_chunk_id": 82,
    "next_chunk_id": 84,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "78 – Lapsing of maintenance",
    "section_number": "78",
    "section_title": "Lapsing of maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 78",
    "chunk_index": 1,
    "chunk_id": 84,
    "text": "Except where an order for maintenance of a spouse is expressed to be for any shorter period or where any such order has revoked and subject to section 79, the order shall lapse— (a) if the maintenance was unsecured, on the death of the spouse; (b) if the maintenance was secured, on the death of the spouse in whose favour it was made; or (c) where the person being maintained is subsequently able to support himself or herself.",
    "prev_chunk_id": 83,
    "next_chunk_id": 85,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "79 – Termination of an order of maintenance",
    "section_number": "79",
    "section_title": "Termination of an order of maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 79",
    "chunk_index": 1,
    "chunk_id": 85,
    "text": "An order of maintenance shall lapse upon the remarriage of the beneficiary of the order.",
    "prev_chunk_id": 84,
    "next_chunk_id": 86,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "80 – Revocation and variation of an order for maintenance",
    "section_number": "80",
    "section_title": "Revocation and variation of an order for maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 80",
    "chunk_index": 1,
    "chunk_id": 86,
    "text": "(1) The court may revoke or vary a subsisting order for maintenance of any kind, whether secured or unsecured, if it is satisfied that the order was based or obtained as the result of any misrepresentation or mistake of fact or that there has been a material change of circumstances since the order was made. (2) The court may vary the terms of an agreement as to maintenance between spouses wherever made if satisfied that there has been a material change of circumstances since the agreement was made despite any provision to the contrary contained therein.",
    "prev_chunk_id": 85,
    "next_chunk_id": 87,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "81 – Assessment of maintenance",
    "section_number": "81",
    "section_title": "Assessment of maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 81",
    "chunk_index": 1,
    "chunk_id": 87,
    "text": "Maintenance payable to a person under an order of the court shall not be assigned or transferred or liable to be attached, sequestrated or levied upon for, or in respect of, any debt or claim.",
    "prev_chunk_id": 86,
    "next_chunk_id": 88,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "82 – Recovery of maintenance arrears",
    "section_number": "82",
    "section_title": "Recovery of maintenance arrears",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 82",
    "chunk_index": 1,
    "chunk_id": 88,
    "text": "(1) Despite any other period of limitation prescribed by the Limitation of Actions Act (Cap. 22), no instalment of maintenance shall be recoverable in proceedings instituted after a period of three years from the date upon which the instalment accrued. (2) Subject to subsection (1), arrears of unsecured maintenance, whether payable by agreement under an order of the court, shall be a civil debt recoverable summarily or, where they accrued due before the making of a receiving order against the party in default, shall be provable in subsequent bankruptcy proceedings and where they accrued before death, shall be a debt from the estate of the deceased. (3) Subject to subsection (1) arrears of unsecured maintenance which accrued before the death of the person entitled shall be a civil debt recoverable summarily by the legal personal representative of that person.",
    "prev_chunk_id": 87,
    "next_chunk_id": 89,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "83 – Compounding of maintenance",
    "section_number": "83",
    "section_title": "Compounding of maintenance",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 83",
    "chunk_index": 1,
    "chunk_id": 89,
    "text": "(1) The court may, if it is satisfied that a disposition of property has been made by the spouse or former spouse of the person by or on whose behalf the application is made, within the preceding three years, with the object on the part of the person making the disposition of reducing the means to pay maintenance or of depriving a spouse of any rights in relation to that property, or is intended to be made with any such object, on application, set aside the disposition or grant an injunction prohibiting that disposition, as the case may be. (2) Where the disposition of property under subsection (1) is by sale to a bona fide purchaser for value, the court may grant orders as though the sale had taken place. (3) In this section, \"disposition\" includes a sale, lease, mortgage or other transaction whereby ownership or possession of the property is transferred or encumbered but does not include a disposition made from money or monies worth to or in favour of a person acting in good faith and in ignorance of the object for which the disposition is made.",
    "prev_chunk_id": 88,
    "next_chunk_id": 90,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "84 – Other relief",
    "section_number": "84",
    "section_title": "Other relief",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 84",
    "chunk_index": 1,
    "chunk_id": 90,
    "text": "(1) The court may order a party to refrain from molesting a spouse or former spouse. (2) No proceedings may be brought to compel one spouse to cohabit with the other, but a spouse who alleges that he or she has been deserted may refer the matter to a conciliatory body. (3) Where either the husband or wife has, without reasonable grounds, withdrawn from the society of the other, the aggrieved party may make an application to the court for restitution of conjugal rights and the court, on being satisfied of the truth of the statements made in such application and there being no legal ground why the application should not be granted, may order restitution of conjugal rights accordingly.",
    "prev_chunk_id": 89,
    "next_chunk_id": 91,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS",
    "section": "85 – Order concerning children",
    "section_number": "85",
    "section_title": "Order concerning children",
    "section_path": "Part XII – MAINTENANCE OF SPOUSE AND OTHER RELIEFS > 85",
    "chunk_index": 1,
    "chunk_id": 91,
    "text": "Custody and maintenance of children shall be dealt with in accordance with the Children Act (Cap. 141) and any other written law relating to children.",
    "prev_chunk_id": 90,
    "next_chunk_id": 92,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "86 – False statement in the notice of intention to marry or notice of objection",
    "section_number": "86",
    "section_title": "False statement in the notice of intention to marry or notice of objection",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 86",
    "chunk_index": 1,
    "chunk_id": 92,
    "text": "(1) Any person who, in a notice of intention to marry under section 25 or notice of objection to an intended marriage under section 28, makes a false statement commits an offence and shall on conviction be liable to imprisonment for a term not exceeding two years or fine not exceeding two million shillings or to both. (2) A person does not commit an offence under this section if that person had reasonable grounds for believing the statement to be true when that person made the statement.",
    "prev_chunk_id": 91,
    "next_chunk_id": 93,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "87 – Marriage to a person under minimum age",
    "section_number": "87",
    "section_title": "Marriage to a person under minimum age",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 87",
    "chunk_index": 1,
    "chunk_id": 93,
    "text": "Any person who marries a person who is below the minimum age commits an offence and shall on conviction be liable to imprisonment for a term not exceeding five years or a fine not exceeding one million shillings or to both.",
    "prev_chunk_id": 92,
    "next_chunk_id": 94,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "88 – Marriage of persons within prohibited marriage relationship",
    "section_number": "88",
    "section_title": "Marriage of persons within prohibited marriage relationship",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 88",
    "chunk_index": 1,
    "chunk_id": 94,
    "text": "(1) A party to a purported celebration of a marriage where the parties are within a prohibited marriage relationship commits an offence and shall on conviction be liable to imprisonment for a term not exceeding five years or a fine not exceeding three hundred thousand shillings or to both. (2) A person may not be convicted of an offence under this section if that person did not know and could not reasonably have been expected to discover the relationship. (3) A person charged under subsection (1) may include a witness to the purported celebration of the marriage.",
    "prev_chunk_id": 93,
    "next_chunk_id": 95,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "89 – Coercion, fraud, etc.",
    "section_number": "89",
    "section_title": "Coercion, fraud, etc.",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 89",
    "chunk_index": 1,
    "chunk_id": 95,
    "text": "A party to a ceremony purporting to be a marriage, who at the time, knows or has reason to believe that the consent of the other party was induced by coercion or fraud or by a mistake as to the nature of the ceremony, or that the other party was suffering from any mental disorders or mental disability, whether permanent or temporary, or was intoxicated or under the influence of drugs, so as not fully to appreciate the nature or purport or the ceremony, commits an offence and shall on conviction be liable to imprisonment for a term not exceeding three years or a fine of three hundred thousand shillings or to both.",
    "prev_chunk_id": 94,
    "next_chunk_id": 96,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "90 – Ceremony performed by unauthorized person",
    "section_number": "90",
    "section_title": "Ceremony performed by unauthorized person",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 90",
    "chunk_index": 1,
    "chunk_id": 96,
    "text": "A person who celebrates a union purporting to be a marriage and who at the time of the ceremony is not authorised to do so commits an offence and shall on conviction be liable to imprisonment for a term not exceeding three years or a fine of three hundred thousand shillings or to both.",
    "prev_chunk_id": 95,
    "next_chunk_id": 97,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "91 – Absence of witnesses",
    "section_number": "91",
    "section_title": "Absence of witnesses",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 91",
    "chunk_index": 1,
    "chunk_id": 97,
    "text": "A person who celebrates a union purporting to be a marriage at which the required witnesses are not present commits an offence and shall on conviction be liable to imprisonment for a term not exceeding three months or a fine not exceeding ten thousand shillings or to both.",
    "prev_chunk_id": 96,
    "next_chunk_id": 98,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIII – OFFENCES AND PENALTIES",
    "section": "92 – Offence relating to the celebration or witnessing of a union",
    "section_number": "92",
    "section_title": "Offence relating to the celebration or witnessing of a union",
    "section_path": "Part XIII – OFFENCES AND PENALTIES > 92",
    "chunk_index": 1,
    "chunk_id": 98,
    "text": "(1) A person commits an offence if that person celebrates or witnesses a union purporting to be a marriage where that person knows or should know that— (a) at least one party is below the age of eighteen years; (b) a notice of intention to marry where required has not been given; or (c) a notice of objection to the intended marriage has been given and the objection has not been withdrawn, dismissed or determined. (2) A person convicted under subsection (1) is liable to imprisonment for a term not exceeding six months or a fine not exceeding fifty thousand shillings or to both.",
    "prev_chunk_id": 97,
    "next_chunk_id": 99,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIV – MISCELLANEOUS PROVISIONS",
    "section": "93 – Celebration of other marriages",
    "section_number": "93",
    "section_title": "Celebration of other marriages",
    "section_path": "Part XIV – MISCELLANEOUS PROVISIONS > 93",
    "chunk_index": 1,
    "chunk_id": 99,
    "text": "(1) A marriage recognised under section 6 may be celebrated in accordance to the rules made by the Cabinet Secretary. (2) The Cabinet Secretary may make rules for the celebration of any marriage.",
    "prev_chunk_id": 98,
    "next_chunk_id": 100,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIV – MISCELLANEOUS PROVISIONS",
    "section": "94 – Provisions on delegated powers",
    "section_number": "94",
    "section_title": "Provisions on delegated powers",
    "section_path": "Part XIV – MISCELLANEOUS PROVISIONS > 94",
    "chunk_index": 1,
    "chunk_id": 100,
    "text": "(1) The Cabinet Secretary may make regulations for the better carrying into effect of this Act. (2) Despite subsection (1), regulations may provide for— (a) forms to be used and fees to be paid in respect of any application or licence made or issued; (b) the manner in which notices of intention to marry are to be made known; (c) the form for the giving of any notice required under this Act; (d) the form of explanation to be given by a person authorised by the Registrar to the parties to an intended marriage in civil form or according to rites recognized by customary law as the case may be before asking them whether the marriage is to be monogamous or polygamous or potentially polygamous; (e) the forms of licences and marriage certificate to be issued by the Registrar; (f) the form of statement of particulars relating to marriage to be used by registration officers; (g) the procedure for registration and the form of returns to be made and the register to be kept under this Act; (h) the payment of fees under this Act; and (i) anything required to be prescribed under this Act.",
    "prev_chunk_id": 99,
    "next_chunk_id": 101,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIV – MISCELLANEOUS PROVISIONS",
    "section": "95 – Rules",
    "section_number": "95",
    "section_title": "Rules",
    "section_path": "Part XIV – MISCELLANEOUS PROVISIONS > 95",
    "chunk_index": 1,
    "chunk_id": 101,
    "text": "The Rules Committee established under the provisions of the Civil Procedure Act (Cap. 21) may make rules regulating court practice or procedure under this Act.",
    "prev_chunk_id": 100,
    "next_chunk_id": 102,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIV – MISCELLANEOUS PROVISIONS",
    "section": "96 – Transitional Provisions",
    "section_number": "96",
    "section_title": "Transitional Provisions",
    "section_path": "Part XIV – MISCELLANEOUS PROVISIONS > 96",
    "chunk_index": 1,
    "chunk_id": 102,
    "text": "(1) A person who, immediately before the date of commencement of this Act, was a Registrar of Marriages under the Marriage Act (Repealed) or the African Christian Marriage and Divorce Act (Repealed), or an assistant Registrar under the Islamic Marriage and Divorce Registration Act (Repealed), shall, as soon as practicable thereafter, send all registers of marriages and divorces to the Registrar. (2) Parties to a marriage contracted under customary law, the Hindu Marriage and Divorce Act (Repealed) or the Islamic Marriage and Divorce Registration Act (Repealed) before commencement of this Act, which is not registered shall apply to the Registrar or County Registrar to assistant Registrar for the registration of that marriage under this Act within three years of the coming to force of this Act. (3) The parties to a customary marriage shall register such a marriage within three years of the coming to force of this Act. (4) The Cabinet Secretary may extend the registration period under this section by notice in the Gazette.",
    "prev_chunk_id": 101,
    "next_chunk_id": 103,
    "act_year": null
  },
  {
    "act": "Marriage Act",
    "part": "Part XIV – MISCELLANEOUS PROVISIONS",
    "section": "98 – Savings",
    "section_number": "98",
    "section_title": "Savings",
    "section_path": "Part XIV – MISCELLANEOUS PROVISIONS > 98",
    "chunk_index": 1,
    "chunk_id": 103,
    "text": "(1) A subsisting marriage which under any written or customary law hitherto in force constituted a valid marriage immediately before the coming to force of this Act is valid for the purposes of this Act. (2) Proceedings commenced under any written law shall, so far as practicable, be continued in accordance with the provisions of this Act. (3) Despite subsection (2), an order for judicial separation or decree of divorce granted under any written law shall in relation to the powers of the court regarding maintenance be deemed to be a decree of separation or divorce as the case may granted under this Act. SCHEDULE [s. 97] REPEALED ACTS [Spent] Marriage Act (Cap. 150) Kenya 1 Marriage Act (Cap. 150) Kenya 1",
    "prev_chunk_id": 102,
    "next_chunk_id": null,
    "act_year": null
  }
]